{
  "updated_at": "2026-02-11T17:08:40.123Z",
  "jst_date": "2026-02-12",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-12",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find your passionate spirit dampened by a stark dose of reality. Remember to extend some trust to those around you; their insights could surprise you with their depth. Seeking candid opinions from trusted friends could prove invaluable, as you may struggle to see the full picture while you're in the thick of things. Take a moment to consider someone else's viewpoint—it could offer clarity.",
      "horoscope_ja": "牡羊座のあなたは今日、厳しい現実に直面し、情熱的な精神が冷めてしまうかもしれません。周りの人たちを信頼することを忘れないでください。彼らの洞察力の深さに驚くかもしれません。物事に追われていると、全体像を把握するのが難しくなるため、信頼できる友人に率直な意見を求めることは非常に貴重です。少し時間を取って、他の人の視点を考えてみましょう。きっと物事が明確になるかもしれません。"
    },
    "taurus": {
      "date": "2026-02-12",
      "sign": "Taurus",
      "horoscope": "Taurus, your meticulous planning is beginning to yield positive results, but tread lightly to avoid pushing others away in your pursuit of excellence. You might not be fully aware of how your blunt remarks impact those around you. It's important to cultivate a greater sensitivity to their emotions. Stay focused and courageous in your endeavors, as any hesitation could lead to a loss of control. Understand your limits, but don't hesitate to challenge them.",
      "horoscope_ja": "おうし座さん、綿密な計画が好結果をもたらし始めていますが、卓越性を追求するあまり、周りの人を遠ざけないよう慎重に行動しましょう。あなたは、自分の率直な発言が周囲の人々にどのような影響を与えているか、十分に認識していないかもしれません。相手の感情にもっと敏感になることが大切です。ためらうことはコントロールを失うことにつながるので、努力には集中力と勇気を持ち続けましょう。自分の限界を理解しつつ、挑戦することをためらわないでください。"
    },
    "gemini": {
      "date": "2026-02-12",
      "sign": "Gemini",
      "horoscope": "Gemini, immersing yourself in a touch of foreign culture might be just what you need to add some excitement to your life. You may be sensing a lack of connection with your surroundings, and the urge to break free and discover new horizons is strong. Begin with small steps, but keep your aspirations grand. It's time to shake off the monotony and venture out on your own. Today carries a grounded, serious energy that can assist you in gaining clarity about your current circumstances and your future path.",
      "horoscope_ja": "ふたご座のあなたにとって、外国の文化に少し浸ることは、人生に刺激を与えるのにまさに必要なことかもしれません。周囲との繋がりが薄れていると感じ、そこから抜け出して新たな地平を切り開きたいという強い衝動に駆られているのかもしれません。まずは小さな一歩から始めましょう。しかし、壮大な夢は持ち続けてください。単調な日常を振り払い、独り立ちする時が来ました。今日は地に足のついた、真剣なエネルギーに満ちており、現在の状況と将来の進路について明確なビジョンを持つことができるでしょう。"
    },
    "cancer": {
      "date": "2026-02-12",
      "sign": "Cancer",
      "horoscope": "Cancer, you might find it challenging to spark your motivation on certain days, but today stands out as an exception. Your awareness of your surroundings is heightened, and your ability to stay grounded is empowering you to turn your dreams into reality. There's an urgency in the air, urging you to take action without delay.",
      "horoscope_ja": "蟹座さん、モチベーションを高めるのが難しい日もあるかもしれませんが、今日は例外です。周囲への意識が高まり、地に足のついた行動力で夢を現実に変える力を得ています。空気中に緊迫感が漂い、一刻も早く行動に移すべきだと感じています。"
    },
    "leo": {
      "date": "2026-02-12",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might sense some limitations trying to impede your progress. Your mind may be buzzing with ideas and a desire to move forward, yet there's a voice of caution reminding you to take a step back. Embracing this sense of discipline could actually serve you well. Harnessing your willpower might be just what you need to navigate your path effectively.",
      "horoscope_ja": "獅子座さん、今日は何かがあなたの進歩を阻もうとしているかのように感じます。頭の中はアイデアでいっぱいで、前進したいという気持ちでいっぱいかもしれませんが、一歩引いて考えるようにという警告の声が聞こえてきます。この規律を受け入れることが、実はあなたにとって良い結果をもたらすかもしれません。意志の力を活用することが、あなたが自分の道を効果的に進むために必要なことかもしれません。"
    },
    "virgo": {
      "date": "2026-02-12",
      "sign": "Virgo",
      "horoscope": "Embrace your open and receptive mindset, Virgo, as it’s the perfect tool to help you achieve your aspirations right now. Your strong sense of responsibility, along with a clear vision and structured objectives, will be essential in guiding you toward your desired outcomes. Take the time to gather insights and devise a strategic approach that is carefully considered.",
      "horoscope_ja": "乙女座のあなた、オープンで受容的なマインドセットを大切にしましょう。それは、今まさにあなたの夢を実現するのに最適なツールです。強い責任感、明確なビジョン、そしてしっかりとした目標設定は、あなたが望む結果へと導く上で不可欠です。時間をかけて洞察を集め、慎重に検討された戦略的なアプローチを考案しましょう。"
    },
    "libra": {
      "date": "2026-02-12",
      "sign": "Libra",
      "horoscope": "Libra, today invites you to tune into the energies of those around you. Embracing a compassionate approach, paired with diligent effort and a commitment to your duties, will create a powerful synergy for success. Use this time to gather insights and strategize your objectives. Own your choices and don’t shy away from acknowledging any missteps.",
      "horoscope_ja": "天秤座の皆さん、今日は周囲の人々のエネルギーに耳を傾ける日です。思いやりのあるアプローチと、勤勉な努力、そして職務への献身を組み合わせることで、成功への強力な相乗効果が生まれます。この時間を活用して洞察を収集し、目標達成に向けた戦略を立てましょう。自分の選択に責任を持ち、どんな失敗も恐れずに認めましょう。"
    },
    "scorpio": {
      "date": "2026-02-12",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, your intellect is particularly keen and insightful. It's essential to maintain your focus and keep things organized. With the strength of discipline on your side, you have the potential to achieve a lot today. Remember, your ability to connect with others and your deep sensitivity are among your most valuable assets. Harness this energy to cultivate abundance for yourself, but ensure you do so with kindness and integrity, avoiding any harm or manipulation.",
      "horoscope_ja": "蠍座のあなた、今日は特に知性が鋭く洞察力に優れています。集中力を維持し、物事を整理整頓することが不可欠です。規律の強さを味方につければ、今日は多くのことを達成できる可能性を秘めています。他者と繋がる能力と深い感受性は、あなたの最も貴重な資産の一つであることを忘れないでください。このエネルギーを活かして、豊かさを育んでください。ただし、相手を傷つけたり、操作したりせず、優しさと誠実さを忘れないようにしてください。"
    },
    "sagittarius": {
      "date": "2026-02-12",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you might encounter a certain rigidity that could impede your advancement. Subtle tensions may be subtly eroding your mental well-being. It's crucial to avoid getting caught up in feelings of guilt or regret, as these emotions serve no purpose. If you find yourself surrounded by negativity or unreasonable behavior, don't hesitate to distance yourself and seek out a more positive environment.",
      "horoscope_ja": "射手座のあなたは今日、前進を阻むようなある種の堅苦しさに遭遇するかもしれません。微妙な緊張が、あなたの精神的な健康を少しずつ蝕んでいるかもしれません。罪悪感や後悔といった感情に囚われないことが重要です。これらの感情は何の役にも立ちません。もしあなたがネガティブなことや理不尽な行動に囲まれていると感じたら、ためらわずに距離を置き、よりポジティブな環境を探しましょう。"
    },
    "capricorn": {
      "date": "2026-02-12",
      "sign": "Capricorn",
      "horoscope": "Capricorn, the universe is aligning in your favor, and it's time to seize those opportunities! Your strong sense of responsibility and knack for organization are yielding fruitful results. Expect to tick off several items from your to-do list today. Remember to pause and reflect before making decisions, and don’t hesitate to take a break to recharge if necessary.",
      "horoscope_ja": "山羊座さん、宇宙はあなたに味方しています。今こそチャンスを掴む時です！あなたの強い責任感と組織力は、実りある結果をもたらします。今日はToDoリストのいくつかの項目をこなせるでしょう。決断を下す前に、立ち止まってじっくり考えることを忘れないでください。必要であれば、ためらわずに休憩を取り、エネルギーを充電しましょう。"
    },
    "aquarius": {
      "date": "2026-02-12",
      "sign": "Aquarius",
      "horoscope": "Aquarius, you'll find that missed opportunities and miscommunications will diminish if you take a moment to pause and concentrate. Keep in mind that you have the capability to handle things on your own. There's no need to seek validation from others before diving into the projects that excite you. Your intuition is pushing you to take charge today, so embrace that energy. However, be cautious not to rush into decisions. You'll achieve greater results if you take the time to think things through before taking action.",
      "horoscope_ja": "水瓶座のあなた、少し立ち止まって集中すれば、見逃したチャンスや誤解が減ることに気づくでしょう。あなたには自分で物事を処理できる能力があることを忘れないでください。ワクワクするプロジェクトに飛び込む前に、他人の承認を求める必要はありません。今日、あなたの直感はあなたに主導権を握るよう促しています。そのエネルギーを受け入れましょう。ただし、決断を急がないように注意してください。行動を起こす前に時間をかけてじっくり考えることで、より良い結果が得られるでしょう。"
    },
    "pisces": {
      "date": "2026-02-12",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you might find that the need for self-discipline and boundaries is creating some friction in your surroundings. However, there's a silver lining: your thoughts are sharp, and you’re likely to feel a strong connection with those around you. Recognize who your supporters are and nurture those relationships. Take a moment to express your appreciation for their presence in your life. Remember, the true treasures in your life are your loved ones, so shower them with unwavering affection.",
      "horoscope_ja": "魚座のあなたは今日、自制心と境界線を求めるあまり、周囲に軋みが生じているかもしれません。しかし、明るい兆しもあります。思考は鋭敏になり、周囲の人々と強い繋がりを感じられるでしょう。あなたを支えてくれる人が誰なのかを認識し、その関係を育みましょう。少し時間を取って、人生における彼らの存在に感謝の気持ちを伝えましょう。人生における真の宝物は愛する人々です。ですから、揺るぎない愛情を彼らに注いでください。"
    }
  }
}