{
  "updated_at": "2025-11-10T16:32:33.863Z",
  "jst_date": "2025-11-11",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-11",
      "sign": "Aries",
      "horoscope": "Today, you might find that others are counting on you in various aspects, so it's essential to ensure you meet their expectations. It may feel as though you're under scrutiny, as if your actions are being assessed. However, don't let this idea overwhelm you. Remember, the key is to put forth your best effort rather than striving for flawless results.",
      "horoscope_ja": "今日、あなたは様々な面で周りの人から期待されていることに気づくかもしれません。ですから、彼らの期待に応えることが不可欠です。まるで監視されているかのようで、自分の行動が評価されているように感じるかもしれません。しかし、この考えに圧倒されないでください。重要なのは、完璧な結果を求めるのではなく、全力を尽くすことです。"
    },
    "taurus": {
      "date": "2025-11-11",
      "sign": "Taurus",
      "horoscope": "Avoid getting entangled in the turmoil of others' emotional conflicts today. Your joyful and free-spirited essence deserves to remain unblemished by harsh words and intense feelings. If tensions rise, create a mental barrier to shield yourself. Those embroiled in their own drama might be oblivious to the impact their behavior has on those around them.",
      "horoscope_ja": "今日は他人の感情的な葛藤に巻き込まれないようにしましょう。あなたの明るく自由な精神は、厳しい言葉や激しい感情に汚されることなく、大切にされなければなりません。緊張が高まったら、自分を守るために精神的なバリアを作りましょう。自分のドラマに巻き込まれている人は、自分の行動が周囲の人々にどのような影響を与えているかに気づいていないかもしれません。"
    },
    "gemini": {
      "date": "2025-11-11",
      "sign": "Gemini",
      "horoscope": "Today, you are likely to experience a sense of emotional balance, yet you might find yourself second-guessing your analytical skills. A person in your life is pushing you to expand your perspective, urging you to venture into uncertain territory. While you find comfort in the solid ground of your current beliefs, it's perfectly okay to remain there if you're not ready to embrace the risk just yet.",
      "horoscope_ja": "今日は感情のバランスが取れているように感じる一方で、自分の分析能力に疑問を抱くこともあるかもしれません。あなたの周りにいる誰かが、視野を広げ、不確かな領域に踏み込むよう促しています。あなたは現在の確固たる信念に安らぎを感じているかもしれませんが、まだリスクを受け入れる準備ができていないのであれば、そこに留まるのも全く問題ありません。"
    },
    "cancer": {
      "date": "2025-11-11",
      "sign": "Cancer",
      "horoscope": "Treat yourself to that movie you've been eager to watch for a while. You'll find joy in immersing yourself in a world that's different from your own. Right now, your imagination and love for fantasy are at their peak. Just be cautious not to let burdensome emotional matters that aren't yours drag you down.",
      "horoscope_ja": "ずっと観たいと思っていた映画を、ぜひ自分にご褒美として観てください。自分とは違う世界に浸ることで、きっと喜びを感じられるでしょう。今、あなたの想像力とファンタジーへの愛は最高潮に達しています。ただ、自分に関係のない重荷となる感情的な問題に引きずられないように気をつけてください。"
    },
    "leo": {
      "date": "2025-11-11",
      "sign": "Leo",
      "horoscope": "You find yourself at a crossroads, caught between two distinct paths. Loved ones are aligning themselves with opposing views, leaving you in a state of indecision. Your ability to empathize with both perspectives complicates your choice, as you may feel inclined to act as a mediator. Remember, the situation isn't as clear-cut as others might perceive; there are shades of gray that deserve recognition.",
      "horoscope_ja": "あなたは岐路に立たされ、二つの異なる道の間で板挟みになっています。愛する人たちが正反対の意見に同調し、あなたは決断に迷っています。どちらの立場にも共感できるあなたの能力は、仲介役を務めたくなる気持ちを抱かせ、選択を複雑にしています。しかし、状況は他の人が考えるほど単純ではありません。認識すべきグレーゾーンが存在することを忘れないでください。"
    },
    "virgo": {
      "date": "2025-11-11",
      "sign": "Virgo",
      "horoscope": "Exercise caution when it comes to allowing your imagination to take control of your emotions. The elaborate scenarios you create in your mind could lead to disappointment if they don't materialize as you hoped. Today carries a pragmatic vibe, urging you to approach your feelings with seriousness and practicality.",
      "horoscope_ja": "想像力に感情を支配されてしまうことには注意が必要です。頭の中で作り上げた精巧なシナリオが、期待通りに実現しなかった場合に失望につながる可能性があります。今日は現実的な雰囲気が漂っており、自分の感情に真剣かつ現実的に取り組むよう促されます。"
    },
    "libra": {
      "date": "2025-11-11",
      "sign": "Libra",
      "horoscope": "Today, your intentions are pure, yet you may struggle to bring your aspirations to life. Creative endeavors, particularly in art and music, might feel especially challenging at the moment. They demand a level of intellectual engagement that you might not be ready to embrace. You may find yourself more inclined towards the spiritual aspects of life, rather than fully engaging with the logical side.",
      "horoscope_ja": "今日、あなたの意図は純粋ですが、夢を実現するのに苦労するかもしれません。特に芸術や音楽といった創造的な活動は、今は特に困難に感じるかもしれません。それらは、あなたが受け入れる準備ができていないレベルの知的関与を要求するかもしれません。論理的な側面に完全に没頭するよりも、人生の精神的な側面に傾倒していることに気づくかもしれません。"
    },
    "scorpio": {
      "date": "2025-11-11",
      "sign": "Scorpio",
      "horoscope": "Should you encounter obstacles or feelings of irritation today, consider it a prompt to explore a different path. Aim for a day where everything unfolds effortlessly. Be mindful that today, the clash between reality and your dreams may be particularly intense, especially if you haven't clearly distinguished between the two. Embrace your imaginative side, but remember to engage with the real world as well.",
      "horoscope_ja": "今日、何か障害やイライラに遭遇したら、別の道を模索するきっかけだと捉えましょう。すべてがスムーズに進むような一日を目指しましょう。特に、これまで明確に区別できていなかった場合は、現実と夢の衝突が特に激しくなる可能性があることに注意してください。想像力豊かな面を大切にしつつ、現実世界との関わりも忘れずに。"
    },
    "sagittarius": {
      "date": "2025-11-11",
      "sign": "Sagittarius",
      "horoscope": "Embrace your sensual side today, as it often remains hidden. Consider taking a long stroll with a loved one, or create a cozy atmosphere at home with candles in your bedroom or a soothing hot bath. Your senses are heightened right now, making flavors and fragrances particularly delightful. Treat yourself to a romantic dinner for two, but remember to balance your thoughts with the pleasures of the senses—don't let the intellectual take over the joy of experiencing life.",
      "horoscope_ja": "今日は、隠れがちな官能的な一面を、ぜひ受け入れてください。愛する人と長い散歩に出かけたり、寝室にキャンドルを灯したり、温かいお風呂に浸かって心地よい雰囲気を作ったりしてみてはいかがでしょうか。五感が研ぎ澄まされている今、味覚や香りが特に心地よく感じられます。二人きりでロマンチックなディナーを楽しんでください。ただし、思考と五感の喜びのバランスを忘れないようにしましょう。知的な思考に人生を体験する喜びを奪われないようにしましょう。"
    },
    "capricorn": {
      "date": "2025-11-11",
      "sign": "Capricorn",
      "horoscope": "Today, you might find yourself caught in a tug-of-war between relaxation and action. One moment, you may feel inclined to take a step back and let events unfold naturally, while the next, you sense a nudge urging you to take initiative. Embracing this duality is key, as both approaches hold their own value. Acknowledge and respect each side of this dynamic.",
      "horoscope_ja": "今日は、リラックスと行動の間で綱引きをしているかもしれません。ある時は一歩下がって自然に物事が進むのを待ちたい気持ちになる一方で、次の瞬間には、自分から積極的に行動を起こすよう促される衝動を感じるかもしれません。どちらのアプローチにもそれぞれ独自の価値があるため、この二面性を受け入れることが重要です。この力学におけるそれぞれの側面を認め、尊重しましょう。"
    },
    "aquarius": {
      "date": "2025-11-11",
      "sign": "Aquarius",
      "horoscope": "Today, you might find yourself navigating through intense feelings—embrace them as your strength rather than a weakness. Your heart may feel a bit battered, so take the time to nurture it with kindness. Be cautious about allowing others to draw too near, especially if they lack the sensitivity to handle your delicate emotions. Prioritize your own well-being and shield yourself.",
      "horoscope_ja": "今日は激しい感情に振り回されているかもしれません。それを弱さではなく、強さとして受け止めてください。心が少し傷ついているかもしれません。ですから、時間をかけて優しく寄り添いましょう。特に、あなたの繊細な感情をうまく扱えないような人に、あまり近づかないように気を付けてください。自分の健康を最優先に考え、自分を守りましょう。"
    },
    "pisces": {
      "date": "2025-11-11",
      "sign": "Pisces",
      "horoscope": "Today’s restlessness is a gentle nudge from the universe, urging you to dive into creative pursuits or musical activities that bring you joy. Seek inspiration from those who boldly chase their passions. Remember, it’s not about others’ opinions of your creations; focus on doing what fulfills you.",
      "horoscope_ja": "今日の落ち着きのなさは、宇宙からの優しい促しです。喜びをもたらしてくれる創造的な活動や音楽活動に没頭するよう促しています。情熱を大胆に追いかける人々からインスピレーションを得ましょう。他人の意見ではなく、自分が心から満たされることをすることに集中しましょう。"
    }
  }
}