{
  "updated_at": "2025-12-04T16:35:41.085Z",
  "jst_date": "2025-12-05",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-05",
      "sign": "Aries",
      "horoscope": "A relationship that has been progressing smoothly might now feel like it's hit a roadblock. Whether in business or love, pushing your partner for advancement right now could backfire, leading to even more resistance. Instead of forcing the issue, practice patience and allow the situation to unfold naturally.",
      "horoscope_ja": "これまで順調に進んでいた関係が、今になって行き詰まりを感じてしまうかもしれません。ビジネスでも恋愛でも、今パートナーに進展を求めるのは逆効果になり、さらに抵抗を募らせる可能性があります。無理強いするのではなく、忍耐強く、状況が自然に進展していくのを待ちましょう。"
    },
    "taurus": {
      "date": "2025-12-05",
      "sign": "Taurus",
      "horoscope": "Today marks a high point in your health and vitality. You’re brimming with strength and energy, both physically and mentally. With this powerful momentum, you have the potential to achieve remarkable things, so embrace the day and let your talents shine. This could open doors to exciting opportunities in your creative pursuits, career, and finances.",
      "horoscope_ja": "今日はあなたの健康と活力にとって絶好のタイミングです。心身ともに力とエネルギーに満ち溢れています。この力強い勢いに乗れば、素晴らしい成果を成し遂げる可能性を秘めています。この日を心から楽しみ、才能を輝かせましょう。創造的な活動、キャリア、そして経済面において、刺激的なチャンスが訪れるかもしれません。"
    },
    "gemini": {
      "date": "2025-12-05",
      "sign": "Gemini",
      "horoscope": "Today, the fruits of your creative efforts are set to reveal themselves, and you might find the outcome quite delightful! Your inventive spirit is bound to yield significant rewards, and your achievements will certainly catch the eye of others. Expect to receive encouraging feedback and acknowledgment, along with promising opportunities for the growth of your concepts. As the evening rolls in, treat yourself to some fun and relaxation!",
      "horoscope_ja": "今日は、あなたの創造的な努力の成果が実を結び、きっと素晴らしい結果となるでしょう！あなたの発明家精神は大きな成果をもたらし、その成果はきっと周りの人々の注目を集めるでしょう。励みになるフィードバックや感謝の言葉、そしてあなたのアイデアを成長させるための有望な機会が訪れるでしょう。夜が更けていくにつれ、楽しいひとときとリラックスした時間をお過ごしください！"
    },
    "cancer": {
      "date": "2025-12-05",
      "sign": "Cancer",
      "horoscope": "Today, you might find a chance to launch a home-based business, possibly centered around a metaphysical theme. It could gain momentum quickly, so stay open to the possibilities. Friends or former colleagues may express interest in joining you on this venture, and it's definitely worth your serious thought. The support of others is likely to bring you significant advantages at this time. Get ready for an exciting future and start embracing it today!",
      "horoscope_ja": "今日、在宅ビジネスを始めるチャンスが訪れるかもしれません。おそらく、形而上学的なテーマを中心としたものでしょう。急速に勢いを増す可能性があるので、可能性にオープンでいましょう。友人や元同僚がこの事業に加わることに興味を示してくれるかもしれません。真剣に検討する価値は間違いなくあります。周りのサポートは、この時期に大きなメリットをもたらすでしょう。刺激的な未来に向けて準備を整え、今日から行動を起こしましょう！"
    },
    "leo": {
      "date": "2025-12-05",
      "sign": "Leo",
      "horoscope": "You may notice a neighbor struggling and could be the one to lend a helping hand. Additionally, a new business venture in your area might pave the way for exciting opportunities, whether it's a fresh job prospect or a more streamlined approach in your current role. Be prepared for a day filled with driving, as you might find yourself on the move more than usual.",
      "horoscope_ja": "近所の人が困っているのに気づき、手を差し伸べてくれるかもしれません。また、地域で新しいビジネスが立ち上がれば、刺激的なチャンスが開けるかもしれません。それは、新しい仕事の見通しだったり、現在の仕事の効率化だったりするかもしれません。普段より移動が多い日になるかもしれませんので、運転が多い一日になる準備をしておきましょう。"
    },
    "virgo": {
      "date": "2025-12-05",
      "sign": "Virgo",
      "horoscope": "With your career and financial prospects on the rise, you might find yourself flooded with new ideas and opportunities to broaden your horizons. However, choosing the most feasible options could prove challenging. Consider jotting down your thoughts to evaluate which paths resonate with you the most. Prepare for a whirlwind of activity and significant shifts, especially in the realm of business ventures.",
      "horoscope_ja": "キャリアと経済的な見通しが好転し、視野を広げるための新しいアイデアや機会が溢れかえっているかもしれません。しかし、最も実現可能な選択肢を選ぶのは難しいかもしれません。自分の考えを書き留めて、どの道が最も心に響くかを検討してみましょう。特にビジネスベンチャーの分野では、目まぐるしい活動と大きな変化に備えましょう。"
    },
    "libra": {
      "date": "2025-12-05",
      "sign": "Libra",
      "horoscope": "You're radiating energy and excitement like never before! Your personal life, career, and financial situations are thriving, and it looks like this positive trend is here to stay. On the romantic front, things are also blossoming beautifully. This surge in positivity is likely boosting your self-esteem. Whatever strategies you've been employing, continue with them! There's so much to anticipate in the days ahead.",
      "horoscope_ja": "これまでにないほどのエネルギーと興奮に満ち溢れています！私生活、仕事、そして経済状況は順調で、この好調な傾向は今後も続くようです。恋愛面でも、物事が美しく花開いています。このポジティブな気持ちの高まりは、あなたの自尊心を高めているでしょう。これまでどんな戦略をとってきたとしても、それを継続してください！これからの日々には、期待すべきことがたくさんあります。"
    },
    "scorpio": {
      "date": "2025-12-05",
      "sign": "Scorpio",
      "horoscope": "You might find yourself feeling uneasy about your professional relationship with a business partner, leading to some uncertainty about your career path. However, try not to dwell on these concerns for too long. Unbeknownst to you, your career and financial prospects are actually on a positive trajectory and are expected to remain favorable for the foreseeable future. Ultimately, the continuation of this success hinges on your actions and commitment to nurturing it.",
      "horoscope_ja": "ビジネスパートナーとのプロフェッショナルな関係に不安を感じ、キャリアパスに不安を感じているかもしれません。しかし、こうした不安にあまり長く悩まないでください。ご存じないかもしれませんが、あなたのキャリアと経済的な見通しは実は好調で、当面の間は良好な状態が続くと予想されています。結局のところ、この成功を継続できるかどうかは、あなた自身の行動と、それを育むためのコミットメントにかかっています。"
    },
    "sagittarius": {
      "date": "2025-12-05",
      "sign": "Sagittarius",
      "horoscope": "The aspiration you've been nurturing for quite some time may finally start to manifest. With a surge of energy and enthusiasm coursing through you, this is the perfect moment to make that final effort to turn your dream into a reality. Tonight, you might find yourself celebrating with friends or fellow group members, reveling in the joy of your progress.",
      "horoscope_ja": "長い間温めてきた憧れが、ついに実現し始めるかもしれません。エネルギーと情熱が湧き上がり、夢を現実にするための最後の努力を惜しまない絶好の機会です。今夜は、友人やグループのメンバーと喜びを分かち合い、前進の喜びに浸っているかもしれません。"
    },
    "capricorn": {
      "date": "2025-12-05",
      "sign": "Capricorn",
      "horoscope": "Kudos to you! Exciting advancements in your career are on the horizon! If you've been dreaming of building your ideal job, today is the day to take action. If launching your own business has been on your mind, seize the moment and dive in. The upcoming year promises to be fruitful and rewarding, though it may come with a few unexpected twists.",
      "horoscope_ja": "素晴らしいですね！キャリアにおけるエキサイティングな前進が目前に迫っています！理想の仕事に就くことを夢見てきたなら、今日こそ行動を起こす日です。起業を考えているなら、この機会を逃さず飛び込んでみてください。これからの一年は実り豊かでやりがいのある一年になるでしょうが、予期せぬ展開もあるかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-05",
      "sign": "Aquarius",
      "horoscope": "An exciting business prospect may be on the horizon, possibly in another state or even overseas. This opportunity might involve significant travel or the chance to relocate. While you might feel a bit uncertain about it, it's hard to imagine you passing it up. This could be a major turning point for you! As for your health in the coming year, expect it to be vibrant and strong, giving you the vitality to tackle any endeavor you choose.",
      "horoscope_ja": "刺激的なビジネスのチャンスが、もしかしたら別の州、あるいは海外で訪れるかもしれません。このチャンスには、長期の出張や転居が必要になるかもしれません。少し不安に感じるかもしれませんが、このチャンスを逃すなんて考えられません。これはあなたにとって大きな転機となるかもしれません！健康面では、来年は活力に満ち、どんなことにも果敢に取り組む活力を与えてくれるでしょう。"
    },
    "pisces": {
      "date": "2025-12-05",
      "sign": "Pisces",
      "horoscope": "An opportunity to boost your earnings may present itself soon. This might require taking on additional work or making strategic investments. Real estate ventures, particularly those related to land, could yield significant returns at this time. Additionally, be on the lookout for contracts or legal documents that could enhance your financial situation. By the end of the year, you are likely to find yourself in a more stable financial position than you were at the start.",
      "horoscope_ja": "収入を増やすチャンスが間もなく訪れるかもしれません。そのためには、追加の仕事を引き受けたり、戦略的な投資を行う必要があるかもしれません。不動産事業、特に土地関連の事業は、この時期に大きな利益を生み出す可能性があります。また、財務状況を改善できる契約書や法的文書にも注意が必要です。年末までに、年初よりも安定した財務状況になっているはずです。"
    }
  }
}