{
  "updated_at": "2025-12-22T16:32:21.927Z",
  "jst_date": "2025-12-23",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-23",
      "sign": "Aries",
      "horoscope": "Today marks a moment when you finally receive the acknowledgment you've been hoping for. The challenges of the past month are behind you, ushering in a more peaceful phase. Those who were quick to criticize you before are now overflowing with praise. Embrace the compliments you receive; there's absolutely nothing wrong with celebrating your own achievements.",
      "horoscope_ja": "今日は、あなたが待ち望んでいた承認をついに得られる瞬間です。先月の困難は過ぎ去り、より穏やかな時期が訪れています。以前はあなたを批判していた人たちも、今では称賛の言葉で溢れかえっています。受け取った褒め言葉を大切にしましょう。自分の成果を祝うことは、決して悪いことではありません。"
    },
    "taurus": {
      "date": "2025-12-23",
      "sign": "Taurus",
      "horoscope": "Today invites you to pause and reflect. Although you might feel drawn to reminisce about your journey so far, it would be more beneficial to focus on the possibilities that lie ahead. You're in a phase of reassessing your sense of self and your goals, which are significant undertakings. Prepare to harness all your energy as you navigate this transformative period.",
      "horoscope_ja": "今日は、立ち止まってじっくり考える時間です。これまでの道のりを振り返りたくなるかもしれませんが、それよりも、これからの可能性に目を向けた方が賢明でしょう。あなたは今、自己認識と目標を再評価する段階にあり、それは重要な取り組みです。この変革期を乗り越えるために、全力を尽くす準備をしてください。"
    },
    "gemini": {
      "date": "2025-12-23",
      "sign": "Gemini",
      "horoscope": "Today is a perfect opportunity to focus on your physical well-being. It's time to face the reality that those nagging back issues and knee discomfort won't simply vanish on their own. Consider scheduling a visit with a healthcare professional or physical therapist. Taking a break from your daily obligations for just one day is not only acceptable, but essential for your health.",
      "horoscope_ja": "今日は、身体の健康に意識を向ける絶好の機会です。しつこい腰痛や膝の痛みは、自然に消えるものではないという現実を受け止めましょう。医療専門家や理学療法士の診察を受けることを検討してください。日々の義務からたった1日でも離れることは、健康にとって良いだけでなく、不可欠です。"
    },
    "cancer": {
      "date": "2025-12-23",
      "sign": "Cancer",
      "horoscope": "Recently, you might have made some adjustments to your material world. But is that all there is to it? It could be time for deeper transformations. Reflect on what inspired you to shape your current life. Focus particularly on the decisions you've made regarding your career. Are you truly following your destined path? Are you fully harnessing your unique abilities?",
      "horoscope_ja": "最近、物質的な世界にいくつかの変化をもたらしたかもしれません。しかし、それだけでしょうか？より深い変革が必要な時期かもしれません。現在の人生を形作るきっかけとなったものを振り返ってみてください。特に、キャリアに関する決断に焦点を当ててみましょう。あなたは本当に運命づけられた道を歩んでいますか？独自の能力を最大限に活用していますか？"
    },
    "leo": {
      "date": "2025-12-23",
      "sign": "Leo",
      "horoscope": "Today is an excellent opportunity for some meditation. You might be feeling a bit restless as your different endeavors haven't materialized yet. It's understandable to feel impatient, especially since this waiting phase has stretched on for nearly two months, but relief is on the horizon. The cosmic energies encourage you to focus solely on what truly matters to you. Avoid launching new projects that are not rooted in necessity.",
      "horoscope_ja": "今日は瞑想に最適な機会です。様々な取り組みがまだ成果に繋がらず、少し落ち着かない気分になっているかもしれません。特にこの待機期間が2ヶ月近くも続いているので、焦りを感じるのも無理はありません。しかし、安堵の時が近づいています。宇宙のエネルギーは、あなたにとって本当に大切なことだけに集中するよう促しています。必要性に基づかない新しいプロジェクトを立ち上げるのは避けましょう。"
    },
    "virgo": {
      "date": "2025-12-23",
      "sign": "Virgo",
      "horoscope": "Today holds great potential, but it's wise to exercise moderation. You may feel inclined to believe that your small financial challenges are a thing of the past, but that's not quite the case. The actions you take today will shape your tomorrow. By consistently working on stabilizing your habits, you'll pave the way for the security you seek in the future.",
      "horoscope_ja": "今日は大きな可能性を秘めていますが、節度を保つことが賢明です。ちょっとした経済的な問題はもう過去のものと思いたくなるかもしれませんが、そうではありません。今日の行動が明日を形作ります。習慣を安定させることに継続的に取り組むことで、将来の安心への道を切り開くことができます。"
    },
    "libra": {
      "date": "2025-12-23",
      "sign": "Libra",
      "horoscope": "You're nearing the finish line! It's time to bid farewell to your concerns. Your hard work is finally being recognized, and others are eager to take your suggestions to heart. While there are still a few kinks to iron out in your romantic life, you can afford to take a breather for now. After months of personal growth and change, you’ve earned yourself a well-deserved pause.",
      "horoscope_ja": "もうすぐゴールです！ 不安な気持ちに別れを告げる時です。あなたの努力がようやく認められ、周りの人たちもあなたの提案を真剣に受け止めてくれるでしょう。恋愛面ではまだ解決すべき問題がいくつか残っていますが、今は少し息抜きをしましょう。数ヶ月にわたる個人的な成長と変化を経て、あなたは当然の休息を得るに至ったのです。"
    },
    "scorpio": {
      "date": "2025-12-23",
      "sign": "Scorpio",
      "horoscope": "Your world is often filled with social interactions, and your vibrant personality shines as you connect with others. However, recently, you may have found yourself craving some time to yourself. Today, pay attention to any desire for solitude that arises. While this may feel out of character for you, it's a legitimate need, and it's important to embrace it.",
      "horoscope_ja": "あなたの世界は社交的な交流で溢れ、人との繋がりの中であなたの生き生きとした個性が輝きを増しています。しかし最近、少し自分だけの時間が欲しいと感じているかもしれません。今日は、孤独への欲求が湧き上がってきた時に、注意深く観察してみてください。あなたにとっては異質に感じるかもしれませんが、それは正当な欲求であり、受け入れることが大切です。"
    },
    "sagittarius": {
      "date": "2025-12-23",
      "sign": "Sagittarius",
      "horoscope": "Occasionally, friends can feel like the family you choose. The bonds you share with them run deeper and last longer than you might think. There are plenty of people around you who are ready to lend a hand, so why hesitate to accept their support? After all, you've been an advocate for the value of genuine, heartfelt connections. Today, you'll gain insight into your own abilities and recognize just how vital these friendships are in your life.",
      "horoscope_ja": "時には、友人がまるで自分が選んだ家族のように感じることがあります。彼らとの絆は、あなたが思っている以上に深く、長く続くものです。周りには、いつでも手を差し伸べてくれる人がたくさんいます。彼らのサポートをためらう必要はありません。あなたは、心からの真のつながりの価値を訴え続けてきたのですから。今日、あなたは自分の能力を深く理解し、人生においてこうした友情がいかに大切であるかを認識するでしょう。"
    },
    "capricorn": {
      "date": "2025-12-23",
      "sign": "Capricorn",
      "horoscope": "You've successfully navigated through the challenges that have been weighing you down. Now, you're stepping into a calmer and more serene chapter of your life. The completion of your work projects is just around the corner, and your home life will radiate joy and tranquility. Embrace this time of peace and leisure, as it will soon give way to a phase of deep yearning that will demand your full focus.",
      "horoscope_ja": "これまであなたを苦しめてきた困難を無事に乗り越え、人生のより穏やかで穏やかな章へと足を踏み入れようとしています。仕事のプロジェクトも間近に迫り、家庭生活は喜びと静けさに満ち溢れるでしょう。この平穏でゆったりとした時間を大切に過ごしましょう。間もなく、深い憧れの時期が訪れ、あなたは完全に集中力を必要とするでしょう。"
    },
    "aquarius": {
      "date": "2025-12-23",
      "sign": "Aquarius",
      "horoscope": "Today shines with promise! The heavy vibes of recent days are nudging you to shake things up and explore new environments. Consider organizing a short getaway—it's the perfect moment for a little adventure. If you put it off, you might find yourself back in the same monotonous routine.",
      "horoscope_ja": "今日は希望に満ち溢れています！ここ数日の重苦しい雰囲気が、あなたを変化に駆り立て、新しい環境を探求するきっかけを与えています。ちょっとした小旅行を計画してみてはいかがでしょうか。ちょっとした冒険には絶好の機会です。先延ばしにすると、また同じ単調なルーティンに戻ってしまうかもしれません。"
    },
    "pisces": {
      "date": "2025-12-23",
      "sign": "Pisces",
      "horoscope": "Today invites you to engage in deep reflection. You'll find yourself keenly aware of your surroundings, yet able to maintain a healthy distance. The aspirations of those around you may strike you as entertaining, as they seem to embody exaggerated versions of themselves rather than genuine individuals. This ability to step back and observe is incredibly advantageous for you, and it's a practice you should embrace more frequently.",
      "horoscope_ja": "今日は、深く内省する日です。周囲の状況を鋭く意識しながらも、健全な距離を保つことができるでしょう。周囲の人々の願望は、ありのままの自分ではなく、誇張された自己像を体現しているように思え、面白く感じられるかもしれません。一歩引いて観察するこの能力は、あなたにとって非常に有益であり、もっと頻繁に実践すべきです。"
    }
  }
}