{
  "updated_at": "2026-01-06T16:35:30.941Z",
  "jst_date": "2026-01-07",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-07",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find yourself feeling anxious about a family member who seems to be facing some challenges. The silence from them could heighten your concern, especially if your calls go unanswered or lead to a string of voicemails. It's important to keep your perspective clear and not let worry take over. Chances are, your loved one is on the mend from whatever has been troubling them. Keep in mind that sometimes, no news is actually good news. Stay strong!",
      "horoscope_ja": "牡羊座のあなたは今日、家族が何か問題を抱えているのではないかと不安に感じているかもしれません。特に電話に出なかったり、留守番電話が何度も鳴ったりすると、彼らからの沈黙があなたの不安を増幅させるかもしれません。冷静な視点を保ち、心配に押しつぶされないことが大切です。あなたの愛する人は、これまで抱えていた問題から回復に向かっている可能性が高いでしょう。時には、何の知らせもないことが実は良い知らせであることもあることを覚えておいてください。強くいてください！"
    },
    "taurus": {
      "date": "2026-01-07",
      "sign": "Taurus",
      "horoscope": "Today isn't the best time for you to dive into any financial ventures, Taurus. While someone might bring some enticing opportunities your way, it's wise to tread carefully. If what they offer piques your interest, take the time to investigate and gather the necessary details, but hold off on making any decisions just yet. A genuine opportunity will still be there in a few days, and if it’s not worth your time, you’ll be glad you waited. Patience is key!",
      "horoscope_ja": "おうし座さん、今日は金融関連の事業に飛び込むのに最適な時期ではありません。誰かが魅力的なチャンスをもたらしてくれるかもしれませんが、慎重に行動するのが賢明です。もし興味をそそられるものがあれば、時間をかけて調査し、必要な情報を集めてください。しかし、まだ決断は控えてください。真のチャンスは数日後にはまだあるはずです。もしそれが時間の無駄だったとしても、待ってよかったと思うでしょう。忍耐が鍵です！"
    },
    "gemini": {
      "date": "2026-01-07",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you’re likely to radiate charm and beauty, but it might feel a bit pointless without your special someone by your side to admire it. Don’t let that get you down! This situation is temporary, and you’ll still be looking fabulous when they return. Keep yourself occupied with activities that bring you joy; your vibrant energy will only add to your allure. Remember, your friend won’t be gone for long—it just feels that way for now.",
      "horoscope_ja": "ふたご座のあなたは、今日、魅力と美しさを放ちそうですが、それを賞賛してくれる大切な人がそばにいないと、少し虚しく感じるかもしれません。でも、落ち込まないでください！この状況は一時的なもので、相手が戻ってきた時にもあなたは素敵なままです。喜びを感じられる活動に没頭しましょう。あなたの活力あるエネルギーは、あなたの魅力をさらに高めるだけです。覚えておいてください、あなたの友人は長く離れているわけではありません。今はただ、そう感じているだけです。"
    },
    "cancer": {
      "date": "2026-01-07",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you might feel like your creativity and inspiration are on a break, making it challenging to maintain your usual work standards. It could be wise to focus on familiar tasks that require less mental effort for now, and save the more imaginative projects for when your mind is back in its groove. Remember, there's no shame in seeking assistance if you need it. Stay strong!",
      "horoscope_ja": "蟹座のあなたは、今日、創造性とインスピレーションが停滞しているように感じ、いつもの仕事の水準を維持するのが難しくなっているかもしれません。今は、精神的な負担が少ない慣れ親しんだ仕事に集中し、より想像力豊かなプロジェクトは、心が落ち着いた時に取り掛かるのが賢明かもしれません。必要な場合は、助けを求めることを恥ずかしがる必要はありません。頑張ってください！"
    },
    "leo": {
      "date": "2026-01-07",
      "sign": "Leo",
      "horoscope": "Today, Leo, it's wise to focus on your finances. You may find that unexpected costs have taken a toll on your savings, prompting you to tighten your belt a bit. Fortunately, your earnings are likely stable or even on the rise, so this is just a passing phase. With a little patience, your financial situation will stabilize again. In the meantime, exercise some restraint with your spending and get inventive with your budgeting. Remember to take a moment to unwind amidst the numbers.",
      "horoscope_ja": "獅子座さん、今日は家計に気を配るのが賢明です。予期せぬ出費で貯蓄が減り、少し節約したくなるかもしれません。しかし幸いなことに、収入は安定しているか、あるいは増加傾向にある可能性が高いので、これは一時的なものです。少し辛抱すれば、家計は再び安定するでしょう。それまでは、支出を控え、予算管理に工夫を凝らしましょう。数字ばかりにとらわれず、少し時間を取ってリラックスするのを忘れずに。"
    },
    "virgo": {
      "date": "2026-01-07",
      "sign": "Virgo",
      "horoscope": "Virgo, you might be feeling a bit blue due to the absence of communication with your significant other. It's natural to question whether you've unintentionally upset them. However, rest assured that your partner is likely unaware of your feelings and is simply caught up with family responsibilities, possibly losing track of time. Stay patient! You can expect to hear from your sweetheart shortly.",
      "horoscope_ja": "おとめ座のあなたは、パートナーとのコミュニケーション不足で少し落ち込んでいるかもしれません。うっかり相手を怒らせてしまったのではないかと心配になるのも無理はありません。しかし、パートナーはあなたの気持ちに気づいていないだけで、家族の責任に追われて時間を忘れているだけかもしれません。焦らずに頑張ってください！もうすぐ恋人から連絡が来るはずです。"
    },
    "libra": {
      "date": "2026-01-07",
      "sign": "Libra",
      "horoscope": "Yesterday's indulgences in food and drink may lead you to rethink your social plans today, Libra. You might not be in the best shape to socialize, which could feel a bit frustrating and even a tad embarrassing. Yet, this downtime could be just what you need, regardless of your overindulgence. Embrace this evening of solitude—treat yourself to a relaxing bath and hit the hay early. You'll wake up feeling refreshed and grateful for the self-care.",
      "horoscope_ja": "昨日の食べ過ぎと飲み過ぎのせいで、今日の社交の予定を見直さなければならないかもしれません、天秤座さん。体調が優れず、少しイライラしたり、少し恥ずかしい思いをするかもしれません。でも、食べ過ぎたかどうかはさておき、この休息こそがまさに必要な時間かもしれません。この静かな夜を満喫しましょう。リラックスできるお風呂に浸かり、早めに寝ましょう。目覚めた時には爽快な気分になり、セルフケアに感謝できるはずです。"
    },
    "scorpio": {
      "date": "2026-01-07",
      "sign": "Scorpio",
      "horoscope": "As a Scorpio, you might find yourself caught in a tricky situation today, right between two friends who are experiencing some marital strife. Both may seek your support, but it's wise to steer clear of taking sides. Instead, focus on playing the role of a mediator, encouraging each of them to understand the other's perspective. Regardless of the outcome, your efforts to foster understanding will be commendable.",
      "horoscope_ja": "蠍座のあなたは、今日、夫婦間でいざこざを抱えている二人の友人の間で、難しい状況に巻き込まれるかもしれません。どちらもあなたのサポートを求めているかもしれませんが、どちらか一方に肩入れするのは避けた方が良いでしょう。むしろ、仲裁役として、お互いの立場を理解できるように促しましょう。結果がどうであれ、理解を深めようとするあなたの努力は称賛に値するでしょう。"
    },
    "sagittarius": {
      "date": "2026-01-07",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may feel a sense of melancholy due to the absence of a loved one, whether it's a family member or a romantic partner. This could lead to a noticeable dip in your typically vibrant spirit. You might find yourself spending the evening in front of the television, but consider a more fulfilling alternative. Why not treat yourself to a visit to the bookstore? Picking up some new books could not only lift your mood but also enrich your mind while your partner is away!",
      "horoscope_ja": "射手座のあなたは今日、家族であれ恋人であれ、愛する人の不在によって憂鬱な気分になっているかもしれません。普段は活発なあなたの精神が、明らかに落ち込んでしまうかもしれません。テレビの前で夜を過ごすこともあるかもしれませんが、もっと充実した時間を過ごしてみませんか？本屋へ足を運んでみてはいかがでしょうか？新しい本を手に取れば、気分が明るくなるだけでなく、パートナーがいない間に心を豊かにしてくれるでしょう！"
    },
    "capricorn": {
      "date": "2026-01-07",
      "sign": "Capricorn",
      "horoscope": "Capricorn, you might find yourself feeling a bit off today due to indulgences in food and drink. It seems your friends have treated you to some delightful culinary temptations, which is always enjoyable, but now it's time to deal with the aftermath! Consider a refreshing workout paired with plenty of water to help eliminate any excess and rejuvenate your body. A little nap could also work wonders, helping you return to your usual self. Time to take action!",
      "horoscope_ja": "山羊座のあなたは、今日は食べ過ぎや飲み過ぎで、少し気分が落ち込んでいるかもしれません。友人たちが美味しい料理をご馳走してくれたようですが、それはいつも楽しいものです。でも、今はその余韻に浸る時です！水分をたっぷり摂りながら、リフレッシュできるワークアウトをしてみてはいかがでしょうか。余分な水分を排出し、体をリフレッシュさせましょう。少し昼寝するのも効果的で、いつもの自分に戻るのに役立ちます。さあ、行動を起こしましょう！"
    },
    "aquarius": {
      "date": "2026-01-07",
      "sign": "Aquarius",
      "horoscope": "Aquarius, you could be navigating a significant job transition at this moment, possibly even shifting to an entirely new career path. While your dedication is beginning to yield results, it may take some time before you see the financial benefits. There are likely contracts and agreements that need to be finalized first. As you focus on this change, your social life might take a backseat for a while. But don’t let that discourage you; trust that you are on the right path.",
      "horoscope_ja": "水瓶座のあなたは、今まさに大きな転職の時期を迎えているかもしれません。もしかしたら、全く新しいキャリアパスへと転向するかもしれません。あなたの献身的な努力は成果を上げ始めていますが、経済的な恩恵が現れるまでには少し時間がかかるかもしれません。まずは締結すべき契約や合意事項があるでしょう。この変化に集中する間、しばらくは社会生活が後回しになるかもしれません。しかし、落胆する必要はありません。あなたは正しい道を歩んでいると信じてください。"
    },
    "pisces": {
      "date": "2026-01-07",
      "sign": "Pisces",
      "horoscope": "Pisces, you might find yourself caught in a whirlwind of competing demands from your personal desires, family obligations, and work responsibilities. This could leave you feeling anxious and strained, questioning if things will ever settle down. Take a deep breath—there's no need to worry. Resolution is on the horizon, and you'll emerge from this experience unscathed. The key here is to seek balance, and the path to peace lies in achieving it. So, roll up your sleeves and tackle this challenge head-on; you'll be glad to move forward.",
      "horoscope_ja": "魚座のあなたは、個人的な欲求、家族の義務、そして仕事の責任といった相反する要求の渦に巻き込まれているかもしれません。そのため、不安や緊張を感じ、事態が落ち着くのかどうか疑問に思うかもしれません。しかし、深呼吸をしましょう。心配する必要はありません。解決の兆しはすぐそこにあり、あなたはこの経験から無傷で抜け出すでしょう。ここで重要なのはバランスを見つけることであり、それを達成することこそが平和への道なのです。さあ、袖をまくり上げて、この課題に真正面から立ち向かってください。きっと前進できるはずです。"
    }
  }
}