{
  "updated_at": "2025-11-28T16:29:59.335Z",
  "jst_date": "2025-11-29",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-29",
      "sign": "Aries",
      "horoscope": "Take a well-deserved break today! Consider skipping your usual responsibilities and immerse yourself in the beauty of art. Even better, unleash your own creativity—it's the perfect time to dive into a project you've been longing to start. Your artistic instincts and intuition are peaking right now, and this powerful blend could lead to something truly remarkable.",
      "horoscope_ja": "今日は、心ゆくまで休息を取りましょう！普段の仕事を一旦止めて、芸術の美しさに浸ってみてはいかがでしょうか。さらに良いのは、自分の創造性を解き放つことです。ずっと始めたいと思っていたプロジェクトに没頭するのに最適な時期です。あなたの芸術的な本能と直感は今まさに最高潮に達しており、この力強い融合が、真に素晴らしい何かを生み出すかもしれません。"
    },
    "taurus": {
      "date": "2025-11-29",
      "sign": "Taurus",
      "horoscope": "Prepare for a thrilling and dynamic day ahead! Your inquisitive nature is heightened, and it beautifully intertwines with your rich imagination. This unique blend makes you particularly well-equipped for any medical research endeavors, allowing you to draw insightful links between seemingly unrelated concepts. No matter your field, anticipate a fresh perspective on the world around you today.",
      "horoscope_ja": "刺激的でダイナミックな一日が始まります！あなたの探究心は高まり、豊かな想像力と美しく融合しています。このユニークな組み合わせは、医学研究のあらゆる取り組みにおいて特に優れた能力を発揮し、一見無関係に見える概念同士を洞察力に満ちた繋がりで結びつけることを可能にします。どんな分野であっても、今日は周囲の世界に対する新たな視点が生まれることを期待してください。"
    },
    "gemini": {
      "date": "2025-11-29",
      "sign": "Gemini",
      "horoscope": "You've probably been putting in a lot of effort lately, and it might be time to consider taking a breather. Even if you manage to get out of bed, your productivity may be limited. When your heart isn't fully engaged, your mind struggles to keep up. A few days of rest and leisure could do wonders for your spirit. Why not plan a quick getaway to recharge?",
      "horoscope_ja": "最近、きっと多くの努力を重ねてきたでしょう。そろそろ息抜きを考えてみてはいかがでしょうか。ベッドから起き上がることができたとしても、生産性は限られてしまうかもしれません。心が完全に集中していないと、頭もついていくのに苦労してしまいます。数日間の休息とリラックスは、精神に素晴らしい効果をもたらすかもしれません。リフレッシュするために、ちょっとした小旅行を計画してみてはいかがでしょうか？"
    },
    "cancer": {
      "date": "2025-11-29",
      "sign": "Cancer",
      "horoscope": "Today marks a pivotal moment for you to broaden your perspectives. The days of passively waiting for circumstances to shift are behind you. You've matured enough to understand that if you desire change, you must take the initiative to create it. Consequently, expect a bustling day ahead as you start putting into action all those ideas that have been swirling in your mind.",
      "horoscope_ja": "今日は、あなたにとって視野を広げる重要な瞬間です。状況の変化をただ待つ日々は終わりました。変化を望むなら、自ら率先して行動を起こす必要があることを理解できるほど成熟しました。そのため、頭の中で渦巻いていたアイデアを行動に移し始めると、これからは慌ただしい一日になるでしょう。"
    },
    "leo": {
      "date": "2025-11-29",
      "sign": "Leo",
      "horoscope": "While your desire to improve your financial circumstances is strong, it's important to avoid hasty decisions. If you're faced with multiple choices, take your time to let your thoughts settle before committing to any path. If you feel the urge to rush forward, consider jotting down your options for later reflection when you have a clearer perspective.",
      "horoscope_ja": "経済状況を改善したいという強い思いはあるものの、性急な決断は避けることが大切です。複数の選択肢がある場合は、決断する前にじっくり考えを落ち着かせましょう。焦って先に進みたくなる衝動に駆られた場合は、選択肢をメモしておき、見通しが明確になった時にじっくり考えてみましょう。"
    },
    "virgo": {
      "date": "2025-11-29",
      "sign": "Virgo",
      "horoscope": "No matter how hard you try, today might find you stumbling over your words. It’s one of those days where your attempts to clarify things could end up creating even more confusion. While you’re eager to enjoy a lively evening with friends, you might worry about making things more complicated. Remember, your friends appreciate you, even on days when your social finesse isn’t quite on point!",
      "horoscope_ja": "どんなに頑張っても、今日は言葉に詰まってしまうかもしれません。物事を明確にしようと努力した結果、かえって混乱を招いてしまう日です。友人と賑やかな夜を楽しみたい気持ちはあるものの、事態を複雑にしてしまうのではないかと心配になるかもしれません。たとえ社交術がうまくいかなかった日でも、友人たちはあなたのことを高く評価してくれていることを忘れないでください！"
    },
    "libra": {
      "date": "2025-11-29",
      "sign": "Libra",
      "horoscope": "Although you may be feeling overwhelmed at the moment, remember that this stress doesn't have to linger into tomorrow or even the rest of today. There are effective ways to calm your restless spirit. Take a moment to pause, shut your eyes, and indulge in some deep breathing. You might be amazed at how rejuvenating just a few minutes of this practice can be. Why not give it a shot?",
      "horoscope_ja": "今は圧倒されているように感じるかもしれませんが、このストレスを明日まで、あるいは今日一日ずっと引きずる必要はありません。落ち着かない心を落ち着かせる効果的な方法があります。少し立ち止まり、目を閉じて、深呼吸をしてみましょう。ほんの数分で、驚くほど元気になれることに驚くかもしれません。ぜひ試してみてはいかがでしょうか？"
    },
    "scorpio": {
      "date": "2025-11-29",
      "sign": "Scorpio",
      "horoscope": "You have a strong urge to dive straight into a new venture, but remember that not everyone shares your excitement. Be mindful not to bulldoze over the feelings of those closest to you. Your partner, in particular, may be feeling a bit neglected and upset right now. Take some time to mend any hurt feelings. It could be the perfect opportunity to pause your project and enjoy a romantic date instead.",
      "horoscope_ja": "新しいことにすぐに飛び込みたい衝動に駆られていますが、誰もがあなたの熱意を共有してくれるわけではないことを忘れないでください。身近な人の気持ちを踏みにじらないように気を付けましょう。特にパートナーは、今、少し疎外感を感じ、落ち込んでいるかもしれません。傷ついた気持ちを癒すために、少し時間を取りましょう。プロジェクトを一旦中断し、ロマンチックなデートを楽しむ絶好の機会かもしれません。"
    },
    "sagittarius": {
      "date": "2025-11-29",
      "sign": "Sagittarius",
      "horoscope": "It's time to embrace fresh beginnings! This is your guiding principle today, particularly in your living space. Your enthusiasm and drive are at an all-time high. If anyone can pull off a full home makeover in just one day, it's you. However, remember that even the most capable can face challenges when attempting to shift heavy furniture solo. Don't hesitate to ask for assistance, but be mindful not to overexert your helpers. Not everyone shares your vibrant energy!",
      "horoscope_ja": "新たな始まりを迎える時です！これが今日のあなたの指針です。特にリビングスペースにおいては。あなたの熱意と意欲はかつてないほど高まっています。もしたった1日で家のリフォームを完璧にこなせる人がいるとしたら、それはあなたです。しかし、どんなに腕のいい人でも、重い家具を一人で動かすとなると、大変なこともあることを覚えておいてください。遠慮なく手伝ってもらいましょう。ただし、手伝ってくれる人に過度な負担をかけないように注意してください。誰もがあなたのような活力を持っているわけではありませんからね！"
    },
    "capricorn": {
      "date": "2025-11-29",
      "sign": "Capricorn",
      "horoscope": "As the old adage suggests, don't scrutinize a gift too closely. Today, you may find yourself on the receiving end of some positive news. Embrace it without doubt or concern about your deservingness. Acknowledge it for what it is, but it could be beneficial to reflect on the reasons behind any feelings of unworthiness you may have.",
      "horoscope_ja": "古い格言にあるように、贈り物をあまり吟味しすぎないようにしましょう。今日、あなたは良い知らせを受け取るかもしれません。自分がそれを受け取るに値するかどうか、疑ったり心配したりせずに、それを喜んで受け入れましょう。贈り物のありのままを受け入れましょう。しかし、もし自分が価値がないと感じているなら、その背後にある理由をじっくり考えてみるのも良いかもしれません。"
    },
    "aquarius": {
      "date": "2025-11-29",
      "sign": "Aquarius",
      "horoscope": "Do you find yourself believing that as long as you have checks available, your bank account is safe from overdraft? While your financial worries may seem daunting, rest assured that they can be resolved with some simple adjustments. It's not necessarily that you're overspending; rather, it's a matter of not monitoring your expenses closely. By improving your recordkeeping, you'll find a sense of relief from your financial stress.",
      "horoscope_ja": "小切手さえあれば、銀行口座の残高不足は心配無用だと思っていませんか？お金の不安は重苦しいように思えるかもしれませんが、ご安心ください。ちょっとした工夫で解決できます。必ずしもお金を使いすぎているわけではなく、支出をきちんと管理できていないだけなのです。記録管理を改善することで、経済的なストレスから解放されるはずです。"
    },
    "pisces": {
      "date": "2025-11-29",
      "sign": "Pisces",
      "horoscope": "Today is a favorable day for connections. Whether in your personal life or at work, positive developments are on the horizon. You might find yourself invited to join an unconventional team project, which could lead to the blossoming of wonderful new friendships. Meanwhile, your partner at home may show extra care and affection. You exude a vibe of love and warmth, and others are likely to mirror that energy.",
      "horoscope_ja": "今日は人間関係に恵まれた日です。プライベートでも仕事でも、前向きな展開が期待できます。型破りなチームプロジェクトに誘われるかもしれません。そこから素晴らしい新しい友情が芽生えるかもしれません。一方、家庭ではパートナーがいつも以上に気遣いと愛情を示してくれるかもしれません。あなたは愛情と温かさを醸し出しており、周りの人もそのエネルギーに共感してくれるでしょう。"
    }
  }
}