{
  "updated_at": "2026-01-08T16:36:38.667Z",
  "jst_date": "2026-01-09",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-09",
      "sign": "Aries",
      "horoscope": "Aries, today you may find yourself feeling a bit off-kilter, leading you to prefer the comfort of home. The allure of lounging in front of the TV might outweigh the idea of socializing. While your friends may encourage you to join them for a night out, it's important to stand your ground. Politely let them know that a cozy night in is what you truly need, and assure them that you'll be up for fun another time.",
      "horoscope_ja": "牡羊座さん、今日は少し気分が落ち込んでいて、家でのくつろぎを優先してしまうかもしれません。テレビの前でゆったり過ごすことの魅力が、人との交流よりも優先されるかもしれません。友達が一緒に夜遊びに行こうと誘ってくるかもしれませんが、自分の意見を貫くことが大切です。本当に必要なのは家で過ごす居心地の良い夜であることを丁寧に伝え、また別の機会に楽しい時間を過ごしたいと伝えましょう。"
    },
    "taurus": {
      "date": "2026-01-09",
      "sign": "Taurus",
      "horoscope": "A dear friend or romantic partner may be experiencing some sadness today, Taurus, and they might reach out to you for a comforting ear. Your support will mean the world to them, but be mindful not to let their troubles sidetrack you from your own responsibilities. You likely have errands to complete, people to connect with, and tasks that require your attention. Offer your friend the compassion they need, but after a suitable amount of time, gently excuse yourself to focus on your own priorities.",
      "horoscope_ja": "おうし座さん、今日は大切な友人や恋人が悲しみに暮れていて、慰めを求めてあなたに声をかけてくるかもしれません。あなたのサポートは彼らにとってかけがえのないものですが、彼らの悩みに気を取られて、自分の責任を忘れてしまわないように気をつけてください。きっと、やらなければならない用事や、人との交流、そして集中しなければならない仕事などがあるでしょう。友人に必要な思いやりを示してあげましょう。そして、適切な時間を置いて、優しく席を立ち、自分の優先事項に集中しましょう。"
    },
    "gemini": {
      "date": "2026-01-09",
      "sign": "Gemini",
      "horoscope": "Gemini, if you're planning a shopping trip today, be prepared to encounter a tempting luxury item that will catch your eye and make you wish you could have it. While it's important to resist the urge to make an impulsive purchase, don't completely dismiss the idea either. Ask yourself: will this item bring you genuine joy, or will it end up collecting dust after a brief moment of excitement? Take a moment to reflect on what you truly desire before making a decision!",
      "horoscope_ja": "ふたご座さん、今日ショッピングを計画しているなら、思わず目を引き、欲しいと思わせるような魅力的な高級品に出会うかもしれません。衝動買いの衝動を抑えることは大切ですが、その考えを完全に捨て去るのもやめましょう。自分に問いかけてみてください。この品はあなたに真の喜びをもたらすのでしょうか？それとも、束の間の興奮の後、結局は埃をかぶってしまうのでしょうか？決断する前に、本当に欲しいものについてじっくり考えてみましょう！"
    },
    "cancer": {
      "date": "2026-01-09",
      "sign": "Cancer",
      "horoscope": "Cancer, are you anticipating some guests? If so, you may feel a wave of anxiety about your home not being as pristine and inviting as you'd prefer. You might feel the urge to grab your broom, mop, and bucket and clean like a whirlwind! However, it's important to pace yourself. Your visitors won't mind if that spare bedroom is a bit cluttered. Save your energy to truly enjoy their presence. Take care of yourself!",
      "horoscope_ja": "蟹座さん、来客を控えていますか？もしそうなら、家が思ったほど清潔で居心地の良い空間になっていないのではないかと不安に襲われるかもしれません。ほうき、モップ、バケツを手に取り、猛烈に掃除したくなるかもしれません！でも、ペースを守ることが大切です。来客は、予備の寝室が多少散らかっていても気にしません。エネルギーを温存して、来客を心から楽しみましょう。お体にはお気をつけください！"
    },
    "leo": {
      "date": "2026-01-09",
      "sign": "Leo",
      "horoscope": "Leo, you may be turning heads with your appearance, but inside, you might not feel as confident. Today could be one of those moments when you glance in the mirror and feel more like a creature from a horror film than the star you truly are. It's the perfect opportunity to indulge in some self-care. Consider getting a fresh haircut, enjoying a soothing massage, or unwinding in a sauna or Jacuzzi. Don't forget to treat yourself to a refreshing fruit smoothie at your favorite juice spot. You'll lift your spirits and feel rejuvenated! Enjoy your day!",
      "horoscope_ja": "レオさん、外見は人目を惹きつけるかもしれませんが、内面は自信が持てないかもしれません。今日は、鏡を見て、本当の自分というよりホラー映画の怪物のように感じる瞬間の一つかもしれません。セルフケアを楽しむ絶好の機会です。ヘアカットをしたり、心地よいマッサージを受けたり、サウナやジャグジーでリラックスしたりしてみてはいかがでしょうか。お気に入りのジュースバーで爽やかなフルーツスムージーを飲むのもお忘れなく。気分も上がり、若返った気分になれるはずです！良い一日を！"
    },
    "virgo": {
      "date": "2026-01-09",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you might find that the intellectual or spiritual ideas you're exploring feel just out of reach. Resist the urge to force understanding; doing so may only lead to further confusion. Remember, it's not a sign of losing your grip—your mental energy is simply running low. Instead, take a break and focus on something different for a bit. Allow the thoughts to simmer in your subconscious. Tomorrow, you might just have a moment of clarity that makes you want to shout, \"Eureka!\" So, be gentle with yourself.",
      "horoscope_ja": "乙女座のあなたは今日、探求している知的または精神的なアイデアが、手の届かないものに感じられるかもしれません。無理に理解しようと試みる衝動を抑えましょう。そうすることで、混乱が深まるだけです。これは、コントロールを失ったサインではなく、単に精神的なエネルギーが不足しているだけであることを覚えておいてください。少し休憩して、何か別のことに集中してみましょう。潜在意識の中で、その考えをじっくりと煮詰めてみましょう。明日は、「エウレカ！」と叫びたくなるような、明晰な瞬間が訪れるかもしれません。ですから、自分に優しくしてください。"
    },
    "libra": {
      "date": "2026-01-09",
      "sign": "Libra",
      "horoscope": "Libra, if you're currently engaged in a creative endeavor, you may feel as though your inspiration has taken a vacation. You might find yourself struggling to generate fresh ideas, only to hit a wall each time. Today may not be the ideal time to push forward with your project. Remember, taking a step back can be essential for preserving the quality of your work. Consider focusing on something different for now. You'll find your creative flow returning by tomorrow.",
      "horoscope_ja": "天秤座のあなた、もしあなたが今、何か創造的な活動に取り組んでいるなら、インスピレーションが休暇を取ってしまったように感じるかもしれません。斬新なアイデアを生み出すのに苦労し、毎回壁にぶつかってしまうかもしれません。今日はプロジェクトを進めるのに理想的な時期ではないかもしれません。仕事の質を保つためには、少し距離を置くことが不可欠であることを忘れないでください。今は何か違うことに集中することを検討してみてください。明日には創造的な流れが戻ってくるでしょう。"
    },
    "scorpio": {
      "date": "2026-01-09",
      "sign": "Scorpio",
      "horoscope": "Today, a friend might reach out to you for some guidance on a financial matter, Scorpio. While it’s not a huge issue, it could involve an important decision they need to tackle. Instead of making the choice for them, focus on sharing relevant information that will help them come to their own conclusion. This approach will ensure they feel empowered in their decision-making process. Your insight will surely be valued!",
      "horoscope_ja": "蠍座のあなた、今日は友人が金銭面でアドバイスを求めてあなたに連絡してくるかもしれません。大きな問題ではないかもしれませんが、友人が対処しなければならない重要な決断に関わる可能性があります。代わりに選択を委ねるのではなく、友人が自分で結論を出せるよう、関連情報を共有することに重点を置いてください。このアプローチは、友人が意思決定プロセスにおいて自信を持てるようにするのに役立ちます。あなたの洞察力はきっと高く評価されるでしょう！"
    },
    "sagittarius": {
      "date": "2026-01-09",
      "sign": "Sagittarius",
      "horoscope": "Sagittarius, you might find that a dear friend or romantic partner isn't picking up your calls, which could stir up some insecurities within you. It's easy to jump to conclusions and feel like they no longer value your friendship. However, don't let those thoughts take over. It's likely that your friend is caught up with others who require their attention and isn't ignoring you on purpose. Stay patient, keep yourself occupied, and try reaching out again tomorrow. You may receive a quicker reply then!",
      "horoscope_ja": "射手座のあなたは、大切な友人や恋人が電話に出てくれないことに気づき、不安を募らせるかもしれません。すぐに結論を出してしまい、相手がもうあなたの友情を大切にしていないと感じてしまうかもしれません。しかし、そんな考えに支配されてはいけません。友人は、あなたを無視しているのではなく、他のことに気を取られている可能性が高いのです。辛抱強く、何かに気を取られずに、明日もう一度連絡を取ってみてください。きっと返事はもっと早く来るでしょう！"
    },
    "capricorn": {
      "date": "2026-01-09",
      "sign": "Capricorn",
      "horoscope": "Capricorn, if you have a special date lined up for tonight, be prepared for some unexpected holdups. You may find yourself caught up in your usual errands, which could lead to some frustration for both you and your date. However, rest assured that you'll connect eventually. Try not to let the delays dampen your spirits before you meet; staying positive will make all the difference! Just stay patient, and your evening is sure to be wonderful.",
      "horoscope_ja": "山羊座さん、今夜特別なデートの予定があるなら、予期せぬトラブルに見舞われる覚悟をしておきましょう。いつもの用事に追われて、相手もあなたもイライラしてしまうかもしれません。でも、きっといつかはうまくいくはずです。会う前に、遅延に気を落とさないようにしてください。前向きな気持ちでいることが、全てを変えてくれるのです！辛抱強く待っていれば、きっと素晴らしい夜になるでしょう。"
    },
    "aquarius": {
      "date": "2026-01-09",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you might find yourself feeling a bit off due to some indulgent choices in food or drink. This could make it challenging to concentrate on tasks that require your focus. It’s a good idea to take things at a leisurely pace to restore your energy. Aim to do just enough to ease your mind without exhausting yourself. Grab a cozy book, brew a soothing cup of tea, and take some time to unwind on the couch.",
      "horoscope_ja": "水瓶座のあなたは、今日は食べ物や飲み物を贅沢に摂りすぎたせいで、少し気分が落ち込んでいるかもしれません。集中力を要する仕事に集中するのが難しくなるかもしれません。エネルギーを回復するために、ゆっくりとしたペースで物事を進めるのが良いでしょう。疲れすぎない程度に、心が落ち着く程度に活動しましょう。心地よい本を片手に、心安らぐお茶を淹れて、ソファでゆったりとくつろぎましょう。"
    },
    "pisces": {
      "date": "2026-01-09",
      "sign": "Pisces",
      "horoscope": "Pisces, you might find yourself missing your significant other today, which could mean putting your passions and the joy of spending time with friends on the back burner. Resist the urge to let this situation bring you down. Instead, channel your creative spirit into artistic endeavors, or if you prefer something more active, hit the courts for a game of tennis or racquetball. Engaging in these activities will help the time fly by until your partner is back in your arms. Stay strong!",
      "horoscope_ja": "魚座のあなたは、今日は大切な人に会いたくてたまらなくなるかもしれません。それは、あなたの情熱や友達と過ごす喜びを後回しにしてしまうことになるかもしれません。この状況に落ち込む衝動を抑えましょう。代わりに、創造的な精神を芸術的な活動に注ぎ込んだり、もっとアクティブなことが好きなら、テニスやラケットボールでコートを囲んでプレーしたりしましょう。これらのアクティビティに熱中することで、パートナーがあなたの腕の中に戻ってくるまでの時間があっという間に過ぎていくでしょう。頑張ってください！"
    }
  }
}