{
  "updated_at": "2025-11-26T16:31:59.539Z",
  "jst_date": "2025-11-27",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-27",
      "sign": "Aries",
      "horoscope": "Financial concerns may have taken center stage in your life lately. While it's clear that your monetary situation isn't as bright as you'd prefer, remember that many share similar struggles. It's important to keep things in perspective. Don't let these financial worries strain your connections with loved ones. If you're feeling overwhelmed, don't hesitate to reach out for support.",
      "horoscope_ja": "最近、経済的な不安が生活の中心になっているかもしれません。経済状況が思ったほど良くないのは明らかですが、多くの人が同じような悩みを抱えていることを忘れないでください。物事を客観的に捉えることが大切です。こうした経済的な不安で、大切な人との関係に支障をきたさないようにしてください。もし心が押しつぶされそうになったら、ためらわずにサポートを求めましょう。"
    },
    "taurus": {
      "date": "2025-11-27",
      "sign": "Taurus",
      "horoscope": "Your normally high-energy self is signaling that it's time to hit the brakes. It's important to pause and recharge every now and then. Enjoying a generous serving of caramel popcorn while binge-watching your favorite show won't lead to a downward spiral. In fact, this little treat might just lift your spirits and leave you feeling rejuvenated. So, why not indulge a little?",
      "horoscope_ja": "普段はエネルギーに満ち溢れているあなたが、ブレーキをかける時だと合図を送っています。時折、立ち止まってエネルギーを充電することが大切です。お気に入りの番組を一気見しながら、キャラメルポップコーンをたっぷり食べても、悪いスパイラルに陥ることはありません。むしろ、このちょっとしたご褒美は気分を高め、若返った気分にさせてくれるかもしれません。さあ、少し贅沢してみてはいかがでしょうか？"
    },
    "gemini": {
      "date": "2025-11-27",
      "sign": "Gemini",
      "horoscope": "Today is the perfect opportunity to kick back and enjoy the fruits of your labor. You've accomplished so much recently, and you deserve a break. Consider taking a personal day to indulge in a midday movie or treat yourself to a delightful lunch with a glass of exquisite champagne. Use this time to celebrate your achievements and recharge before diving into your next venture.",
      "horoscope_ja": "今日は、リラックスして仕事の成果を味わう絶好の機会です。最近、たくさんのことを成し遂げたので、休息を取るのは当然です。昼間に映画を観たり、極上のシャンパンを片手に美味しいランチを楽しんだりするなど、プライベートな時間を設けてみてはいかがでしょうか。この時間を活用して、これまでの成果を祝い、次の挑戦に臨む前にエネルギーを充電しましょう。"
    },
    "cancer": {
      "date": "2025-11-27",
      "sign": "Cancer",
      "horoscope": "Brightening your space with flowers and greenery can lift your spirits and enhance your home environment. If your living area seems a bit lackluster, small adjustments can significantly boost your perspective. Consider visiting a kitchen store to treat yourself to some new essentials. Adding a pot of herbs to your windowsill can work wonders. You'll be pleasantly surprised by the transformation in both your mood and your surroundings!",
      "horoscope_ja": "花や緑で空間を明るくすると、気分が明るくなり、家の雰囲気も良くなります。リビングが少し物足りないと感じているなら、ちょっとした工夫で印象がガラリと変わります。キッチン用品店で新しい必需品を買ってみてはいかがでしょうか。窓辺にハーブの鉢植えを置くだけでも、驚くほどの効果があります。気分も周りの環境も、きっと驚くほど良くなるはずです。"
    },
    "leo": {
      "date": "2025-11-27",
      "sign": "Leo",
      "horoscope": "Today, you're experiencing a heightened sense of spirituality. Your dreams are particularly intense, and you feel they hold important messages for you. There's a strong desire to embark on a journey, especially to a place where you can immerse yourself in a new culture. While a physical trip may not be feasible at the moment, consider diving into some online exploration to satisfy your curiosity!",
      "horoscope_ja": "今日、あなたはスピリチュアルな感覚が高まっています。夢は特に強烈で、自分にとって重要なメッセージを感じています。旅に出たいという強い願望があり、特に新しい文化に浸れる場所への旅に出たいと願っています。今は実際に旅行に行くのは難しいかもしれませんが、好奇心を満たすためにオンラインで何かを探ってみましょう！"
    },
    "virgo": {
      "date": "2025-11-27",
      "sign": "Virgo",
      "horoscope": "Facing your challenges directly is crucial, but don’t let it stall your life’s progress. A significant individual, who once served as your anchor, is no longer a central part of your journey, and this shift can be tough to navigate. Be mindful not to retreat into yourself, as you might typically do when faced with difficulties. Push yourself to engage with others, and you might just discover a new friendship waiting for you.",
      "horoscope_ja": "課題に正面から向き合うことは重要ですが、それによって人生の前進を止めてはいけません。かつてあなたの支えとなってくれた大切な人が、もはやあなたの旅の中心ではなくなり、この変化を乗り越えるのは容易ではありません。困難に直面した時によくあるように、自分自身に閉じこもらないように気をつけましょう。他の人と関わるように自分を奮い立たせれば、あなたを待っている新しい友情が見つかるかもしれません。"
    },
    "libra": {
      "date": "2025-11-27",
      "sign": "Libra",
      "horoscope": "Embracing your best self is the ultimate comeback. If you're healing from a past relationship, one of the most effective ways to elevate your mood is by focusing on your appearance. Rise with the sun and hit the pavement for a run or join a fitness class. Treat yourself to some fresh outfits and pay special attention to your grooming. This self-care will not only boost your confidence but also draw in a more suitable partner.",
      "horoscope_ja": "最高の自分を受け入れることが、究極のカムバックです。過去の恋愛から立ち直りたいなら、気分を高める最も効果的な方法の一つは、外見に気を配ることです。朝早く起きて、ランニングをしたり、フィットネスクラスに参加したりしましょう。新鮮な服に身だしなみを整え、身だしなみにも気を配りましょう。こうしたセルフケアは自信を高めるだけでなく、より素敵なパートナーを引き寄せるでしょう。"
    },
    "scorpio": {
      "date": "2025-11-27",
      "sign": "Scorpio",
      "horoscope": "While socializing brings you joy, this evening calls for some well-deserved downtime. If possible, consider taking a break this afternoon. Settle into your cozy chair with an engaging book, enjoy a leisurely stroll in a garden, or experiment in the kitchen by whipping up a delicious meal. It's essential to take a moment to recharge your spirit. You'll approach your tasks tomorrow feeling refreshed and revitalized.",
      "horoscope_ja": "社交は楽しいものですが、今晩は心ゆくまで休息を取りましょう。可能であれば、午後に少し休憩を取ってみてはいかがでしょうか。心地よい椅子にゆったりと腰を下ろし、魅力的な本を読んだり、庭をゆっくりと散歩したり、キッチンで美味しい料理を作ってみたり。少し時間を取って心をリフレッシュすることは大切です。明日の仕事には、リフレッシュして活力を取り戻せるはずです。"
    },
    "sagittarius": {
      "date": "2025-11-27",
      "sign": "Sagittarius",
      "horoscope": "You have a heightened sensitivity to the emotions of those around you, a talent that can be both a blessing and a challenge. While it's wonderful to empathize, be cautious not to absorb the weight of others' struggles. Today, a dear friend might share their worries with you. Be a compassionate listener and provide guidance, but remember to set boundaries and avoid taking on more than you can handle. Ultimately, their issues are not yours to bear.",
      "horoscope_ja": "あなたは周囲の人の感情に非常に敏感で、それは喜びにも課題にもなり得る才能です。共感することは素晴らしいことですが、他人の苦しみを肩代わりしないように注意しましょう。今日、親しい友人があなたに悩みを打ち明けるかもしれません。思いやりを持って耳を傾け、助言を与えてください。ただし、境界線を守り、自分の能力を超える負担は負わないようにしましょう。結局のところ、彼らの問題はあなたが背負うべきものではありません。"
    },
    "capricorn": {
      "date": "2025-11-27",
      "sign": "Capricorn",
      "horoscope": "Today, it appears that delays are the name of the game, and there's little you can do to avoid them. Expect traffic jams during your travels and unanswered calls that leave you feeling frustrated. It might feel like you're caught in a never-ending loop, making progress but not really moving forward. Stay positive and try to keep your sense of humor alive through the chaos. A little chocolate might just lift your spirits! Remember, tomorrow holds the promise of improvement!",
      "horoscope_ja": "今日では、遅延はもはや当たり前のようで、それを避ける方法はほとんどありません。旅行中に交通渋滞に巻き込まれたり、電話に出てもらえずにイライラしたりすることも考えられます。まるで終わりのないループに巻き込まれ、進歩しているように見えても実際には前に進んでいないように感じるかもしれません。そんな混沌とした状況でも、前向きな姿勢を保ち、ユーモアのセンスを失わないようにしてください。チョコレートを少し食べれば、気分が明るくなるかもしれません！明日は必ず良くなるという約束があることを忘れないでください！"
    },
    "aquarius": {
      "date": "2025-11-27",
      "sign": "Aquarius",
      "horoscope": "Today, the protective bubble you've been in might finally pop, leading to some unexpected letdowns. It's important not to let this bring you down. Focus on the broader perspective and remember that outings, gatherings, or enjoyable days can always be postponed. This way, you'll have the joy of anticipating these experiences once more.",
      "horoscope_ja": "今日、あなたがこれまで守ってきたバブルがついに崩壊し、予期せぬ失望に見舞われるかもしれません。落ち込まないことが大切です。広い視野を持ち、外出や集まり、楽しい日々はいつでも延期できることを覚えておきましょう。そうすれば、再びこれらの経験を楽しみに待つことができるでしょう。"
    },
    "pisces": {
      "date": "2025-11-27",
      "sign": "Pisces",
      "horoscope": "Today is a time for introspection rather than external engagement. This is fortunate, as the outside world may not be very inviting. Things might feel off-kilter—checks are delayed, and your messages go unanswered, leaving you feeling somewhat powerless. Don't be disheartened; this isn't a reflection of your abilities but rather a cosmic influence at play. This phase will soon fade. In the meantime, indulge in a solo activity that brings you joy.",
      "horoscope_ja": "今日は外の世界との関わりよりも、内省に重点を置くべき時です。外の世界があまり魅力的ではないかもしれないので、これは幸運なことです。物事がうまくいかないと感じるかもしれません。小切手が遅れたり、メッセージに返信がなかったりして、無力感に襲われるかもしれません。しかし、落胆しないでください。これはあなたの能力の表れではなく、宇宙的な影響によるものです。この時期はすぐに過ぎ去ります。それまでは、喜びをもたらしてくれる一人でできるアクティビティに没頭しましょう。"
    }
  }
}