{
  "updated_at": "2026-02-01T16:36:35.660Z",
  "jst_date": "2026-02-02",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-02",
      "sign": "Aries",
      "horoscope": "Aries, do you have a passion for abstract art? Today, you may feel a strong attraction to various artistic expressions, be it free verse poetry, abstract paintings, or ethereal New Age melodies. If you’re an artist, consider exploring the medium that resonates with you the most. If not, why not immerse yourself in creativity by attending a concert, wandering through an art gallery, or enjoying a poetry reading? Whatever you choose, make sure to savor every moment of your day!",
      "horoscope_ja": "牡羊座さん、あなたは抽象芸術に情熱を注いでいますか？今日は、自由詩、抽象画、あるいは幻想的なニューエイジのメロディーなど、様々な芸術表現に強い魅力を感じるかもしれません。もしあなたがアーティストなら、最も心に響く表現方法を探求してみてはいかがでしょうか。そうでないなら、コンサートに行ったり、アートギャラリーを散策したり、詩の朗読会を楽しんだりして、創作の世界に浸ってみてはいかがでしょうか。何を選ぶにせよ、一日の一瞬一瞬を大切に過ごしましょう！"
    },
    "taurus": {
      "date": "2026-02-02",
      "sign": "Taurus",
      "horoscope": "Taurus, have you been considering a home makeover? If that's the case, you may find yourself brimming with creative ideas, though choosing the best one could prove challenging. To clarify your thoughts, try jotting down a list to evaluate each option and see which one fits best for now. Browse through home decor magazines and furniture catalogs for inspiration, and note what catches your eye. You'll eventually make a decision, and it will be an enjoyable process!",
      "horoscope_ja": "おうし座さん、家のリフォームを考えてみませんか？もしそうなら、クリエイティブなアイデアが溢れてくるかもしれませんが、その中から最適なものを選ぶのは難しいかもしれません。考えを整理するために、リストに書き出してそれぞれの選択肢を評価し、今のところどれが一番しっくりくるか考えてみましょう。インテリア雑誌や家具カタログを見て、インスピレーションを得て、目に留まったものを書き留めておきましょう。最終的には決断を下すことになりますが、それはきっと楽しいプロセスになるでしょう！"
    },
    "gemini": {
      "date": "2026-02-02",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you may find emotions swirling as your significant other reaches out to talk about some issues. While these matters may not directly involve you, your desire to help is strong, especially when someone you care about is feeling down. In moments like this, it's often more beneficial to lend an ear rather than offer solutions. Your partner likely just needs a space to express their feelings. Stay patient, and everything will work out.",
      "horoscope_ja": "ふたご座のあなたは、今日、大切な人が何かの問題について相談に来ると、感情が渦巻くかもしれません。これらの問題はあなたに直接関係していないかもしれませんが、特に大切な人が落ち込んでいる時は、助けたいという強い思いが湧き上がります。このような時は、解決策を提示するよりも、耳を傾けてあげる方が効果的です。パートナーはただ、自分の気持ちを吐き出すためのスペースを必要としているのかもしれません。辛抱強く待っていれば、きっとすべてうまくいくでしょう。"
    },
    "cancer": {
      "date": "2026-02-02",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, a dear friend or your significant other might surprise you with a gift. While you’ll appreciate the gesture, it could also leave you feeling a bit uneasy. Perhaps the gift is extravagant or simply not to your taste. You might sense that your friend is overly enthusiastic about giving it. Ultimately, how you respond is your choice. Just a word of advice: unless the gift feels completely out of place, try not to decline it. And definitely avoid returning it—that’s not the best way to handle the situation!",
      "horoscope_ja": "今日、蟹座のあなたは、親しい友人や恋人からサプライズでプレゼントをもらうかもしれません。その心遣いは嬉しい反面、少し不安な気持ちになるかもしれません。もしかしたら、そのプレゼントは豪華だったり、単にあなたの好みに合わなかったりするかもしれません。友人がプレゼントを贈ることに熱心すぎると感じるかもしれません。結局のところ、どう対応するかはあなた次第です。アドバイスを一つ。プレゼントが全く場違いだと感じない限り、断らないようにしましょう。そして、絶対に返品は避けましょう。状況に対処する最善の方法ではありません！"
    },
    "leo": {
      "date": "2026-02-02",
      "sign": "Leo",
      "horoscope": "Leo, it might feel like your romantic life is in turmoil, but the reality is often less dire than it appears. Emotions are heightened right now, especially since your current partner seems distant and less talkative. Resist the urge to let your doubts take control and react impulsively. Remember, your partner cares for you deeply, even if their thoughts are elsewhere. External pressures from family or work are clouding your time together. Stay calm, practice patience, and hold on tight.",
      "horoscope_ja": "レオ座さん、恋愛がうまくいっていないように感じるかもしれませんが、現実は見た目ほど悲惨なことではないことが多いです。特に今のパートナーが冷淡で口数も少なくなっているため、感情が高ぶっているのかもしれません。疑念に支配され、衝動的に反応してしまう衝動を抑えましょう。たとえ他のことを考えていたとしても、パートナーはあなたを深く愛していることを忘れないでください。家族や仕事からのプレッシャーが、二人の時間を曇らせているかもしれません。冷静さを保ち、忍耐強く、しっかりと持ちこたえてください。"
    },
    "virgo": {
      "date": "2026-02-02",
      "sign": "Virgo",
      "horoscope": "Virgo, are you bursting with creative ideas for new ventures? It seems you're tapping into your past for inspiration. While your memories can be a treasure trove of creativity, today you might find that some of these thoughts stir up more emotions than necessary. It's important to let these feelings go; it's a vital part of your healing process. Consider pouring your emotions into your creative pursuits, as this could be a liberating experience. By day’s end, you should feel rejuvenated. Embrace the journey!",
      "horoscope_ja": "おとめ座さん、新しい事業のためのクリエイティブなアイデアが溢れていますか？インスピレーションを得るために過去を振り返っているようです。記憶は創造性の宝庫である一方、今日はそれらの思考が必要以上に感情を掻き立ててしまうかもしれません。こうした感情を手放すことが大切です。それはあなたの癒しのプロセスにおいて不可欠な部分です。創造的な活動に感情を注ぎ込んでみましょう。解放感を得られるかもしれません。一日の終わりには、きっと若返った気分になるでしょう。この旅路を心から楽しみましょう！"
    },
    "libra": {
      "date": "2026-02-02",
      "sign": "Libra",
      "horoscope": "Libra, are you finding yourself unexpectedly drawn to an old friend? This new feeling might leave you feeling a bit bewildered and even anxious, especially since you've never seen them in this light before. The good news is that they likely feel the same way about you, so don’t dismiss this connection just yet. Take a moment to reflect: could this person play a significant role in your future? How well do you truly know one another? Do you hold the respect for them that they deserve? If your answers lean towards the affirmative, it might be worth exploring this budding relationship!",
      "horoscope_ja": "天秤座さん、あなたは思いがけず旧友に惹かれている自分に気づきましたか？この新しい感覚に、少し戸惑い、不安さえ感じるかもしれません。特に、これまで相手をこんな風に捉えたことがなかったからです。朗報なのは、相手もあなたに対して同じように感じている可能性が高いということです。ですから、この関係をすぐに諦めないでください。少し時間を取って考えてみてください。この人はあなたの将来に重要な役割を果たす可能性はありますか？お互いをどれだけ深く理解していますか？相手にふさわしい敬意を払っていますか？もしあなたの答えが肯定的なら、この芽生えつつある関係をじっくりと探ってみる価値があるかもしれません！"
    },
    "scorpio": {
      "date": "2026-02-02",
      "sign": "Scorpio",
      "horoscope": "Scorpio, are you feeling the love? Today, your mind may be consumed with thoughts of your special someone, even when you're not together. The intensity of your feelings could border on obsession, potentially distracting you from your other responsibilities. It's important to maintain your focus on your current tasks, but don’t forget to plan a date with your partner for later. Balancing all aspects of your life is key!",
      "horoscope_ja": "蠍座さん、愛を感じていますか？今日は、一緒にいなくても大切な人のことを考えてしまうかもしれません。その気持ちの強さは執着に近いものになり、他の責任から気を取られてしまうかもしれません。今やるべきことに集中し続けることは大切ですが、パートナーとのデートの予定も忘れずに。人生のあらゆる側面のバランスを取ることが鍵です！"
    },
    "sagittarius": {
      "date": "2026-02-02",
      "sign": "Sagittarius",
      "horoscope": "You might find yourself stirred by an image of an artistic piece from another culture, Sagittarius. While the reason for this emotional response may elude you, it will ignite a newfound curiosity about that culture. This connection likely ties back to forgotten experiences from your past. Embrace this emerging interest; it promises to be fascinating and may even aid in healing old wounds or fears. Have fun with this journey!",
      "horoscope_ja": "射手座のあなたは、異文化の芸術作品のイメージに心を揺さぶられるかもしれません。この感情的な反応の理由はわからないかもしれませんが、その文化への新たな好奇心が湧き上がるでしょう。この繋がりは、あなたの過去の忘れられた経験と深く結びついている可能性があります。この新たな興味を受け入れてください。きっと魅力的な体験となり、古傷や恐怖を癒す助けとなるかもしれません。この旅を楽しんでください！"
    },
    "capricorn": {
      "date": "2026-02-02",
      "sign": "Capricorn",
      "horoscope": "Capricorn, are you feeling concerned about a friend's mental and emotional well-being? Try not to stress too much. Chances are, their main worry revolves around financial issues. If this friend happens to be your romantic partner, tread lightly and avoid pressuring them for personal insights, as this might create distance. Your loved one will open up when they feel ready. For now, practice patience and be an attentive listener.",
      "horoscope_ja": "山羊座のあなた、友人の精神的、感情的な健康状態が心配ですか？あまりストレスを感じすぎないようにしましょう。おそらく、彼らの主な悩みは経済的な問題に集中しているのでしょう。もしその友人があなたの恋人だった場合は、慎重に行動し、個人的な意見を聞こうとプレッシャーをかけすぎないようにしましょう。そうすると、相手との距離が生まれてしまうかもしれません。相手は心の準備ができた時に、心を開いてくれるでしょう。今は、辛抱強く、相手の話をよく聞いてあげてください。"
    },
    "aquarius": {
      "date": "2026-02-02",
      "sign": "Aquarius",
      "horoscope": "Aquarius, it seems your romantic partner might be dealing with some family issues right now. As a result, don't anticipate any lively discussions tonight. They may appear distracted and not in the most cheerful spirit. Remember, this isn't a reflection of your relationship. Try not to let any insecurities creep in. There's no need to press for answers. Instead, offer your presence, even if it means sitting in silence, allowing your partner the space to sort through their thoughts. This thoughtful approach will surely be valued.",
      "horoscope_ja": "水瓶座さん、あなたの恋人は今、家族の問題を抱えているようです。そのため、今夜は活発な話し合いは期待できません。相手は気が散っていて、あまり明るくないかもしれません。しかし、それはあなたの関係を反映するものではないことを覚えておいてください。不安を募らせないようにしてください。答えを急ぐ必要はありません。代わりに、たとえ沈黙して座っていなければならないとしても、相手が考えを整理する時間を与えてあげてください。この思いやりのあるアプローチは、きっと高く評価されるでしょう。"
    },
    "pisces": {
      "date": "2026-02-02",
      "sign": "Pisces",
      "horoscope": "Do you have a friend celebrating their birthday, Pisces? If that's the case, prepare yourself for a feast of delicious treats at the celebration! If you're on a journey to enhance your health and fitness, you might find it challenging to stick to your routine. Stay strong in your resolve, but also keep in mind that everyone deserves a little indulgence now and then. While chocolate cake and ice cream may not fit into your diet plan, consider them a boost for your emotional well-being. Treat yourself to a small portion!",
      "horoscope_ja": "魚座の皆さん、誕生日のお祝いをする友達はいますか？もしそうなら、お祝いには美味しいごちそうを用意しましょう！健康とフィットネスの向上を目指しているなら、いつものルーティンを続けるのは難しいかもしれません。強い決意を貫きましょう。でも、時には少し贅沢するのもいいものです。チョコレートケーキやアイスクリームはダイエットには合わないかもしれませんが、心身の健康には良いものなので、少しだけ自分にご褒美をあげましょう！"
    }
  }
}