{
  "updated_at": "2026-01-26T16:40:00.967Z",
  "jst_date": "2026-01-27",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-27",
      "sign": "Aries",
      "horoscope": "Today, you might notice that a significant person in your life, whether a partner or a coworker, is feeling a bit on edge, and it could affect your mood. Remember, Aries, their irritability is likely not a reflection of you or your actions. It’s best to give them some space until they’ve calmed down. Additionally, steer clear of social gatherings or invitations today; it’s wiser to hold off until tomorrow!",
      "horoscope_ja": "今日、パートナーや同僚など、あなたの人生における大切な人が少し神経質になっていることに気づくかもしれません。そして、それがあなたの気分に影響するかもしれません。牡羊座のあなた、彼らのイライラは、あなたやあなたの行動のせいではないことを覚えておいてください。彼らが落ち着くまで、少し距離を置いてあげるのが最善です。また、今日は社交的な集まりや招待には近づかないでください。明日まで待つ方が賢明です！"
    },
    "taurus": {
      "date": "2026-01-27",
      "sign": "Taurus",
      "horoscope": "Today, you may find yourself overwhelmed by a mountain of unfinished tasks and chores, leading to unnecessary stress. Remember to take it easy and don’t feel compelled to tackle everything at once; it’s perfectly fine to set some aside for another day. As a Taurus, your sensitivity might be heightened, making you more attuned to the emotions of those around you. To help alleviate this, take regular breaks and consider stepping outside for a walk. This will help refresh your mind and lighten your load.",
      "horoscope_ja": "今日は山積みの未完了タスクや雑事に圧倒され、余計なストレスを抱えているかもしれません。焦らずに、一度に全てに取り組まなくても大丈夫です。いくつかは別の日に回しても全く問題ありません。牡牛座のあなたは感受性が鋭くなり、周囲の人の感情に敏感になっているかもしれません。このストレスを軽減するために、定期的に休憩を取り、外に出て散歩してみましょう。気分転換になり、負担が軽くなります。"
    },
    "gemini": {
      "date": "2026-01-27",
      "sign": "Gemini",
      "horoscope": "Tensions are on the rise within your group, Gemini, as minor disagreements escalate into heated arguments. It's best to keep your distance from this drama; getting involved won't benefit you. Instead, jot down your thoughts and save them for a later discussion when everyone has calmed down. You may feel a strong urge to make a last-ditch effort to achieve a personal goal, but external obstacles may hinder your progress. Practice patience during this time!",
      "horoscope_ja": "ふたご座さん、些細な意見の相違が白熱した議論にエスカレートし、グループ内で緊張が高まっています。この騒動には距離を置くのが賢明です。巻き込まれるのは得策ではありません。代わりに、考えを書き留めておき、全員が落ち着いた後に話し合うようにしましょう。個人的な目標を達成するために、最後の努力をしたいという強い衝動に駆られるかもしれませんが、外的な障害があなたの進歩を阻むかもしれません。この時期は忍耐強く過ごしましょう！"
    },
    "cancer": {
      "date": "2026-01-27",
      "sign": "Cancer",
      "horoscope": "The urge to wrap up lingering projects and dive into new ones can stir up heightened emotions today. You, along with those around you, may find yourselves feeling anxious and on edge, which could lead to some disagreements. To navigate this tense atmosphere, it’s wise to concentrate on your own responsibilities rather than getting caught up in trivial conflicts. By doing so, you’ll not only maintain your composure but also leave a positive impression on those you wish to impress, Cancer.",
      "horoscope_ja": "長引いているプロジェクトを終わらせて新しいプロジェクトに飛び込みたいという衝動が、今日は感情を高ぶらせるかもしれません。あなた自身も周りの人も、不安や緊張を感じ、それが意見の相違につながるかもしれません。この緊張した雰囲気を乗り切るには、些細な争いに巻き込まれるのではなく、自分の責任に集中することが賢明です。そうすることで、蟹座のあなたは平静を保てるだけでなく、好印象を与えたい相手にも好印象を与えることができるでしょう。"
    },
    "leo": {
      "date": "2026-01-27",
      "sign": "Leo",
      "horoscope": "Today, Leo, you may find yourself feeling a bit on edge due to the frustration of not being able to implement your ideas. This restlessness could lead to minor disputes with those nearby. To steer clear of this pitfall, seek out different ways to channel your energy. Be cautious, as there's a risk of making hasty decisions without proper consideration. Take a moment to pause and reflect before taking action; otherwise, your hard work might go to waste.",
      "horoscope_ja": "獅子座のあなたは今日、自分のアイデアを実行に移せないというフラストレーションから、少し神経質になっているかもしれません。この落ち着きのなさが、周囲の人々との些細な諍いにつながる可能性があります。この落とし穴を避けるには、エネルギーを別の方法で発散させる方法を探しましょう。しかし、十分な検討なしに性急な決断を下してしまうリスクがあるので、注意が必要です。行動を起こす前に、少し立ち止まってじっくり考えてみましょう。さもないと、せっかくの努力が水の泡になってしまうかもしれません。"
    },
    "virgo": {
      "date": "2026-01-27",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you may find that pushing yourself too hard could lead to stress-related issues like headaches or even fevers. To counter this, consider starting your day by taking it slow and focusing on your most urgent tasks. It's perfectly fine to postpone some responsibilities for another time. Additionally, be aware that tensions may rise among those around you, leading to potential conflicts. It's best to steer clear of these disputes, as getting involved could add to your discomfort.",
      "horoscope_ja": "乙女座のあなたは、今日、無理をしすぎると頭痛や発熱といったストレス関連の症状に悩まされるかもしれません。これに対処するには、一日をゆっくりと始め、最も緊急性の高い仕事に集中することを検討してみてください。いくつかの責任は後回しにしても全く問題ありません。また、周囲の人々の間で緊張が高まり、衝突につながる可能性もあることにも注意してください。こうした争いに巻き込まれると、あなたの不快感が増す可能性があるので、避けるのが最善です。"
    },
    "libra": {
      "date": "2026-01-27",
      "sign": "Libra",
      "horoscope": "If you're participating in a class or engaging in any group activity today, brace yourself for potential disagreements among those present. You may perceive these conflicts as pointless and frustrating, and the urge to intervene might arise. However, Libra, it's wiser to keep your distance. Instead, channel your frustration into a refreshing walk home; it will lift your spirits!",
      "horoscope_ja": "今日、授業やグループ活動に参加する場合は、参加者間で意見の相違が生じる可能性に備えましょう。こうした対立は無意味かつ苛立たしいと感じ、介入したくなる衝動に駆られるかもしれません。しかし、天秤座のあなたは、距離を置く方が賢明です。フラストレーションを、爽やかな帰宅の時間に向けましょう。きっと気分が明るくなるはずです！"
    },
    "scorpio": {
      "date": "2026-01-27",
      "sign": "Scorpio",
      "horoscope": "Feeling frustrated with those around you might lead you to seek relief through shopping or indulging in rich foods and drinks. While it's okay to treat yourself, Scorpio, be cautious not to go over the top. You wouldn't want to end up with a stomach ache or regretful purchases. Instead, channel that energy into physical activity or dive into your creative hobbies.",
      "horoscope_ja": "周りの人にフラストレーションを感じると、買い物や贅沢な食べ物や飲み物に手を出すことでストレス解消しようとするかもしれません。蠍座さん、自分へのご褒美は良いですが、やり過ぎには注意しましょう。お腹を痛めたり、後悔するような買い物をするのは避けたいですよね。その代わりに、そのエネルギーを運動やクリエイティブな趣味に注ぎ込みましょう。"
    },
    "sagittarius": {
      "date": "2026-01-27",
      "sign": "Sagittarius",
      "horoscope": "You may find yourself feeling more irritable and frustrated today, which could lead to taking out your feelings on those close to you, like friends, kids, or your partner. With a surge of energy bubbling inside you, it’s essential to find a way to channel it, Sagittarius. Consider hitting the pavement for a jog, hitting the gym, or joining an aerobics class. Engaging in physical activity can help release that pent-up energy and boost your mood with some feel-good endorphins. So, get moving!",
      "horoscope_ja": "今日はいつもよりイライラしたり、フラストレーションが溜まっているかもしれません。そのせいで、友達や子供、パートナーなど、身近な人に感情をぶつけてしまうかもしれません。射手座のあなたは、内側から湧き上がるエネルギーをうまく発散させる方法を見つけることが大切です。ジョギング、ジム通い、エアロビクスのクラスなどを検討してみてください。体を動かすことで、溜まったエネルギーを発散させ、エンドルフィンによる快感で気分を高めることができます。さあ、体を動かしましょう！"
    },
    "capricorn": {
      "date": "2026-01-27",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you may find yourself caught in a tug-of-war between your professional duties and your home life. This clash could leave you feeling overwhelmed and irritable, leading to a shorter fuse than normal. It's important to take a step back, think rationally, and seek a resolution to your dilemma before taking action. Resist the urge to engage in arguments with those around you. Later in the evening, consider hitting the dance floor to shake off some of that pent-up frustration!",
      "horoscope_ja": "山羊座のあなたは今日、仕事と家庭生活の間で綱引きをしているかもしれません。この衝突によって、あなたは圧倒され、イライラし、普段よりも短気になってしまうかもしれません。行動を起こす前に、一歩下がって冷静に考え、ジレンマの解決策を見つけることが大切です。周りの人と口論したくなる衝動を抑えましょう。夜遅くには、溜まったフラストレーションを解消するためにダンスフロアに繰り出すのも良いでしょう。"
    },
    "aquarius": {
      "date": "2026-01-27",
      "sign": "Aquarius",
      "horoscope": "You may receive some unsettling news today through long-distance calls from friends or family in far-off places. This could stir up feelings of frustration, and you might feel inclined to vent your anger on the caller. Remember, they are just delivering the message! Additionally, if you plan to venture out for short errands nearby, be prepared for frustrating traffic. If you need to get somewhere today, Aquarius, consider walking to reach your destination more swiftly!",
      "horoscope_ja": "今日は遠く離れた友人や家族からの長距離電話で、不安な知らせを受け取るかもしれません。フラストレーションが募り、相手に怒りをぶつけたくなるかもしれません。でも、相手はただメッセージを伝えているだけなのです！また、近場でちょっとした用事で出かける予定なら、渋滞に巻き込まれる可能性もあるので、覚悟しておきましょう。水瓶座の皆さん、今日どこかへ行かなければならない場合は、目的地に早く着くために歩いて行くことを検討してみてください！"
    },
    "pisces": {
      "date": "2026-01-27",
      "sign": "Pisces",
      "horoscope": "Today, you may find yourself waking up from unsettling dreams, leaving you with a sense of unexplained anger. It's a good idea to reflect on these dreams and delve into their meanings to uncover the root of your frustration and find ways to release it. Additionally, any concerning news regarding finances is probably unfounded, Pisces, so try not to let it rattle you or cause unnecessary stress.",
      "horoscope_ja": "今日は、不安な夢から目覚め、説明のつかない怒りに苛まれるかもしれません。これらの夢を振り返り、その意味を深く掘り下げて、フラストレーションの根源を突き止め、それを解消する方法を見つけるのが良いでしょう。また、魚座のあなた、お金に関する心配なニュースは、おそらく根拠のないものです。動揺したり、不必要なストレスを抱えたりしないようにしましょう。"
    }
  }
}