{
  "updated_at": "2025-12-13T16:29:40.874Z",
  "jst_date": "2025-12-14",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-14",
      "sign": "Aries",
      "horoscope": "Today, your home might become a hub for psychics, artists, and those with a spiritual inclination. This gathering promises to be intriguing and thought-provoking, yet be cautious of an individual who may thrive on creating discord and sparking debates. Stay alert to this potential disruption and try to diffuse any tension early on, or else this enriching experience could leave some participants feeling hurt and defensive.",
      "horoscope_ja": "今日、あなたの家は霊能者、芸術家、そしてスピリチュアル志向の人々にとっての拠点となるかもしれません。この集まりは興味深く、考えさせられるものになるでしょう。しかし、不和や議論を巻き起こすことに喜びを感じる人には注意が必要です。こうした潜在的な妨害には常に注意し、早い段階で緊張を和らげるようにしてください。さもないと、この豊かな経験が参加者の一部を傷つけ、守勢に立たしてしまう可能性があります。"
    },
    "taurus": {
      "date": "2025-12-14",
      "sign": "Taurus",
      "horoscope": "An exciting opportunity to enroll in a class you've been eyeing could present itself today, and you'll feel a strong urge to secure your spot immediately. However, you might encounter some obstacles along the way. If you attempt to register by phone, you may find the lines are jammed. Alternatively, if you choose to sign up online, the website could experience technical issues. Don't let these minor setbacks dishearten you. They are just temporary hurdles. This class is worth the effort, so keep pushing forward!",
      "horoscope_ja": "ずっと気になっていたクラスに申し込める絶好のチャンスが今日訪れるかもしれません。すぐにでも席を確保したい衝動に駆られるかもしれません。しかし、途中でいくつかの障害に遭遇するかもしれません。電話で申し込もうとすると、回線が混雑しているかもしれません。あるいは、オンラインで申し込む場合、ウェブサイトに技術的な問題が発生する可能性があります。こうした小さな障害に落胆しないでください。一時的な障害に過ぎません。このクラスは努力する価値があります。諦めずに頑張ってください！"
    },
    "gemini": {
      "date": "2025-12-14",
      "sign": "Gemini",
      "horoscope": "Are your investments looking robust? Whether you’re managing a hefty portfolio or simply have savings and home equity, you might feel a bit uneasy with the recent downturn in the stock market. Remember, there are many factors at play that aren’t visible to the average investor. This phase is only temporary, and you can expect the market to stabilize again soon.",
      "horoscope_ja": "あなたの投資は堅調ですか？多額のポートフォリオを運用している方も、貯蓄や住宅資産をお持ちの方も、最近の株式市場の下落に少し不安を感じているかもしれません。平均的な投資家には見えない多くの要因が影響していることを忘れないでください。この局面は一時的なもので、市場はすぐに安定すると期待できます。"
    },
    "cancer": {
      "date": "2025-12-14",
      "sign": "Cancer",
      "horoscope": "Your significant other might appear a bit preoccupied today. Resist the urge to assume they are interested in someone new. The truth is, they are likely grappling with challenges related to a personal aspiration. Once they feel ready to open up about it, your insights could help clarify their situation.",
      "horoscope_ja": "あなたの大切な人は、今日は少し何かに気を取られているように見えるかもしれません。相手が新しい人に関心を持っていると思い込むのはやめましょう。実は、相手は個人的な願望に関連した課題に取り組んでいる可能性が高いのです。相手が心を開いて話せるようになったら、あなたの洞察が状況を明確にするのに役立つかもしれません。"
    },
    "leo": {
      "date": "2025-12-14",
      "sign": "Leo",
      "horoscope": "Today, you might encounter some hiccups with your equipment. While you have a knack for using it, troubleshooting may not be your strong suit. Instead of stressing over it, consider reaching out to a friend or coworker for help, or even better, consult a professional. This support will boost your confidence and enhance your productivity.",
      "horoscope_ja": "今日は、お使いの機器に何らかのトラブルが発生するかもしれません。使い方は得意でも、トラブルシューティングは苦手かもしれません。そんな時は、ストレスを抱えるのではなく、友人や同僚に助けを求めたり、専門家に相談したりしてみましょう。こうしたサポートは自信を高め、生産性を向上させるでしょう。"
    },
    "virgo": {
      "date": "2025-12-14",
      "sign": "Virgo",
      "horoscope": "You might find yourself feeling a bit insecure today due to a friend's silence or abruptness. It's natural to question whether they still value your friendship. However, there's no need for concern. Your friend is dealing with their own challenges, and their mood isn't a reflection of their feelings for you. Give it some time; they'll reach out when they're in a better place.",
      "horoscope_ja": "今日は、友達の沈黙や突然の態度に少し不安を感じているかもしれません。友達がまだあなたの友情を大切にしてくれているのか疑問に思うのも当然です。しかし、心配する必要はありません。友達もそれぞれに問題を抱えており、その気分はあなたへの気持ちを反映しているわけではありません。少し時間をください。状況が改善したら、きっと連絡をくれるでしょう。"
    },
    "libra": {
      "date": "2025-12-14",
      "sign": "Libra",
      "horoscope": "One of your companions might have slipped away without sharing their destination. This could cause some concern among the group, but there's no need to panic. It's likely that your friend is just fine and simply needs some time to reflect on their own. It's important to come to terms with the fact that you won't receive any news from them today. Trust the process and try not to let anxiety take over.",
      "horoscope_ja": "もしかしたら、同行者の一人が行き先を伝えずにどこかへ行ってしまったかもしれません。グループ内で不安を抱くかもしれませんが、慌てる必要はありません。おそらく、友人はただ元気で、少し自分を見つめ直す時間が必要なだけでしょう。今日は彼らから何の連絡もないという事実を受け入れることが大切です。流れを信じ、不安に支配されないようにしてください。"
    },
    "scorpio": {
      "date": "2025-12-14",
      "sign": "Scorpio",
      "horoscope": "You might receive an unusual call or email today that leaves you feeling confused. The sender could be unfamiliar, the message may seem nonsensical, or it might deliver unsettling news. Be cautious, as the information could be blown out of proportion or even misleading. If it piques your interest, take the time to verify the details before making any assumptions or sharing it with others.",
      "horoscope_ja": "今日はいつもと違う電話やメールが届き、混乱してしまうかもしれません。差出人が見覚えのない人だったり、内容が意味不明だったり、不安を掻き立てるようなニュースだったりするかもしれません。情報が誇張されていたり、誤解を招く恐れもあるので、注意が必要です。もし興味をそそられるようなことがあれば、憶測したり、他の人に共有したりする前に、時間をかけて詳細を確認してください。"
    },
    "sagittarius": {
      "date": "2025-12-14",
      "sign": "Sagittarius",
      "horoscope": "Feeling overwhelmed by your finances? It’s easy to let anxiety take over, but you might be stressing over nothing. Take a moment to organize your documents, concentrate on the reality of your situation, and uncover the truth. By reviewing the numbers carefully, you’ll likely discover that you have the ability to manage things more effectively than you thought.",
      "horoscope_ja": "お金のことで頭がいっぱいですか？不安に押しつぶされてしまいがちですが、もしかしたら、それは単なる思い込みかもしれません。少し時間を取って書類を整理し、自分の現状に目を向け、真実を明らかにしましょう。数字を注意深く見直すことで、自分が思っていた以上に効果的に物事を管理できることに気づくはずです。"
    },
    "capricorn": {
      "date": "2025-12-14",
      "sign": "Capricorn",
      "horoscope": "Your mind might be brimming with inspiration for creative endeavors, yet these thoughts could feel a bit too broad or unclear to pin down. Jotting them down could be helpful, but there's no rush to dive into anything just yet. Allow yourself a few days to let these ideas simmer before choosing the one that resonates most with you. Exercise patience.",
      "horoscope_ja": "創造的な取り組みのためのインスピレーションが頭の中に溢れているかもしれませんが、その考えは漠然としていて、はっきりと表現しきれないと感じるかもしれません。書き留めておくことは役立つかもしれませんが、今すぐに何かに飛び込む必要はありません。数日間、アイデアをじっくりと熟成させてから、最も心に響くものを選びましょう。忍耐強く取り組んでください。"
    },
    "aquarius": {
      "date": "2025-12-14",
      "sign": "Aquarius",
      "horoscope": "Are you sensing some unusual energy from someone in your inner circle? It's likely that this individual isn't harboring any ill feelings towards you. Instead, they might be feeling anxious about impending shifts in their work life. Rest assured, these concerns are probably unfounded. Why not invite your friend to lunch? By simply being there to listen, you can help ease their burden and offer valuable insight.",
      "horoscope_ja": "身近な人から、いつもと違うエネルギーを感じていませんか？もしかしたら、その人はあなたに対して悪意を抱いているわけではないかもしれません。もしかしたら、仕事における変化が迫っていることに不安を感じているのかもしれません。安心してください。おそらく、その不安は杞憂に終わるでしょう。友人をランチに誘ってみてはいかがでしょうか？ただ耳を傾けるだけで、相手の負担を軽減し、貴重な洞察を提供できるかもしれません。"
    },
    "pisces": {
      "date": "2025-12-14",
      "sign": "Pisces",
      "horoscope": "You might find that a current or prospective romantic interest goes quiet and stops responding to your messages. This could trigger feelings of anxiety, making you question whether they’ve lost interest. However, resist the urge to jump to conclusions. Your partner may simply be preoccupied with other commitments. Keep in mind the wise adage: \"If you truly care for something, set it free.\" If you hold on too tightly, it may not have been meant for you to begin with.",
      "horoscope_ja": "恋愛関係にある相手、あるいは将来の恋人が連絡を絶ち、メッセージに返信しなくなることがあるかもしれません。これは不安感を引き起こし、相手が興味を失ったのではないかと疑ってしまうかもしれません。しかし、早合点するのはやめましょう。相手は単に他のことで頭がいっぱいなだけかもしれません。「本当に大切なものなら、自由にしてあげなさい」という格言を心に留めておきましょう。もしあなたが強くしがみついているなら、それはそもそもあなたのためのものではなかったのかもしれません。"
    }
  }
}