{
  "updated_at": "2025-11-17T16:33:09.101Z",
  "jst_date": "2025-11-18",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-18",
      "sign": "Aries",
      "horoscope": "Today is a fantastic day for love and romance! For those in a relationship, the bond with your partner is deepening, fostering a sense of togetherness that may pave the way for a solid commitment. If you're single, keep an eye out—someone you have your eye on might unexpectedly show interest in you!",
      "horoscope_ja": "今日は愛とロマンスにとって素晴らしい日です！交際中の方、パートナーとの絆が深まり、一体感が生まれ、それが確固たる決意へと繋がるかもしれません。独身の方は、注目の相手が思いがけずあなたに興味を示してくれるかもしれませんので、ぜひ注目してみてください！"
    },
    "taurus": {
      "date": "2025-11-18",
      "sign": "Taurus",
      "horoscope": "Your mind is sharp and full of ideas today. You may find yourself channeling your knowledge into a creative endeavor. With your intuition and imagination in high gear, it's an excellent time to kick off that new project you've been contemplating. Just be cautious—it's easy to become so engrossed in your work that other tasks fall by the wayside. Remember to take breaks and maintain a steady pace to avoid exhaustion.",
      "horoscope_ja": "今日は頭が冴え渡り、アイデアが溢れています。知識をクリエイティブな活動に注ぎ込むことができるかもしれません。直感力と想像力がフル回転しているので、ずっと考えていた新しいプロジェクトを始めるには絶好のタイミングです。ただし、仕事に夢中になりすぎて他のタスクがおろそかになりやすいので注意が必要です。疲労を避けるために、適度に休憩を取り、一定のペースを維持するようにしてください。"
    },
    "gemini": {
      "date": "2025-11-18",
      "sign": "Gemini",
      "horoscope": "Today, a heartfelt message or phone call from a dear friend could be the perfect remedy for you. You might be feeling a bit overwhelmed and doubtful about your upcoming plans. However, this friend is likely to boost your mood and inspire you to keep moving forward, no matter the challenges that arise. Cherish this act of kindness, as your friend may also seek your support down the line.",
      "horoscope_ja": "今日、親しい友人からの心のこもったメッセージや電話は、あなたにとって最高の癒しとなるかもしれません。これからの計画に少し圧倒され、不安を感じているかもしれません。しかし、この友人はあなたの気分を高め、どんな困難が訪れても前進し続けるよう鼓舞してくれるでしょう。この親切な行為を大切にしてください。友人もまた、将来あなたのサポートを求めるようになるかもしれません。"
    },
    "cancer": {
      "date": "2025-11-18",
      "sign": "Cancer",
      "horoscope": "Today, you might find yourself brimming with innovative concepts that could propel your career forward and boost your earnings. The key challenge lies in your ability to act on these ideas. While some may prove feasible and others may not, it's essential to conduct some research to discern their viability. If you commit to taking the right actions, the future holds promising possibilities for you.",
      "horoscope_ja": "今日、あなたはキャリアを前進させ、収入を増やす可能性のある革新的なアイデアに溢れているかもしれません。肝心なのは、これらのアイデアを実行に移せるかどうかです。実現可能なものもあれば、そうでないものもありますが、実現可能性を見極めるために調査を行うことは不可欠です。正しい行動を決意すれば、未来は明るい可能性に満ち溢れています。"
    },
    "leo": {
      "date": "2025-11-18",
      "sign": "Leo",
      "horoscope": "Today, you may find yourself flooded with profound spiritual revelations. The clarity of these insights feels undeniable, potentially sparking your creativity in music, poetry, or art. However, be mindful that these fleeting visions can vanish if not captured promptly. Inspiration from beyond can be transient. If you resonate with what you’re experiencing, make sure to jot it down. You’ll appreciate having a record of these moments.",
      "horoscope_ja": "今日、あなたは深遠な霊的啓示に溢れかえっているかもしれません。これらの洞察の明晰さは紛れもなく、音楽、詩、あるいは芸術におけるあなたの創造性を刺激するかもしれません。しかし、これらのつかの間のビジョンは、すぐに捉えなければ消えてしまう可能性があることを忘れないでください。超越的なインスピレーションは一時的なものです。もしあなたが体験していることに共鳴したら、必ず書き留めてください。これらの瞬間を記録しておくことは、きっと大きな喜びとなるでしょう。"
    },
    "virgo": {
      "date": "2025-11-18",
      "sign": "Virgo",
      "horoscope": "Today, you may be pleasantly surprised by some unexpected news about money that you've been eagerly awaiting. This delightful revelation is certainly cause for celebration, even if it feels a bit hard to believe. Embrace the reality—your patience has finally paid off! Just remember to exercise caution and avoid the urge to splurge all at once.",
      "horoscope_ja": "今日は、待ちに待ったお金に関する予期せぬニュースに、嬉しい驚きを感じるかもしれません。少し信じがたいかもしれませんが、この嬉しい知らせはまさに祝うべきものです。現実を受け入れましょう。あなたの忍耐がついに報われたのです！ただし、注意を怠らず、一気に散財したくなる衝動は避けてください。"
    },
    "libra": {
      "date": "2025-11-18",
      "sign": "Libra",
      "horoscope": "Today’s social gathering might reunite you with some dear friends from your past. The atmosphere will be inviting and cheerful, although you might find yourself feeling a bit reserved. That’s perfectly okay! Sometimes, sharing a comfortable silence is more fulfilling than engaging in small talk. Simply relish the company of your beloved friends and pay attention to the conversations around you. You’ll find that this approach enhances your enjoyment.",
      "horoscope_ja": "今日の社交の場では、昔からの親しい友人と再会するかもしれません。雰囲気は明るく、居心地が良いでしょう。でも、少し気後れしてしまうかもしれません。でも、それで全く問題ありません！時には、世間話をするよりも、心地よい沈黙を共有する方が充実感を得られることもあります。ただ、愛する友人たちとの時間を満喫し、周りの会話に耳を傾けてみましょう。そうすれば、きっとより一層の喜びを感じられるはずです。"
    },
    "scorpio": {
      "date": "2025-11-18",
      "sign": "Scorpio",
      "horoscope": "Collaborating with a partner could spark some deep, heartfelt feelings today. Whether these feelings lean towards romance or not, it's wise to take things lightly for now. The current circumstances are fueling these emotions, and they might fade by tomorrow. However, you've likely discovered a companion with whom you can work seamlessly, and that's a significant takeaway!",
      "horoscope_ja": "今日はパートナーとのコラボレーションが、心の奥底から湧き上がる感情を呼び起こすかもしれません。それが恋愛感情に繋がるかどうかはさておき、今は軽く考えておくのが賢明です。今の状況がこれらの感情を煽っており、明日には薄れてしまうかもしれません。しかし、きっとあなたは、共に円滑に仕事ができるパートナーを見つけたのでしょう。これは大きな収穫です！"
    },
    "sagittarius": {
      "date": "2025-11-18",
      "sign": "Sagittarius",
      "horoscope": "Today, you are enveloped in a warm atmosphere of love and romance. Expect to feel a deep connection with your friends, family, and significant other, as bonds strengthen throughout the day. Your creativity and artistic flair are likely to flourish, fueled by the encouragement of those close to you. Any new relationships you cultivate now have the potential for lasting impact. Keep this day in mind during challenging times ahead.",
      "horoscope_ja": "今日は、愛とロマンスに満ちた温かい雰囲気に包まれています。友人、家族、そして大切な人との絆が一日を通して深まり、深い絆を感じることでしょう。身近な人たちの励ましに支えられ、創造性と芸術的な才能が開花するでしょう。今築く新しい人間関係は、きっと長く続く影響を与えるでしょう。これからの困難な時期だからこそ、この日を心に留めておいてください。"
    },
    "capricorn": {
      "date": "2025-11-18",
      "sign": "Capricorn",
      "horoscope": "Today, you may experience powerful intuitive insights regarding friends or family who are not present. These feelings are likely to be uplifting, although they might catch you off guard. If you discover that your instincts were accurate, it could amplify this sensation. This heightened sensitivity is likely to persist for some time, enhancing your ability to connect with the emotions and thoughts of those around you. Embrace this gift and use it to deepen your understanding of others.",
      "horoscope_ja": "今日、あなたは今ここにいない友人や家族について、力強い直感的な洞察を経験するかもしれません。これらの感覚は、あなたを予期せぬ出来事に巻き込むこともあるかもしれませんが、気分を高揚させるものとなるでしょう。もしあなたの直感が正しかったと分かれば、この感覚はさらに強まるかもしれません。この鋭敏な感覚はしばらく続く可能性があり、周囲の人々の感情や思考に共感する能力を高めます。この賜物を大切にし、他者への理解を深めるために活用してください。"
    },
    "aquarius": {
      "date": "2025-11-18",
      "sign": "Aquarius",
      "horoscope": "Today, you may sense a strong wave of affection from someone who piques your romantic interest. This encounter could fill you with a thrilling energy, but your inner skeptic might soon whisper that it’s just a fantasy. While a touch of doubt can be beneficial, don’t allow it to overshadow the uplifting feelings you’re experiencing. The stars indicate that your instincts are spot on. Trust your heart and embrace the moment.",
      "horoscope_ja": "今日、あなたは恋愛対象として興味をそそられる相手から、強い愛情の波を感じるかもしれません。この出会いはあなたを刺激的なエネルギーで満たすかもしれませんが、すぐに内なる懐疑心が、これはただの幻想だとささやくかもしれません。少しの疑念は良い影響をもたらすこともありますが、今感じている高揚感を覆い隠さないようにしてください。星はあなたの直感が正しいことを示しています。自分の心を信じて、この瞬間を楽しみましょう。"
    },
    "pisces": {
      "date": "2025-11-18",
      "sign": "Pisces",
      "horoscope": "Today, your graciousness and polite demeanor could lead to rewarding outcomes. A person who holds you in high regard may present you with a chance to elevate your career and boost your earnings. This individual is likely someone you've known for quite some time, and your collaboration has always been fruitful. Embrace this opportunity with open arms; it’s meant to uplift you, not overwhelm you. Seize the moment, and you’ll find that brighter days lie ahead!",
      "horoscope_ja": "今日、あなたの優しさと丁寧な態度は、報われる結果につながるかもしれません。あなたを高く評価している人が、キャリアアップと収入アップのチャンスをもたらしてくれるかもしれません。その人はおそらく長年の知り合いで、これまでずっと実りある協力関係を築いてきた人でしょう。この機会を両手を広げて受け入れましょう。これはあなたを圧倒するのではなく、元気づけるためのものなのです。この瞬間を掴めば、より明るい未来が待っているでしょう！"
    }
  }
}