{
  "updated_at": "2025-11-18T16:33:55.677Z",
  "jst_date": "2025-11-19",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-19",
      "sign": "Aries",
      "horoscope": "You might find yourself intrigued by unusual stories featured in the news today. This could spark a desire to delve deeper into these narratives and explore related occurrences. Your intellect is keen, allowing you to understand the complexities, but be prepared for some enigmatic aspects that add to the allure. Today, the mysteries of the human psyche, particularly its shadowy facets, may captivate your interest.",
      "horoscope_ja": "今日のニュースで取り上げられている珍しい出来事に興味をそそられるかもしれません。これらの物語を深く掘り下げ、関連する出来事を探りたいという欲求が刺激されるかもしれません。あなたは鋭敏な知性で複雑な事柄を理解することができますが、魅力を増す謎めいた側面にも注意が必要です。今日は、人間の精神の謎、特にその暗い側面に、あなたの興味を惹きつけるかもしれません。"
    },
    "taurus": {
      "date": "2025-11-19",
      "sign": "Taurus",
      "horoscope": "Today, you may find your ambition soaring, inspiring you to hone your writing abilities. Whether you're drawn to technical writing or the creative side, now is the perfect moment to enroll in a course or dive right in. Consider exploring books on the topic and engaging in conversations with seasoned writers to enhance your journey.",
      "horoscope_ja": "今日、あなたの野心は高まり、ライティングスキルを磨きたいという気持ちが湧いてくるかもしれません。テクニカルライティングに興味がある方も、クリエイティブな側面に興味がある方も、今こそコースを受講する、あるいはすぐに飛び込む絶好の機会です。このテーマに関する書籍を読んだり、経験豊富なライターと交流したりして、あなたの道のりを充実させましょう。"
    },
    "gemini": {
      "date": "2025-11-19",
      "sign": "Gemini",
      "horoscope": "Today, an important message or correspondence acts as a catalyst for change. You're on the brink of achieving a significant long-term aspiration. Your drive may evolve, leading you to consider a new career path, whether as a supplement to your current job or as a complete shift. While you may feel uncertain about the direction to take, it's definitely a journey worth exploring.",
      "horoscope_ja": "今日、重要なメッセージや連絡が変化のきっかけとなるでしょう。あなたは長期的な大きな目標を達成しようとしています。あなたの意欲は変化し、現在の仕事の補足として、あるいは完全に方向転換として、新たなキャリアパスを検討するようになるかもしれません。進むべき方向が定まっていないかもしれませんが、それは間違いなく探求する価値のある旅です。"
    },
    "cancer": {
      "date": "2025-11-19",
      "sign": "Cancer",
      "horoscope": "Today, you might receive a message or a phone call from someone who is unwell and stuck in the hospital or at home. This could inspire you to pay them a visit, even if you aren't very familiar with them. Your compassionate side is stirred, urging you to reach out. Make sure to take care of any pressing matters first, and then head over to see this individual. You'll find that it brings you a sense of fulfillment.",
      "horoscope_ja": "今日、体調を崩して病院や自宅待機している人から、メッセージや電話がかかってくるかもしれません。たとえあまり親しくなくても、お見舞いに行ってみたくなるかもしれません。あなたの思いやりの心が刺激され、手を差し伸べたくなる衝動に駆られます。まずは緊急の用事を済ませてから、その人に会いに行きましょう。きっと充実した気持ちになるでしょう。"
    },
    "leo": {
      "date": "2025-11-19",
      "sign": "Leo",
      "horoscope": "Today, you may find yourself spending a significant amount of time responding to messages and calls related to your long-term aspirations or those of a group you belong to. Be prepared to tackle some paperwork, which might be a bit confusing. Don’t hesitate to seek assistance if you find yourself struggling. The topics at hand are crucial, and it’s better to clarify any uncertainties than risk making a mistake.",
      "horoscope_ja": "今日は、あなた自身の長期的な目標や所属するグループからのメッセージや電話に、かなりの時間を費やすことになるかもしれません。書類作成は少し複雑かもしれませんが、その準備を整えておきましょう。もし困ったことがあれば、遠慮なくサポートを受けてください。これらの話題は非常に重要です。ミスをするリスクを冒すよりも、不明な点を明確にしておくことが重要です。"
    },
    "virgo": {
      "date": "2025-11-19",
      "sign": "Virgo",
      "horoscope": "Today could bring a flurry of paperwork your way. Fortunately, your mind is clear and ready to tackle the tasks at hand, even if a few details slip your mind for a moment. Be cautious with messages from neighbors or acquaintances, as they may have hidden motives. It's wise to keep any information you receive to yourself.",
      "horoscope_ja": "今日は書類仕事が山積みになるかもしれません。幸いにも、頭はクリアで、目の前の仕事に取り組む準備ができています。たとえ些細なことで一瞬忘れてしまっても。近所の人や知り合いからのメッセージには注意が必要です。隠された意図があるかもしれません。受け取った情報は、自分の中に留めておくのが賢明です。"
    },
    "libra": {
      "date": "2025-11-19",
      "sign": "Libra",
      "horoscope": "Your efforts and achievements may finally be acknowledged today, bringing you a sense of satisfaction. You're in a positive mindset, brimming with self-assurance and mental resilience. Expect a flurry of messages or phone calls, possibly from distant places. It wouldn't be unusual for you to find yourself engaged in conversations for the majority of the day.",
      "horoscope_ja": "今日、あなたの努力と成果がようやく認められ、満足感が得られるかもしれません。あなたは前向きな気持ちで、自信と精神的な強さに満ち溢れています。メッセージや電話が殺到するでしょう。もしかしたら遠くからかもしれません。一日の大半を会話に費やすことだって珍しくないでしょう。"
    },
    "scorpio": {
      "date": "2025-11-19",
      "sign": "Scorpio",
      "horoscope": "Your curiosity about psychology, especially the realm of dreams, may spark a newfound fascination. You might find yourself eager to gather as much knowledge as possible. The more mysterious aspects of the psyche could draw you in. Today, your memory is sharp, making it easy to retain everything you encounter, including insights on financial trends and strategies to boost your earnings.",
      "horoscope_ja": "心理学、特に夢の世界への好奇心が、新たな魅力を刺激するかもしれません。できるだけ多くの知識を集めたいという気持ちが湧いてくるかもしれません。精神のより神秘的な側面に、あなたは惹きつけられるかもしれません。今日は記憶力が鋭く、金融トレンドに関する洞察や収入増加戦略など、目にするものすべてを記憶しやすいでしょう。"
    },
    "sagittarius": {
      "date": "2025-11-19",
      "sign": "Sagittarius",
      "horoscope": "Today is perfect for brief excursions and deep conversations with your loved one. You might find yourself taking a scenic drive to explore charming boutiques and cozy eateries. Later in the evening, you may receive a puzzling call from someone you know. Their message might feel vague, but anticipate some form of response. Don't hesitate to seek clarification!",
      "horoscope_ja": "今日は、愛する人とちょっとした小旅行や深い話をするのにぴったりの一日です。景色の良いドライブに出かけ、魅力的なブティックや居心地の良いレストランを巡るのもおすすめです。夜遅くには、知り合いから不可解な電話がかかってくるかもしれません。メッセージは漠然としているかもしれませんが、何らかの返答が期待できます。ためらわずに、はっきりとした説明を求めましょう！"
    },
    "capricorn": {
      "date": "2025-11-19",
      "sign": "Capricorn",
      "horoscope": "You may find yourself overwhelmed with a mountain of paperwork, leading to feelings of anxiety and stress. This could even result in some tension headaches. Remember, your health should come first—there's no need to push yourself too hard. If you need to delay certain tasks until tomorrow, it won't derail your progress. Additionally, incoming calls or unexpected visitors might add to your irritation. Consider silencing your phone and letting others know you'll catch up with them later; they'll be understanding.",
      "horoscope_ja": "山積みの書類に圧倒され、不安やストレスを感じてしまうかもしれません。緊張性頭痛を引き起こす可能性もあります。健康が第一であることを忘れないでください。無理をする必要はありません。特定のタスクを明日まで延期する必要がある場合でも、進捗が滞ることはありません。さらに、電話の着信や予期せぬ訪問者がイライラを募らせるかもしれません。携帯電話をサイレントモードにして、後で連絡すると伝えておくことを検討してみてください。きっと理解してくれるでしょう。"
    },
    "aquarius": {
      "date": "2025-11-19",
      "sign": "Aquarius",
      "horoscope": "The concepts you encounter today could spark your creativity, leading you to formulate your own innovative thoughts. Consider jotting these down or discussing them with friends. While some of these ideas may seem a bit vague, you'll find joy in unraveling their mysteries. Additionally, you may find yourself intrigued by the more shadowy aspects of life at this time.",
      "horoscope_ja": "今日出会う概念は、あなたの創造性を刺激し、独自の革新的なアイデアを生み出すきっかけとなるかもしれません。それらを書き留めたり、友人と話し合ったりしてみましょう。これらのアイデアの中には少し漠然としているものもありますが、その謎を解き明かすことに喜びを感じるでしょう。また、この時期は人生のより陰影のある側面に興味をそそられるかもしれません。"
    },
    "pisces": {
      "date": "2025-11-19",
      "sign": "Pisces",
      "horoscope": "Today, the energy of children in your space may awaken your caring side. You might feel inspired to share stories or read to them. However, steer clear of any dark or disturbing tales, as the mood might be a bit heavy, and such themes could have a strong impact on both you and them. As the day winds down, consider organizing a cozy, romantic evening with your partner.",
      "horoscope_ja": "今日、あなたの空間にいる子供たちのエネルギーが、あなたの思いやりの心を目覚めさせるかもしれません。物語を分かち合ったり、読み聞かせをしてあげたりしたくなるかもしれません。ただし、暗い話や不穏な話は避けてください。雰囲気が重くなり、あなたと子供たちの両方に強い影響を与える可能性があります。一日が終わりに近づいたら、パートナーと居心地の良いロマンチックな夜を過ごしてみてはいかがでしょうか。"
    }
  }
}