{
  "updated_at": "2026-02-10T17:07:30.742Z",
  "jst_date": "2026-02-11",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-11",
      "sign": "Aries",
      "horoscope": "Today, Aries, you may find yourself diving into the nitty-gritty of setting up a new business partnership, which could involve a mountain of paperwork. While deciphering the complex terminology might feel like a chore, your determination will shine through as you tackle it head-on. Seek guidance from someone experienced in these matters; their insights could clarify the process for you. This venture holds great potential for you, so keep your spirits up and stay the course!",
      "horoscope_ja": "牡羊座のあなたは今日、新たなビジネスパートナーシップの構築という細部にまで踏み込むことになるかもしれません。膨大な書類が必要になるかもしれません。複雑な用語を解読するのは骨の折れる作業のように感じるかもしれませんが、真正面から取り組むことで、あなたの強い意志が光り輝くでしょう。こうした分野に精通した人にアドバイスを求めましょう。彼らの洞察力によって、プロセスが明確になるかもしれません。この事業はあなたにとって大きな可能性を秘めています。勇気を出して、最後までやり遂げてください！"
    },
    "taurus": {
      "date": "2026-02-11",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find yourself navigating through important legal paperwork related to your business. It could feel overwhelming with all the documents and complex terminology involved. Try not to rush through it; this is a significant task. Seek out someone who has experience with these matters to help clarify any confusion. Once you understand everything and it meets your approval, proceed with the necessary actions and then move forward. The outcomes are likely to be very rewarding!",
      "horoscope_ja": "おうし座のあなたは今日、ビジネスに関わる重要な法的書類の処理に追われることになるかもしれません。膨大な書類と複雑な専門用語に圧倒されるかもしれません。慌てて終わらせないようにしてください。これは重要な仕事です。これらの問題に詳しい人に助けを求め、不明点があれば明確にしましょう。すべてを理解し、納得できたら、必要な手続きを進め、前に進んでください。きっと大きな成果が得られるでしょう！"
    },
    "gemini": {
      "date": "2026-02-11",
      "sign": "Gemini",
      "horoscope": "Gemini, today is a great day to channel your time, energy, and maybe a bit of cash into a creative endeavor. This project might even incorporate some cutting-edge technology. You may find that several coworkers are eager to collaborate with you, making the whole experience quite thrilling. Just remember to keep an eye on the practical aspects; without attention to detail, your brilliant idea might not take flight.",
      "horoscope_ja": "ふたご座さん、今日は時間とエネルギー、そして少しのお金もクリエイティブな取り組みに注ぎ込むのに最適な日です。このプロジェクトには最先端の技術が組み込まれるかもしれません。同僚の何人かがあなたとのコラボレーションに意欲的になり、とても刺激的な体験になるかもしれません。ただし、現実的な側面にも注意を払いましょう。細部への配慮がなければ、素晴らしいアイデアも実現しないかもしれません。"
    },
    "cancer": {
      "date": "2026-02-11",
      "sign": "Cancer",
      "horoscope": "Today, you may find guests arriving at your doorstep, Cancer, likely to chat about work-related matters or a personal project you're nurturing. However, be mindful not to drift into more casual discussions that could distract you from your original purpose. By keeping your attention on the task at hand, you might uncover some unexpectedly positive outcomes.",
      "horoscope_ja": "蟹座のあなたは今日、仕事のことや現在取り組んでいる個人的なプロジェクトについて話し合うゲストがあなたの玄関先に現れるかもしれません。しかし、本来の目的から逸れてしまうような、気楽な話に流れ込まないように注意してください。目の前の仕事に集中することで、思いがけず良い結果が得られるかもしれません。"
    },
    "leo": {
      "date": "2026-02-11",
      "sign": "Leo",
      "horoscope": "Today, Leo, you may find yourself overflowing with ambition, directing a significant amount of your physical and mental energy into your current projects. Whether it's writing, teaching, or public speaking, your enthusiasm is palpable. However, this fervor could leave your body feeling drained while your mind races with a flurry of ideas, albeit a bit disorganized. It’s wise to take a step back and moderate your pace rather than diving in headfirst. Keep your focus sharp!",
      "horoscope_ja": "獅子座さん、今日は野心に溢れ、心身ともにかなりのエネルギーを現在のプロジェクトに注ぎ込んでいるかもしれません。執筆、教育、スピーチなど、あなたの熱意は明らかです。しかし、この熱意が、頭の中でアイデアが次々と湧き上がり、少しまとまりのない状態になる一方で、体を疲れさせてしまうこともあるかもしれません。焦らずに、一歩引いてペースを調整するのが賢明です。集中力を保ちましょう！"
    },
    "virgo": {
      "date": "2026-02-11",
      "sign": "Virgo",
      "horoscope": "A visit from a dear friend or family member is on the horizon, Virgo, prompting you to put in some extra effort to spruce up your home. You might find yourself drawn to splurging on decorative pieces, which can be enjoyable, but proceed with caution! What catches your eye in the store may not translate the same way in your space. Remember, your guest is primarily there to see you, not just your decor. So, embrace the decorating process, but keep it balanced and enjoyable!",
      "horoscope_ja": "おとめ座さん、親しい友人や家族の訪問が近づいています。家の模様替えに少し力を入れたくなるかもしれません。インテリアにお金をかけたくなるかもしれませんが、楽しいものですが、慎重に行いましょう！お店で目に留まったものが、必ずしもあなたの部屋に合うとは限りません。ゲストは、あなたのインテリアを見るためではなく、あなた自身を見るために来ていることを忘れないでください。ですから、デコレーションのプロセスを楽しんでください。ただし、バランスを取りながら、楽しく進めていきましょう！"
    },
    "libra": {
      "date": "2026-02-11",
      "sign": "Libra",
      "horoscope": "Today, Libra, consider the benefits of working from home. You might be feeling both physically and mentally drained from your efforts, yet there are still crucial tasks awaiting your attention. Right now, you may find that you thrive in your own space, free from the hassles of traffic and parking. Your dedication to your work is admirable, but be cautious not to overextend yourself today; pushing too hard could lead to burnout.",
      "horoscope_ja": "天秤座の皆さん、今日は在宅勤務のメリットを考えてみてください。これまでの努力で心身ともに疲れ切っているかもしれませんが、それでもまだ重要な仕事が待っています。今は、交通渋滞や駐車場の煩わしさから解放された、自分だけの空間で、力を発揮できるかもしれません。仕事への献身的な姿勢は素晴らしいですが、今日は無理をしないように気をつけてください。頑張りすぎると燃え尽きてしまう可能性があります。"
    },
    "scorpio": {
      "date": "2026-02-11",
      "sign": "Scorpio",
      "horoscope": "You could hear some news regarding your workplace or colleagues that stirs up uncertainty about your future with the company, Scorpio. It may seem like you're at a standstill, prompting thoughts of switching jobs or even exploring a new career path. An unexpected opportunity might come your way, one that you haven't thought of before. Take some time to reflect on it, but hold off on making any decisions for a few days.",
      "horoscope_ja": "蠍座のあなたは、職場や同僚に関するニュースを耳にし、会社での将来に不安を抱くかもしれません。行き詰まりを感じ、転職や新たなキャリアパスの模索を考えるかもしれません。思いがけないチャンスが訪れるかもしれません。これまで考えたこともなかったようなチャンスです。少し時間をかけてじっくり考えてみましょう。ただし、決断は数日間控えましょう。"
    },
    "sagittarius": {
      "date": "2026-02-11",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may find yourself feeling a bit swamped by financial paperwork. Don't hesitate to reach out to a friend for guidance; they likely have the expertise you need. Even if their explanations seem a bit complex, it's worth paying attention! There could be some financial gains on the horizon, and your imagination might be running wild with ideas on how to spend it. While it's fun to dream big, remember to keep your feet on the ground when that money comes your way!",
      "horoscope_ja": "射手座のあなたは、今日、お金に関する書類仕事に追われて少し疲れているかもしれません。ためらわずに友人に相談してみましょう。きっと必要な専門知識を持っているはずです。説明が少し複雑に思えても、耳を傾ける価値はあります！近いうちに金銭的な利益が舞い込み、その使い道について想像力が膨らむかもしれません。大きな夢を見るのは楽しいですが、お金が舞い込んできたら、地に足のついた行動を忘れないようにしましょう！"
    },
    "capricorn": {
      "date": "2026-02-11",
      "sign": "Capricorn",
      "horoscope": "Capricorn, you may find yourself grappling with some monotonous paperwork for your business that feels like a real hassle at the moment. However, this effort is likely to pay off handsomely in the future. It's important to tap into your natural sense of responsibility to ensure everything gets done properly. Your hard work and commitment are bound to catch the eye of those in power, paving the way for potential advancement. Keep pushing forward!",
      "horoscope_ja": "山羊座のあなたは、仕事で単調な事務作業に追われ、今は本当に面倒に感じているかもしれません。しかし、この努力は将来大きな成果をもたらすでしょう。持ち前の責任感を発揮し、すべてをきちんとやり遂げることが大切です。あなたの努力と献身は、権力者の目に留まり、昇進への道を開くでしょう。これからも前進し続けてください！"
    },
    "aquarius": {
      "date": "2026-02-11",
      "sign": "Aquarius",
      "horoscope": "Aquarius, you may find yourself immersed in a whirlwind of ideas from books, lectures, and various sources touching on spiritual, metaphysical, or religious themes. While the information you encounter is likely to captivate you, it might also leave you feeling a bit dazed and unable to fully grasp it all at this moment. Remember, there's no need to have everything figured out today. Take a step back, engage in a different activity, and allow your thoughts to simmer. Tomorrow, clarity may come rushing in.",
      "horoscope_ja": "水瓶座のあなたは、スピリチュアル、形而上学、宗教といったテーマに触れる書籍や講演、様々な情報源から、次々と湧き上がるアイデアに没頭してしまうかもしれません。目にする情報に魅了される一方で、少しぼんやりとした気分になり、今はまだ全てを理解できないかもしれません。覚えておいてください。今日中に全てを理解する必要はありません。少し立ち止まり、別の活動に取り組んで、思考をじっくりと落ち着かせましょう。明日には、思考が明晰になっていくかもしれません。"
    },
    "pisces": {
      "date": "2026-02-11",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you may find yourself deeply immersed in important business or financial matters that demand your attention to detail. With a deadline looming, it's likely that you'll dedicate a significant portion of your day to managing paperwork. However, be cautious not to let the pursuit of perfection overwhelm you. An excessive focus on the minutiae can inadvertently hinder your progress. Keep your eyes on the prize, but remember to take breaks and maintain a steady pace.",
      "horoscope_ja": "魚座のあなたは今日、細部への注意を要する重要なビジネスや財務問題に没頭するかもしれません。締め切りが迫っているため、書類処理に一日のかなりの時間を費やすことになるでしょう。しかし、完璧さを求めるあまり、圧倒されないように注意しましょう。些細なことにこだわりすぎると、知らず知らずのうちに進歩を妨げてしまう可能性があります。目標を見据えつつ、適度に休憩を取り、一定のペースを維持することを忘れないでください。"
    }
  }
}