{
  "updated_at": "2026-01-17T16:28:46.412Z",
  "jst_date": "2026-01-18",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-18",
      "sign": "Aries",
      "horoscope": "Aries, you tend to be quite aware of how others perceive you, which can sometimes cloud your decision-making, especially in sensitive matters. Today, you might find yourself facing this challenge again. Remember to rely on your own instincts; being assertive in your choices could prove to be more crucial than you realize.",
      "horoscope_ja": "牡羊座のあなたは、他人が自分をどう見ているかを非常に意識する傾向があり、それが時に決断を曇らせることがあります。特にデリケートな問題においてはなおさらです。今日、あなたは再びこの試練に直面するかもしれません。自分の直感を信じることを忘れずに。自分の選択に積極的に取り組むことは、あなたが思っている以上に重要になるかもしれません。"
    },
    "taurus": {
      "date": "2026-01-18",
      "sign": "Taurus",
      "horoscope": "Taurus, you likely find joy in delving deep into the complexities of your own nature. However, today calls for a more logical approach. In your personal sphere, you might sense that you've been outmaneuvered, leaving you feeling vulnerable. Consider using this moment to invite your partner along on one of your introspective journeys.",
      "horoscope_ja": "おうし座のあなたは、自分の本質の複雑さを深く掘り下げることに喜びを感じているようです。しかし、今日はより論理的なアプローチが求められます。個人的な世界では、出し抜かれたと感じ、弱みを感じているかもしれません。この機会に、パートナーを内省の旅に誘ってみてはいかがでしょうか。"
    },
    "gemini": {
      "date": "2026-01-18",
      "sign": "Gemini",
      "horoscope": "Today is a perfect opportunity for you to pause and contemplate the happenings of the last few days, Gemini. Have you been considering making some adjustments to your habits or traits? By dedicating just a few moments each day to examine the nuances of your character, you can facilitate a smoother transition. The energy around you today is conducive to this kind of introspection.",
      "horoscope_ja": "ふたご座のあなたにとって、今日はここ数日の出来事を振り返り、立ち止まってじっくり考える絶好の機会です。自分の習慣や性格に何か変化を起こそうと考えている方はいらっしゃいますか？毎日ほんの少しの時間でも、自分の性格の微妙なニュアンスを見つめ直すことで、よりスムーズな変化を促せるでしょう。今日のあなたの周りのエネルギーは、こうした内省を促すものとなっています。"
    },
    "cancer": {
      "date": "2026-01-18",
      "sign": "Cancer",
      "horoscope": "In recent weeks, Cancer, you've likely made significant strides in articulating your feelings, often without even realizing it! However, be cautious today, as a stubborn individual in your vicinity might attempt to undermine your achievements. Remember, managing your emotions is not the same as stifling them. It's essential for you to safeguard the advancements you've accomplished.",
      "horoscope_ja": "蟹座のあなたは、ここ数週間、自分の気持ちをうまく表現できるようになってきているのではないでしょうか。しかも、気づかないうちに！しかし、今日は用心が必要です。あなたの周囲にいる頑固な人が、あなたの成果を台無しにしようとするかもしれません。感情をコントロールすることは、抑え込むことと同じではないことを忘れないでください。これまで成し遂げてきた進歩を守ることが、あなたにとっては不可欠です。"
    },
    "leo": {
      "date": "2026-01-18",
      "sign": "Leo",
      "horoscope": "Today may present some hurdles, Leo, but don’t fret; you have the strength to navigate through them. The celestial alignments are urging you to start building the groundwork for the initiatives you've been contemplating for the past half-year. Embrace the journey. While some may perceive you as someone who ignites passion but struggles to maintain it, now is your chance to show them your true potential!",
      "horoscope_ja": "獅子座さん、今日はいくつかハードルが立ちはだかるかもしれませんが、心配しないでください。あなたには乗り越える力があります。天体の配置は、この半年、あなたが考えてきた取り組みの土台を築き始めるよう促しています。この旅路を楽しみましょう。あなたは情熱を燃やすけれど、それを維持するのが苦手だと思われているかもしれませんが、今こそあなたの真の潜在能力を示すチャンスです！"
    },
    "virgo": {
      "date": "2026-01-18",
      "sign": "Virgo",
      "horoscope": "Today, you might discover an exceptional knack for getting things done. Your efforts seem to yield remarkable results, but you could feel as though you're lacking in some areas of self-sufficiency. What’s your response? A shopping spree might seem like the answer! However, Virgo, it’s wise to reflect on this tendency of yours. The allure of retail therapy could be strong today, but you may regret it when the credit card statement arrives!",
      "horoscope_ja": "今日、あなたは物事を成し遂げる並外れた才能を発見するかもしれません。努力は目覚ましい成果を生み出しているように見えますが、自給自足の面で何かが欠けているように感じるかもしれません。どう対処しますか？ 買い物三昧が解決策のように思えるかもしれません！しかし、乙女座のあなたは、この傾向についてよく考えてみることをお勧めします。今日は買い物セラピーへの誘惑が強いかもしれませんが、クレジットカードの明細書が届いた時に後悔するかもしれません！"
    },
    "libra": {
      "date": "2026-01-18",
      "sign": "Libra",
      "horoscope": "Today, you might notice that those in your circle are carrying a heavier demeanor than normal, Libra. You may feel tempted to escape their seriousness, perhaps by retreating to a movie theater for a little solitude. However, you might not find the film that captures your interest. Instead of trying to evade the weight of the present, be mindful that you could end up adopting an even more somber attitude than those you wish to distance yourself from.",
      "horoscope_ja": "てんびん座さん、今日は周りの人たちが普段より重苦しい雰囲気になっていることに気づくかもしれません。映画館に少し一人で行って、彼らの真面目さから逃れたいと思うかもしれません。しかし、あなたの興味を引く映画は見つからないかもしれません。現状の重苦しさから逃げようとするのではなく、距離を置きたいと思っている人たちよりも、あなた自身がさらに重苦しい態度をとってしまう可能性があることに気を付けましょう。"
    },
    "scorpio": {
      "date": "2026-01-18",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you might sense a heavy energy surrounding you. It's the perfect moment to confront those significant issues you've been sidestepping for a while. Pay particular attention to your home life and consider how you can shift the negative vibes that have crept in recently. While finding a middle ground can be beneficial, ensure that it doesn't compromise your core values and beliefs.",
      "horoscope_ja": "蠍座のあなたは、今日、周囲に重苦しいエネルギーを感じるかもしれません。しばらく避けてきた重大な問題に立ち向かう絶好の機会です。特に家庭生活に注意を払い、最近忍び寄ってきたネガティブな雰囲気をどう変えられるか考えてみましょう。妥協点を見つけることは有益ですが、それがあなたの根本的な価値観や信念を損なわないよう注意してください。"
    },
    "sagittarius": {
      "date": "2026-01-18",
      "sign": "Sagittarius",
      "horoscope": "As a Sagittarius, you possess a remarkable talent for navigating complex ideas and applying your analytical prowess to tackle challenges. If this resonates with you, it's likely that others have pointed out that while contemplation is valuable, there comes a time to translate those thoughts into action! The current planetary alignment encourages you to reflect on this important transition.",
      "horoscope_ja": "射手座のあなたは、複雑な考えを巧みに捉え、分析力を活かして課題に立ち向かう素晴らしい才能を持っています。もしこの言葉に共感するなら、熟考は大切ですが、その考えを行動に移すべき時が来ることを、周りの人から指摘されているかもしれません。現在の惑星の配置は、この重要な転換期についてじっくり考えることを促しています。"
    },
    "capricorn": {
      "date": "2026-01-18",
      "sign": "Capricorn",
      "horoscope": "Today marks the start of an exhilarating chapter in your personal life, Capricorn. It's the perfect moment to embrace fresh starts in your relationship. You might find yourself prepared to implement the changes that you and your partner have been contemplating for a while. Whether it's moving in together, renovating your home, purchasing a summer getaway, or even expanding your family, now is the time to lay the groundwork for plans that reflect the strength and stability of your bond.",
      "horoscope_ja": "山羊座のあなたにとって、今日は人生における刺激的な章の始まりです。二人の関係に新たなスタートを切るには絶好のタイミングです。パートナーとしばらく考えていた変化を実行する準備が整ったと感じるかもしれません。同棲、家のリフォーム、夏の別荘の購入、あるいは家族を増やすなど、二人の絆の強さと安定性を反映する計画の土台を築くには、今がまさにその時です。"
    },
    "aquarius": {
      "date": "2026-01-18",
      "sign": "Aquarius",
      "horoscope": "Aquarius, if you've been facing challenges in your relationship or love life, today may not bring the relief you seek. Those around you might perceive you as quite irritable, and it could feel like every little comment is grating on your nerves. Even the affectionate words from your partner might come off as insincere. However, don’t worry; your mood will be understood, and remember, not every day can match the level of passion and affection you desire.",
      "horoscope_ja": "水瓶座のあなた、もしあなたが恋愛や人間関係で困難に直面しているなら、今日はあなたが求めているような安らぎを得られそうにありません。周りの人からあなたはかなりイライラしているように思われ、些細な言葉一つ一つがあなたの神経を逆なでするように感じてしまうかもしれません。パートナーからの愛情のこもった言葉でさえ、不誠実に受け取られてしまうかもしれません。でも、心配しないでください。あなたの気持ちはきっと理解されます。そして、毎日があなたが望む情熱と愛情のレベルに匹敵するわけではないことを覚えておいてください。"
    },
    "pisces": {
      "date": "2026-01-18",
      "sign": "Pisces",
      "horoscope": "Today is likely to be quite an academic day for you, Pisces, though it may feel more like hard work. Embrace the effort, as you thrive on productivity, and you'll find yourself tackling everything on your plate. It's an excellent opportunity to focus on those aspects of your life that require a bit more nurturing to truly flourish—think of the relationships that are still finding their footing.",
      "horoscope_ja": "魚座のあなたにとって、今日は勉強に励む一日になりそうです。ただし、むしろハードワークのように感じるかもしれません。生産性を重視するあなたは、努力を惜しみません。そうすれば、目の前の課題にすべて取り組むことができるでしょう。人生において、真に成長するためにもう少し努力が必要な側面に焦点を当てる絶好の機会です。例えば、まだ軌道に乗っていない人間関係などを考えてみてください。"
    }
  }
}