{
  "updated_at": "2026-02-03T16:59:25.603Z",
  "jst_date": "2026-02-04",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-04",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might feel a wave of frustration towards a close friend or partner who doesn't share your drive and ambition. The current energy amplifies your relentless pursuit of goals and success, making it hard to relate to those who are more hesitant or laid-back. Remember, everyone has their own unique approach to achieving their dreams. Exercise some patience and understanding.",
      "horoscope_ja": "牡羊座のあなたは今日、あなたの情熱や野心を共有してくれない親しい友人やパートナーに対して、強いフラストレーションを感じるかもしれません。今のエネルギーは、目標と成功への飽くなき追求を増幅させ、ためらいがちだったりのんびりとした人との共感を難しくしているかもしれません。誰もが夢を実現するための独自のアプローチを持っていることを忘れないでください。忍耐と理解を示しましょう。"
    },
    "taurus": {
      "date": "2026-02-04",
      "sign": "Taurus",
      "horoscope": "Today is a great opportunity for you, Taurus, to tap into the positive connections you have with friends and family to organize some group activities. You're likely to be in high spirits, making the idea of socializing particularly enticing. Consider hosting a dinner or a card game at your place. If you're feeling especially energetic, engaging in some sports could be the perfect way to get active and enjoy the outdoors. Embrace the chance to have fun and breathe in some fresh air today!",
      "horoscope_ja": "おうし座のあなたにとって、今日は友人や家族との良好な関係を活かしてグループ活動を企画する絶好の機会です。気分も高揚し、社交的な交流が特に魅力的になるでしょう。自宅でディナーやカードゲームを主催してみてはいかがでしょうか。特にエネルギーに満ち溢れているなら、スポーツに取り組んで体を動かし、アウトドアを楽しむのも良いでしょう。今日は楽しい時間を過ごし、新鮮な空気を吸い込みましょう！"
    },
    "gemini": {
      "date": "2026-02-04",
      "sign": "Gemini",
      "horoscope": "Gemini, if you haven't been keeping up with a consistent workout regimen, today presents the perfect opportunity to change that. Remember, staying active doesn't have to be exhausting or painful. Gentle activities such as walking or yoga can be fantastic for your well-being. Consider engaging in a sport you enjoy, like volleyball or bowling, which blends enjoyment with fitness. And don't forget, dancing is also a wonderful way to get moving! Explore options that resonate with you and make them part of your routine.",
      "horoscope_ja": "ふたご座さん、もしあなたがこれまで一貫した運動習慣を身につけていなかったなら、今日はそれを変える絶好の機会です。アクティブでいるということは、必ずしも疲れたり痛みを感じたりする必要はないことを覚えておいてください。ウォーキングやヨガなどの軽い運動は、健康にとても良い効果をもたらします。バレーボールやボーリングなど、楽しみとフィットネスを両立できる、好きなスポーツに挑戦してみてはいかがでしょうか。そして、ダンスもまた、体を動かす素晴らしい方法であることもお忘れなく！自分に合った方法を見つけて、ルーティンの一部に取り入れてみてください。"
    },
    "cancer": {
      "date": "2026-02-04",
      "sign": "Cancer",
      "horoscope": "Today is the perfect day to channel your ambition into tangible actions, Cancer. With the current planetary influences, you’re likely to feel a surge of energy and optimism. Seize this opportunity to move closer to your aspirations. Remember, without taking initiative, your dreams will remain just that—dreams. Time flies, and you don’t want to find yourself years from now pondering the ‘what ifs.’ Have faith in your abilities and take the necessary steps forward. Every journey begins with that first step.",
      "horoscope_ja": "蟹座のあなた、今日はあなたの野心を具体的な行動に移すのに最適な日です。現在の惑星の影響で、エネルギーと楽観主義が湧き上がるでしょう。この機会を捉えて、あなたの夢に一歩近づきましょう。自発的に行動しなければ、あなたの夢はただの夢のままです。時は過ぎていきます。何年も経ってから「もしも」と悩むのは避けたいものです。自分の能力を信じ、必要な一歩を踏み出しましょう。すべての旅は、その最初の一歩から始まります。"
    },
    "leo": {
      "date": "2026-02-04",
      "sign": "Leo",
      "horoscope": "Leo, today is the day to dive into new projects or set your plans in motion without second-guessing yourself. You'll find that your heightened energy levels pair beautifully with your knack for organization, equipping you to manage just about anything that comes your way. To maintain your focus, jot down your objectives and strategies. If you feel inspired to do some tidying up, take the opportunity to part with items that have been gathering dust. Think about donating them to charity; there are certainly people who would benefit from what you no longer need.",
      "horoscope_ja": "レオ座さん、今日は新しいプロジェクトに飛び込んだり、計画を実行に移したりするのに最適な日です。エネルギーレベルが高まり、整理整頓の才能と相まって、どんなことでもうまくこなせるようになるでしょう。集中力を維持するために、目標と戦略をメモしておきましょう。片付けたい気分になったら、埃をかぶっているものを手放す機会にしましょう。不要になったものは、慈善団体に寄付することも検討してみてください。きっと、あなたが不要になったものから恩恵を受ける人がいるはずです。"
    },
    "virgo": {
      "date": "2026-02-04",
      "sign": "Virgo",
      "horoscope": "Today is looking bright for you, Virgo! You’re likely to experience a surge of energy and a fresh outlook, particularly regarding your professional endeavors. Harness this momentum by tackling those lingering projects or sprucing up your workspace. Trust in your ability to manage any task that comes your way with ease. Once you’ve checked everything off your to-do list, don’t forget to carve out some time for relaxation and fun—you’ve earned it!",
      "horoscope_ja": "おとめ座さん、今日は明るい一日になりそうです！特に仕事に関しては、エネルギーが湧き上がり、新たな展望が開けるでしょう。この勢いを活かして、滞っているプロジェクトに取り組んだり、仕事場を整理したりしてみましょう。どんな仕事でも楽々とこなせる自信があります。ToDoリストの項目をすべてクリアしたら、リラックスしたり、楽しい時間を過ごしたりする時間も忘れずに確保しましょう。あなたはそれに値するのですから！"
    },
    "libra": {
      "date": "2026-02-04",
      "sign": "Libra",
      "horoscope": "Libra, today is a day brimming with creativity and ambition for you! Consider harnessing this vibrant energy to dive into an artistic endeavor. Alternatively, you could redirect that enthusiasm towards tidying up your home or workspace. With a little planning, you can easily find time to indulge in both pursuits. Seize the day and make it count!",
      "horoscope_ja": "天秤座さん、今日は創造性と野心に溢れる一日です！この活力あるエネルギーを活かして、芸術的な活動に没頭してみてはいかがでしょうか。あるいは、その情熱を家や仕事場の整理整頓に向けるのも良いでしょう。少し計画を立てれば、両方の活動に没頭する時間を簡単に見つけられるでしょう。今日という日を大切に過ごしましょう！"
    },
    "scorpio": {
      "date": "2026-02-04",
      "sign": "Scorpio",
      "horoscope": "Prepare to rise and shine, Scorpio! You may awaken today brimming with vitality and an abundance of energy. This is an excellent opportunity to dive into any tasks that call for a bit of physical effort. Whether it’s tackling some outdoor chores or rearranging your living space, your strength will be on your side. On a lighter note, consider hitting the gym for a workout or taking a refreshing swim. No matter what you choose to do, seize the day and make the most of your energetic vibe!",
      "horoscope_ja": "蠍座のあなた、さあ、目覚めて輝こう！今日は活力とエネルギーに満ち溢れた朝を迎えるかもしれません。少し体を動かす作業に没頭する絶好の機会です。屋外での雑用でも、リビングの模様替えでも、あなたの力はきっと味方してくれるでしょう。もっと気楽な時間を過ごしたいなら、ジムでワークアウトしたり、爽やかなスイミングを楽しんだりしてみてはいかがでしょうか。何をするにしても、今日という日を大切に、あなたのエネルギッシュなエネルギーを最大限に活かしましょう！"
    },
    "sagittarius": {
      "date": "2026-02-04",
      "sign": "Sagittarius",
      "horoscope": "The current planetary alignments are set to shake off any sluggishness you've been experiencing, Sagittarius. Today is perfect for stepping outside and engaging in some physical activity. Whether it's a brisk walk, a run, or a hike, you'll find that these activities will channel your energy and spark your creativity. Embracing the outdoors and getting your body moving will greatly benefit your well-being, so seize the opportunity. And remember, even if work calls today, there's always time to unwind and enjoy your evening.",
      "horoscope_ja": "射手座の皆さん、現在の惑星の配置は、あなたがこれまで感じていた倦怠感を吹き飛ばしてくれそうです。今日は外に出て体を動かすのにぴったりの日です。早歩き、ランニング、ハイキングなど、どんな運動でもエネルギーを発散させ、創造性を刺激してくれるでしょう。屋外で体を動かすことは、心身の健康に大きく貢献しますので、この機会を逃さず掴みましょう。そして、今日は仕事で忙しいとしても、リラックスして夜を楽しむ時間は必ずあります。"
    },
    "capricorn": {
      "date": "2026-02-04",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today is the perfect day to focus on your health and well-being. You may rise with a burst of energy and vitality, so make the most of it by engaging in activities that enhance your positive mood. Remember to nurture not just your physical health, but also your emotional and spiritual well-being. If possible, spend some time outdoors soaking up the sun and fresh air, reflecting on the areas of your life that could benefit from a little extra attention. Whether it's taking a stroll, tending to a garden, or diving into a creative project that gets you moving, embrace the chance to invigorate both body and mind.",
      "horoscope_ja": "山羊座のあなた、今日は健康と幸福に意識を向けるのに最適な日です。朝からエネルギーと活力がみなぎってくるかもしれません。ポジティブな気分を高める活動に取り組んで、この機会を最大限に活用しましょう。身体の健康だけでなく、感情面、精神的な健康も大切にしましょう。可能であれば、屋外で太陽の光と新鮮な空気を浴びながら、生活の中で少し意識を向けることで改善できる点についてじっくり考えてみましょう。散歩をしたり、庭の手入れをしたり、体を動かすクリエイティブなプロジェクトに没頭したり、心身ともにリフレッシュするチャンスを大切にしましょう。"
    },
    "aquarius": {
      "date": "2026-02-04",
      "sign": "Aquarius",
      "horoscope": "Aquarius, if you've been eyeing a creative or artistic item that seems out of reach financially, why not try your hand at making it yourself? You might be surprised by your own creativity, even if you don't see yourself as an artist. There are plenty of online resources designed for beginners that can provide the guidance and encouragement you need. Don't underestimate your potential. Dive into this opportunity and discover a new creative outlet that could be just right for you.",
      "horoscope_ja": "水瓶座さん、もしあなたがクリエイティブな作品や芸術的な作品に憧れていて、経済的に手が届かないと思っているなら、自分で作ってみてはいかがでしょうか？たとえ自分がアーティストだとは思っていなくても、自分の創造性に驚くかもしれません。初心者向けのオンラインリソースは数多くあり、必要なガイダンスや励ましを与えてくれます。自分の可能性を過小評価しないでください。この機会に飛び込んで、あなたにぴったりの新たな創作の場を見つけてください。"
    },
    "pisces": {
      "date": "2026-02-04",
      "sign": "Pisces",
      "horoscope": "Today is an ideal day for you to step outside, Pisces! You'll probably feel a surge of positivity and energy, making it a great time to soak up some fresh air, sunshine, and engage in physical activity that you might have been missing. Even if you have work commitments, seize the chance to enjoy your breaks and lunch by taking a stroll. Later in the evening, consider gathering with friends for a coffee or to catch a favorite sports game.",
      "horoscope_ja": "うお座のあなたにとって、今日は外に出るのに最適な日です！きっとポジティブな気持ちとエネルギーが湧き上がってくるでしょう。新鮮な空気と太陽の光を浴び、普段なかなかできない運動をするのに最適な時間です。仕事の予定があっても、休憩時間やランチタイムにはぜひ散歩に出かけて、楽しい時間を過ごしましょう。夜遅くには、友人と集まってコーヒーを飲んだり、お気に入りのスポーツ観戦をしたりしてみてはいかがでしょうか。"
    }
  }
}