{
  "updated_at": "2025-12-26T16:30:02.848Z",
  "jst_date": "2025-12-27",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-27",
      "sign": "Aries",
      "horoscope": "Today, you might find it challenging to kick things off. If progress feels slow, try not to lose heart. It’s possible that your aspirations are set too high, and your quest for perfection could be making it tough for others to meet your expectations. Remember, it’s okay to let go of the small stuff. You don’t need to strive for perfection.",
      "horoscope_ja": "今日は、何かを始めるのが大変だと感じるかもしれません。もし進捗が遅いと感じても、諦めないでください。もしかしたら、あなたの目標が高すぎるのかもしれません。完璧を求めるあまり、周りの人があなたの期待に応えられなくなっているのかもしれません。小さなことは気にしなくていいのです。完璧を目指す必要はありません。"
    },
    "taurus": {
      "date": "2025-12-27",
      "sign": "Taurus",
      "horoscope": "Today, focus on maintaining your politeness and avoid overstepping boundaries with others. It's crucial to act with civility in every situation. Some individuals might feel wronged, and while you may not be the cause of their frustration, you could still experience the fallout. Make sure to distinguish your own concerns from theirs, and don't allow their unease to affect your peace.",
      "horoscope_ja": "今日は、礼儀正しさを保ち、他人との境界線を越えないように心がけましょう。どんな状況でも礼儀正しく振る舞うことは重要です。中には不当な扱いを受けたと感じる人もいるかもしれません。たとえあなたが彼らのフラストレーションの原因ではないとしても、その影響を被る可能性はあります。自分の不安と相手の不安を区別し、相手の不安に左右されないようにしましょう。"
    },
    "gemini": {
      "date": "2025-12-27",
      "sign": "Gemini",
      "horoscope": "Today, resist the urge to point fingers at others. Embrace the maturity that comes with owning your choices. Remember, life doesn’t always unfold as you wish, and it’s essential to accept both the ups and downs. The day carries a serious tone that may challenge your usual outlook. Keep your focus sharp and maintain your discipline.",
      "horoscope_ja": "今日は、他人を責めたくなる衝動を抑えましょう。自分の選択に責任を持つことで得られる成熟を受け入れましょう。人生は常に思い通りにはいかないことを忘れないでください。良い時も悪い時も受け入れることが大切です。今日は、いつもの考え方を揺るがすような深刻な日です。集中力を保ち、規律を守りましょう。"
    },
    "cancer": {
      "date": "2025-12-27",
      "sign": "Cancer",
      "horoscope": "Today, you may find it necessary to take a firm stance to achieve your desired outcomes. When interacting with others, avoid jumping to conclusions without solid evidence. People can be quite sensitive, so focus on sticking to the facts. Aim to keep emotions in check and avoid igniting any intense feelings.",
      "horoscope_ja": "今日は、望む結果を得るためには、毅然とした態度を取る必要があるかもしれません。人と接する際には、確固たる証拠もなく結論を急がないようにしてください。人は繊細なので、事実に忠実に従うようにしましょう。感情をコントロールし、激しい感情を煽らないようにしましょう。"
    },
    "leo": {
      "date": "2025-12-27",
      "sign": "Leo",
      "horoscope": "Today, you might sense that your drive is lacking. It feels as though you're not quite running on the right energy. You may find it challenging to connect with your emotions, as they could be misleading you. Try to stay grounded and not let this energy disrupt your equilibrium. Things will start to improve from this point onward.",
      "horoscope_ja": "今日は、やる気が足りないと感じるかもしれません。まるで正しいエネルギーで動けていないように感じるかもしれません。感情に惑わされ、うまくコントロールできないかもしれません。地に足をつけ、このエネルギーに心のバランスを崩されないようにしてください。この時点から、物事は好転し始めるでしょう。"
    },
    "virgo": {
      "date": "2025-12-27",
      "sign": "Virgo",
      "horoscope": "Today, you may experience a sense of emotional restraint. There's a lot on your mind that you want to express, yet you might feel a twinge of reluctance to voice it. It's natural to feel a bit anxious, which could hinder your ability to communicate effectively. Be prepared for conversations that may lack depth and be more about surface-level chatter.",
      "horoscope_ja": "今日は、感情的な束縛を感じるかもしれません。心の中には表現したいことがたくさんあるのに、それを口に出すことに少し抵抗を感じるかもしれません。少し不安を感じるのは自然なことで、それが効果的なコミュニケーション能力を妨げる可能性があります。会話に深みがなく、表面的なおしゃべりばかりになる可能性もあるので、覚悟しておきましょう。"
    },
    "libra": {
      "date": "2025-12-27",
      "sign": "Libra",
      "horoscope": "Today, you may find your motivation lacking. However, it's crucial to tackle that daunting list of tasks, regardless of your feelings. Acknowledge the limitations imposed by time. By focusing on completing one small task at a time with discipline, you'll transform that overwhelming mountain into a manageable hill.",
      "horoscope_ja": "今日はモチベーションが足りないと感じるかもしれません。しかし、どんな気持ちであっても、膨大なタスクリストに取り組むことが重要です。時間という制約を認識しましょう。規律を持って、小さなタスクを一つずつクリアすることに集中することで、圧倒的な山を、こなせる丘へと変えることができるでしょう。"
    },
    "scorpio": {
      "date": "2025-12-27",
      "sign": "Scorpio",
      "horoscope": "Today is likely to be quite hectic for you, making it an ideal moment to tackle your tasks. You’re experiencing a strong sense of discipline that will aid your concentration. While emotions might be subdued, this can actually play to your benefit. Stick to the facts and avoid letting minor problems escalate into dramatic situations, as this will allow your work to flow much more smoothly.",
      "horoscope_ja": "今日はかなり忙しくなりそうなので、仕事に取り組むには絶好の機会です。強い規律が集中力を高めてくれます。感情が抑えられているかもしれませんが、それはむしろプラスに働くかもしれません。事実に忠実に従い、小さな問題が劇的な事態に発展しないようにすれば、仕事はよりスムーズに進むでしょう。"
    },
    "sagittarius": {
      "date": "2025-12-27",
      "sign": "Sagittarius",
      "horoscope": "Today, you might find it challenging to tap into your feelings. It’s best to avoid pretending to be upbeat if you’re not genuinely feeling that way. Embrace honesty with yourself about your emotional state. If you’re experiencing restlessness or negativity, it’s okay to keep those feelings private. Consider taking a stroll, especially by a body of water, and treat yourself to a nutritious meal.",
      "horoscope_ja": "今日は、自分の感情に向き合うのが難しいかもしれません。本当にそう感じていないのなら、楽観的なふりをするのは避けた方が良いでしょう。自分の感情の状態を正直に受け止めましょう。落ち着かなかったり、ネガティブな気持ちになったりしているなら、その感情を表に出さなくても大丈夫です。散歩に出かけたり、特に水辺で散歩したり、栄養価の高い食事をとったりしてみてはいかがでしょうか。"
    },
    "capricorn": {
      "date": "2025-12-27",
      "sign": "Capricorn",
      "horoscope": "Today, consider giving yourself a well-deserved break to recharge emotionally. You might find yourself overly involved in the dramas of others, leaving your own worries feeling neglected and exhausting. It's important to take a step back and find some peace, both physically and mentally. Stressing too much over a particular problem can be counterproductive, potentially complicating things further. Allow yourself the space to revisit the issue later with a clearer mind.",
      "horoscope_ja": "今日は、感情をリフレッシュするために、自分にふさわしい休息を取ることを検討してみてください。他人のドラマに巻き込まれすぎて、自分の悩みが疎かになり、疲れ果ててしまうこともあるかもしれません。少し距離を置いて、心身ともに安らぎを見つけることが大切です。特定の問題に過度にストレスを感じると逆効果になり、事態をさらに複雑にする可能性があります。後で、より冷静な気持ちでその問題に立ち返れるように、自分に余裕を持たせましょう。"
    },
    "aquarius": {
      "date": "2025-12-27",
      "sign": "Aquarius",
      "horoscope": "Today, your emotions might run deeper than normal, especially in your professional life. It's important to try to separate your feelings from your daily tasks. If a particular job starts to feel too heavy and affects your performance, it could be a signal that adjustments are necessary. This period brings increased sensitivity, so focus on maintaining your balance.",
      "horoscope_ja": "今日は、特に仕事において、普段より感情が激しく揺れ動くかもしれません。日々の仕事と感情を切り離すことが大切です。もし特定の仕事が重荷に感じられ、パフォーマンスに影響が出始めたら、それは調整が必要だというサインかもしれません。この時期は感受性が増す時期なので、バランスを保つことに集中しましょう。"
    },
    "pisces": {
      "date": "2025-12-27",
      "sign": "Pisces",
      "horoscope": "Today, many individuals may find themselves reluctant to confront their deeper emotional challenges. They are building walls to shield themselves from potentially painful experiences. It's important to honor these personal boundaries. Focus on staying grounded in your own inner peace. Even if the overall atmosphere feels heavy, strive to maintain an optimistic outlook.",
      "horoscope_ja": "今日、多くの人が自分の心の奥底にある感情的な課題に向き合うことをためらっているかもしれません。彼らは、痛みを伴う可能性のある経験から身を守るために壁を築いています。こうした個人的な境界線を尊重することが大切です。自分の心の平穏に根ざし続けることに集中しましょう。たとえ全体の雰囲気が重苦しく感じられたとしても、楽観的な見通しを維持するよう努めましょう。"
    }
  }
}