{
  "updated_at": "2025-11-14T16:31:39.824Z",
  "jst_date": "2025-11-15",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-15",
      "sign": "Aries",
      "horoscope": "You might sense that someone is hitting you with an emotional blow today. Instead of instinctively shielding yourself, take a moment to pause and reflect on the circumstances before jumping to any judgments. Your emotions are valuable, and it's important not to allow anyone to push you around. However, remember that it's equally important to treat others with respect and not to impose your feelings on them.",
      "horoscope_ja": "今日は誰かから感情的な打撃を受けていると感じるかもしれません。本能的に自分を守ろうとするのではなく、少し立ち止まって状況をよく考え、すぐに判断を下す前に考えてみてください。あなたの感情は大切なものです。誰にも振り回されないことが大切です。しかし、他人を尊重すること、そして自分の感情を押し付けないことも同様に大切です。"
    },
    "taurus": {
      "date": "2025-11-15",
      "sign": "Taurus",
      "horoscope": "Today, you might sense a dip in your energy levels, leading you to question the value of your current pursuits. But don’t lose hope! A supportive friend is on the way to help reignite your motivation. Once you get that boost, you’ll be unstoppable. Remember, it’s perfectly okay to reach out for assistance; others won’t realize you need a hand unless you let them know.",
      "horoscope_ja": "今日は、エネルギーレベルが低下しているように感じ、今取り組んでいることの価値に疑問を抱くかもしれません。でも、希望を失わないでください！支えてくれる友人が、あなたのモチベーションを再び燃え上がらせてくれます。その刺激があれば、あなたは誰にも止められない存在になるでしょう。助けを求めるのは全く問題ありません。あなたが助けを求めない限り、周りの人はあなたが助けを必要としていることに気づきません。"
    },
    "gemini": {
      "date": "2025-11-15",
      "sign": "Gemini",
      "horoscope": "Take a moment to reflect on your current pursuits. If your goal is to find joy and relaxation, you might be overlooking the opportunities right in front of you. The enjoyment you crave is available now; seize it instead of holding out for a future moment when you think you've truly earned it.",
      "horoscope_ja": "少し時間を取って、今の自分の追求について考えてみましょう。もしあなたの目標が喜びとリラクゼーションを見つけることだとしたら、目の前にあるチャンスを見逃しているかもしれません。あなたが切望する喜びは今、手に入ります。本当に手に入れられると思った瞬間まで待つのではなく、今こそ掴みましょう。"
    },
    "cancer": {
      "date": "2025-11-15",
      "sign": "Cancer",
      "horoscope": "Embrace the strength that comes from navigating between two conflicting sides. Initially, it might feel like betrayal to support one while aiding the other. However, this dual perspective is ultimately beneficial for you, as it allows you to grasp the nuances of both viewpoints. Extract the finest traits from each side. When you're ready to assemble your own team, you'll possess all the insights required for triumph.",
      "horoscope_ja": "相反する二つの側面の間を渡り歩くことで得られる強さを受け入れましょう。最初は、一方を支持しながらもう一方を助けるのは裏切りのように感じるかもしれません。しかし、この二重の視点は、両方の視点のニュアンスを理解できるようになるため、最終的にはあなたにとって有益です。それぞれの側面から最良の特性を引き出しましょう。自分のチームを編成する準備ができた時には、勝利に必要な洞察力をすべて備えているでしょう。"
    },
    "leo": {
      "date": "2025-11-15",
      "sign": "Leo",
      "horoscope": "Your adaptable spirit shines brightly today. While those around you may also be open to change, this is your moment to step into a leadership role. Picture yourself at the starting line, poised and ready for action. Don’t hold back, waiting for others to make the first move. Stay alert and aware; the moment you hear the signal to go, dash forward with all your energy!",
      "horoscope_ja": "今日は、あなたの順応性精神が輝いています。周りの人々も変化を受け入れているかもしれませんが、今こそあなたがリーダーシップを発揮する時です。スタートラインに立ち、準備万端で行動を起こす自分を想像してみてください。周りの人が先に行動を起こすのを待つのではなく、常に油断せずに、常に意識を高く持ちましょう。「スタート」の合図が聞こえた瞬間、全力で突き進みましょう！"
    },
    "virgo": {
      "date": "2025-11-15",
      "sign": "Virgo",
      "horoscope": "You possess a remarkable ability to change your life for the better. Although it might not appear that way, numerous opportunities are at your fingertips. The primary hurdle you face is your emotional mindset. Right now, your feelings may be heightened, leading to uncertainty about taking the crucial steps needed for your growth.",
      "horoscope_ja": "あなたは人生をより良い方向に変えることができる素晴らしい能力を持っています。そうは思えないかもしれませんが、多くのチャンスがすぐそこにあります。あなたが直面する最大のハードルは、感情的な考え方です。今は感情が高ぶっていて、成長に必要な重要な一歩を踏み出すことに不安を感じているかもしれません。"
    },
    "libra": {
      "date": "2025-11-15",
      "sign": "Libra",
      "horoscope": "You might feel like the universe is pushing you off course today. Even though your heart is set on heading south, the winds are urging you to veer west. Don't let this discourage you from pursuing your dreams. Instead, consider adjusting your strategy; sometimes a lateral move is exactly what you need to reach your desired destination. Embrace this unconventional path, as it could lead you to your own slice of paradise.",
      "horoscope_ja": "今日は宇宙があなたを進路から外そうとしているように感じるかもしれません。心は南へ向かおうと決めているのに、風は西へ向かうように促しています。だからといって夢の追求を諦めないでください。むしろ、戦略の見直しを検討してみてください。時には、横方向への動きこそが、まさに望む目的地に到達するために必要なことなのです。型破りな道を進んでみてください。それが、あなただけの楽園へと導いてくれるかもしれません。"
    },
    "scorpio": {
      "date": "2025-11-15",
      "sign": "Scorpio",
      "horoscope": "Today, you might find it challenging to feel self-assured due to powerful influences around you. Your desire to uphold your independence could lead you to stand your ground even when it might be wise to compromise. Take a moment to reflect on the other perspective before becoming too rigid in your stance. Remember, encountering resistance doesn't automatically mean your viewpoint is incorrect.",
      "horoscope_ja": "今日は、周囲の強い影響力のせいで、自信を持つことが難しいかもしれません。独立心を保ちたいという気持ちが、妥協すべき状況でも自分の主張を曲げてしまう原因になるかもしれません。自分の立場を固持しすぎる前に、少し時間を取って相手の視点をじっくり考えてみましょう。抵抗に遭ったからといって、必ずしも自分の見方が間違っているわけではないことを忘れないでください。"
    },
    "sagittarius": {
      "date": "2025-11-15",
      "sign": "Sagittarius",
      "horoscope": "Embrace a more flexible mindset today. Allow yourself to flow with the current and let situations evolve based on the solid groundwork you've laid. You may be clinging to a familiar comfort, a worn-out security blanket that brings you solace. The idea of parting with it may be daunting, but it's time to release it and recognize that you can thrive without that extra weight holding you back.",
      "horoscope_ja": "今日、より柔軟な考え方を取り入れましょう。流れに身を任せ、これまで築いてきた確固たる基盤に基づいて状況が変化するのも当然です。もしかしたら、慣れ親しんだ心地よさ、すり切れた安心感にしがみついているのかもしれません。それを手放すのは気が重いかもしれませんが、今こそそれを手放し、その重荷に縛られることなく、成長できると認識する時です。"
    },
    "capricorn": {
      "date": "2025-11-15",
      "sign": "Capricorn",
      "horoscope": "While circumstances may seem to be pulling you in different directions, there's value in each experience you encounter. Embracing a variety of options is perfectly fine. Some prefer to focus on a single pursuit, but you thrive by juggling multiple interests. Stay true to your approach and don’t let anyone pressure you into altering your strategy, especially if you feel that your current path is yielding positive results.",
      "horoscope_ja": "状況によって様々な方向へ導かれているように見えるかもしれませんが、経験の一つ一つに価値があります。様々な選択肢を受け入れることは全く問題ありません。一つのことに集中することを好む人もいますが、あなたは複数の興味を両立させることで力を発揮します。自分のアプローチを貫き、特に現在のやり方が良い結果をもたらしていると感じている場合は、誰にも戦略を変えるよう圧力をかけられてはいけません。"
    },
    "aquarius": {
      "date": "2025-11-15",
      "sign": "Aquarius",
      "horoscope": "Be mindful of the power your words carry today; they can resonate deeply. The atmosphere calls for everyone to have the liberty to voice their thoughts. Grant them this space, or you might find yourself trapped with no way out. Think of it like painting a room: begin at the far end and move toward the exit, rather than the reverse.",
      "horoscope_ja": "今日、あなたの言葉が持つ力に意識を向けてください。言葉は深く響き渡ります。誰もが自由に自分の考えを表明できる環境が求められています。彼らにその余裕を与えなければ、出口のない罠に陥ってしまうかもしれません。部屋の塗装に例えてみましょう。部屋の奥から始めて、出口に向かって進むのではなく、逆から始めるのです。"
    },
    "pisces": {
      "date": "2025-11-15",
      "sign": "Pisces",
      "horoscope": "No matter which path you take, you possess the inner strength to navigate it, so let go of any indecision. Others will be easily influenced by your charm. Your composed and diplomatic demeanor has the power to soothe even the most intense conflicts. Take the time to tackle the matters at hand. Trust in your choices and actions. Don't let the negative opinions of others weigh you down.",
      "horoscope_ja": "どの道を選ぶにせよ、あなたはそれを乗り越える力強さを秘めています。ですから、迷いは捨ててください。周りの人はあなたの魅力に簡単に心を動かされるでしょう。落ち着きがあり外交的な態度は、どんなに激しい対立さえも和らげる力を持っています。目の前の問題にじっくりと取り組みましょう。自分の選択と行動を信じてください。他人の否定的な意見に惑わされないでください。"
    }
  }
}