{
  "updated_at": "2025-12-25T16:31:42.461Z",
  "jst_date": "2025-12-26",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-26",
      "sign": "Aries",
      "horoscope": "When you let go of the fantasy of possessing superhuman abilities, you'll find a sense of relief. Remember, you're not a superhero, and neither is anyone else. However, you do possess unique talents that you've utilized before, yet you may currently believe they hold little value. It's time to reassess this perspective.",
      "horoscope_ja": "超人的な能力を持つという幻想を手放すと、安堵感が得られるでしょう。覚えておいてください、あなたはスーパーヒーローではありませんし、誰もそうではありません。しかし、あなたはこれまで活用してきた独自の才能を持っているにもかかわらず、今はそれらの価値をあまり感じていないかもしれません。今こそ、この視点を再考する時です。"
    },
    "taurus": {
      "date": "2025-12-26",
      "sign": "Taurus",
      "horoscope": "Now is not the time to cling to any specific belief system, no matter what it is. You might find yourself feeling a bit lost and unsure about which direction to pursue, but this uncertainty is actually beneficial for you. Keep exploring with your small light, even if it feels dim, as this journey will help you regain a strong sense of faith. The best part? It will be a faith that is uniquely suited to you.",
      "horoscope_ja": "今は、どんな信仰体系であれ、特定の信仰に固執する時ではありません。少し迷い、どの方向に進むべきか分からなくなるかもしれませんが、この不確実性はむしろあなたにとって有益なものです。たとえ薄暗く感じても、小さな光で探求を続けてください。この旅は、あなたに強い信仰心を取り戻す力を与えてくれるでしょう。そして何より素晴らしいのは、それはあなたにぴったりの信仰となることです。"
    },
    "gemini": {
      "date": "2025-12-26",
      "sign": "Gemini",
      "horoscope": "Now is not the time to let things unravel, especially after all the progress you've made. You might be facing a challenging phase, as it feels like the moment has arrived for you to demonstrate your true capabilities. However, this is not a signal to throw in the towel. Prioritize rest, engage in physical activities, and nourish your body with healthy food. You have the potential to overcome this struggle, but it's essential to allow yourself the chance to succeed.",
      "horoscope_ja": "今は、特にここまでの進歩を遂げてきた今、物事をほったらかしにしている場合ではありません。真の能力を発揮する時が来たように感じ、困難な時期に直面しているかもしれません。しかし、これは諦める合図ではありません。休息を最優先し、身体活動に取り組み、健康的な食事で体を養いましょう。あなたにはこの困難を乗り越える力がありますが、成功へのチャンスを自分に与えることが重要です。"
    },
    "cancer": {
      "date": "2025-12-26",
      "sign": "Cancer",
      "horoscope": "Feeling a bit down? You're not alone in this. Reach out to a friend or catch a film to lift your spirits. It's important to stay active and engage in activities that can help you shake off this low mood. Now is not the time to withdraw. There's some personal reflection needed, even if it feels like it’s going in circles. You might sense a feeling of isolation, but deep down, you know that's not the reality.",
      "horoscope_ja": "少し落ち込んでいますか？そんな気持ちはあなただけではありません。友達に連絡を取ったり、映画を見に行ったりして気分を高めましょう。活動的な姿勢を保ち、この憂鬱な気分を吹き飛ばすのに役立つ活動に参加することが大切です。今は引きこもっている時ではありません。堂々巡りのように感じても、少し自分を振り返る必要があります。孤独感を感じるかもしれませんが、心の奥底ではそれが現実ではないと分かっています。"
    },
    "leo": {
      "date": "2025-12-26",
      "sign": "Leo",
      "horoscope": "Today, you'll find yourself truly in your zone. The cosmos encourages you to step outside your comfort zone and explore new perspectives. Instead of becoming a mere observer of various viewpoints, consider crafting a more meaningful philosophy that reflects your insights. After all, what value does it hold to understand all angles of a situation if you can't transform that understanding into something tangible?",
      "horoscope_ja": "今日、あなたは真に自分のゾーンにいることに気づくでしょう。宇宙は、あなたがコンフォートゾーンから抜け出し、新しい視点を探求するよう促しています。様々な視点をただ観察するのではなく、あなたの洞察を反映した、より意義深い哲学を作り上げることを検討してください。結局のところ、状況をあらゆる角度から理解したとしても、それを具体的な形に変えることができなければ、何の価値があるでしょうか？"
    },
    "virgo": {
      "date": "2025-12-26",
      "sign": "Virgo",
      "horoscope": "Today, and for the past few days, you may have been accumulating some internal stress without a way to release it. This has left you feeling a bit on edge. If someone dares to criticize you or your efforts, you might find yourself reacting explosively. A tempest is on the horizon! Do your best to navigate through it.",
      "horoscope_ja": "今日、そしてここ数日、あなたはストレスを溜め込み、それを発散する方法が見つからないかもしれません。そのため、少し神経質になっているかもしれません。誰かがあなたやあなたの努力を批判しようとしたら、爆発的に反応してしまうかもしれません。嵐が近づいています！それを乗り越えるために最善を尽くしてください。"
    },
    "libra": {
      "date": "2025-12-26",
      "sign": "Libra",
      "horoscope": "You've arrived at a pivotal moment with a significant choice ahead of you. The toughest aspect of this decision is bidding adieu to your familiar habits. The past may feel warm and comforting, particularly when faced with uncertainty. It requires courage and resolve to move on. However, whether in your professional journey or romantic endeavors, your personal aspirations are too important to overlook or compromise.",
      "horoscope_ja": "あなたは今、重大な選択を迫られる重要な局面を迎えています。この決断で最も難しいのは、慣れ親しんだ習慣に別れを告げることです。特に不確実な状況に直面している時は、過去は温かく心地よく感じられるかもしれません。前に進むには勇気と決意が必要です。しかし、仕事であれ恋愛であれ、あなたの個人的な願望は見落としたり妥協したりできないほど重要です。"
    },
    "scorpio": {
      "date": "2025-12-26",
      "sign": "Scorpio",
      "horoscope": "Clouds of uncertainty are gathering on your horizon. Recent choices regarding your romantic life may be causing you some frustration, leaving you feeling hesitant. It's essential today to tap into your inner strength and self-discipline to confront your challenges head-on and overcome your fears.",
      "horoscope_ja": "不確実性の雲があなたの地平線上に立ち込めています。恋愛に関する最近の選択が、あなたにフラストレーションを与え、ためらいを感じさせているかもしれません。今日は、内なる強さと自制心を発揮し、課題に正面から立ち向かい、恐怖を克服することが不可欠です。"
    },
    "sagittarius": {
      "date": "2025-12-26",
      "sign": "Sagittarius",
      "horoscope": "Today, the atmosphere feels quite dense and stifling. You may encounter a few letdowns, especially if you're in a position where you need to demonstrate your worth, whether at work or in your personal life. There's a chance you might find yourself feeling frustrated with someone close to you. However, try not to let those negative emotions take over too swiftly, as it could dampen your spirits.",
      "horoscope_ja": "今日は、空気が重苦しく、息苦しく感じられます。特に仕事でもプライベートでも、自分の価値を示さなければならない立場にいる場合は、落胆することもあるでしょう。身近な人にフラストレーションを感じてしまう可能性もあります。しかし、ネガティブな感情にすぐに支配されてしまうと、気分が落ち込んでしまうので、注意が必要です。"
    },
    "capricorn": {
      "date": "2025-12-26",
      "sign": "Capricorn",
      "horoscope": "Recently, you've committed to a path of diligence, aiming for stability and adhering closely to your plans. However, prepare for an unexpected twist today. You might encounter news that disrupts your carefully laid out agenda or meet individuals who seem intent on undermining your efforts. It's crucial to rise above these challenges; otherwise, they may take control.",
      "horoscope_ja": "最近、あなたは勤勉な道を歩み、安定を目指し、計画を忠実に守ってきました。しかし、今日は予期せぬ展開に備えましょう。綿密に立てた計画を台無しにするようなニュースに遭遇したり、あなたの努力を妨害しようとする人物に出会ったりするかもしれません。これらの困難を乗り越えることが不可欠です。さもなければ、困難が彼らを支配してしまうかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-26",
      "sign": "Aquarius",
      "horoscope": "You might experience some unease regarding what lies ahead today. Your energy could feel diminished, particularly if you're facing a looming deadline. Embrace challenges as they are essential for you to showcase your capabilities. This is the perfect moment to start focusing on your fitness. Remember, self-doubt can hinder your progress. You have all the tools you need to achieve your goals!",
      "horoscope_ja": "今日は、これから何が起こるのか不安に感じるかもしれません。特に締め切りが迫っている場合は、エネルギーが枯渇しているように感じるかもしれません。挑戦はあなたの能力を発揮するために不可欠なので、積極的に受け入れましょう。今こそ、フィットネスに集中し始める絶好の機会です。自己不信は進歩を妨げる可能性があることを忘れないでください。目標を達成するために必要なツールはすべて揃っています！"
    },
    "pisces": {
      "date": "2025-12-26",
      "sign": "Pisces",
      "horoscope": "Today, the notion of self-expression might feel a bit absurd. Have you taken a moment to ponder what it truly means to express yourself? This is a perfect opportunity to reflect on this, particularly if you have creative aspirations. Focus solely on what resonates with you. Avoid any pressure to conform. In essence, let your self-expression be a personal journey, not one dictated by others.",
      "horoscope_ja": "今日、「自己表現」という概念は、少しばかげているように感じられるかもしれません。自分を表現することの真の意味について、少し考えてみましたか？特にクリエイティブな志を持つ方にとっては、まさにこの機会にじっくり考えてみてください。心に響くものだけに集中しましょう。周囲に合わせようとするプレッシャーは避けましょう。つまり、自己表現は他人に押し付けられるものではなく、自分自身の旅路であるべきです。"
    }
  }
}