{
  "updated_at": "2025-11-12T16:33:04.474Z",
  "jst_date": "2025-11-13",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-13",
      "sign": "Aries",
      "horoscope": "Today, your drive to compete could play a significant role in your endeavors. Before letting your emotions take over, rely on reason and solid evidence to support your stance. Articulating your points with clarity and precision will yield better results than an outburst fueled by feelings and harsh language.",
      "horoscope_ja": "今日、競争心はあなたの努力において重要な役割を果たすかもしれません。感情に流される前に、理性と確固たる証拠に基づいて自分の立場を裏付けましょう。感情に突き動かされた激しい言葉よりも、自分の主張を明確かつ正確に伝える方が、より良い結果をもたらすでしょう。"
    },
    "taurus": {
      "date": "2025-11-13",
      "sign": "Taurus",
      "horoscope": "Gaining clarity on your path becomes simpler when you assertively define your current stance and your future aspirations. If you remain indecisive and laid-back about your next steps, you might find others exploiting your uncertainty. Remember, you possess the strength and determination to manifest your wishes. Now is the moment to take action and bring them to life.",
      "horoscope_ja": "自分の現在のスタンスと将来の願望を明確に定義すれば、進むべき道を明確にすることはより容易になります。もしあなたが次のステップについて優柔不断で気楽なままでいるなら、あなたの不確実性につけこまれてしまうかもしれません。あなたには、自分の願いを叶えるための力と決意があることを忘れないでください。今こそ、行動を起こし、願いを叶える時です。"
    },
    "gemini": {
      "date": "2025-11-13",
      "sign": "Gemini",
      "horoscope": "You're on the brink of a significant milestone. Keep pushing forward! Now is the moment to accelerate and pick up the pace even more than you have been. Your feelings might feel a bit scattered as they intertwine with your vivid daydreams. Focus on the path ahead rather than dwelling on the past. Remember, you can always adjust your direction once you cross this finish line.",
      "horoscope_ja": "重要な節目を迎えようとしています。前進を続けましょう！今こそ、これまで以上に加速し、ペースを上げる時です。鮮明な空想と感情が交錯し、少し散漫になっているかもしれません。過去にとらわれるのではなく、目の前の道に集中しましょう。ゴールラインを越えたら、いつでも方向転換できることを忘れないでください。"
    },
    "cancer": {
      "date": "2025-11-13",
      "sign": "Cancer",
      "horoscope": "Now is an opportune moment to strike a balance between your practical needs and your yearning for emotional liberation. Nurturing your mental well-being requires you to trust in your dreams and your capacity to turn them into reality. Today, a unique opportunity awaits you, tailored just for you.",
      "horoscope_ja": "今こそ、現実的なニーズと精神的な解放への憧れのバランスを取る絶好の機会です。心の健康を育むには、自分の夢とそれを実現できる能力を信じることが必要です。今日、あなただけのために作られた、特別な機会があなたを待っています。"
    },
    "leo": {
      "date": "2025-11-13",
      "sign": "Leo",
      "horoscope": "You may discover support in surprising corners today, so keep an open mind about those around you. Even the harshest comments can carry a hint of compassion and forward-thinking ideas that could be beneficial. Embracing emotional honesty can be powerful, even if it’s not what you want to hear. While some truths may be difficult to accept, they often lead to growth and healing.",
      "horoscope_ja": "今日は思いがけないところで支えを見つけられるかもしれません。周りの人に対して、常にオープンな心を持ちましょう。どんなに厳しい言葉でも、思いやりや前向きなアイデアが垣間見え、役立つかもしれません。たとえ聞きたくない言葉であっても、感情的な正直さを受け入れることは力強いものです。受け入れるのが難しい真実もあるかもしれませんが、それらはしばしば成長と癒しへと繋がります。"
    },
    "virgo": {
      "date": "2025-11-13",
      "sign": "Virgo",
      "horoscope": "Today, you might find it challenging to focus on anything for long. Your thoughts could wander off easily, and you may feel a bit impatient when faced with various situations. Try to hold off on sharing your opinions until others have finished expressing theirs. By showing courtesy and respect to those around you, you’ll likely receive the same in return.",
      "horoscope_ja": "今日は何かに長く集中するのが難しいかもしれません。考えがすぐにさまよい、様々な状況に直面すると少し焦りを感じるかもしれません。他の人が意見を言い終わるまで、自分の意見を述べるのは控えましょう。周りの人に礼儀と敬意を示すことで、あなたも同じように返ってくるでしょう。"
    },
    "libra": {
      "date": "2025-11-13",
      "sign": "Libra",
      "horoscope": "You find yourself guarding a precious aspect of your being from the outside world. This hidden gem within you, which you tend to with such care, is likely your most exquisite quality. It's important not to relinquish this part of yourself too readily. Reserve this pure and tender space for someone truly worthy.",
      "horoscope_ja": "あなたは、自分の大切な一面を外の世界から守っていることに気づきます。あなたが大切に守ってきた、あなたの内に秘めた宝石は、おそらくあなたの最も美しい資質でしょう。この部分を安易に手放さないことが大切です。この純粋で優しい空間を、真に価値のある人のために取っておきましょう。"
    },
    "scorpio": {
      "date": "2025-11-13",
      "sign": "Scorpio",
      "horoscope": "Today, you might just surprise those who view you as a bit of a dreamer when it comes to making choices and sticking to commitments. Expect a shift in perspective as others begin to understand your viewpoint. It seems that everything is aligning perfectly, just as you anticipated. Those who were skeptical of your approach will likely find themselves impressed by your insights.",
      "horoscope_ja": "今日は、決断を下したり約束を守り通したりすることに関して、あなたを少し夢想家だと思っている人たちを驚かせるかもしれません。周りの人たちがあなたの視点を理解し始めるにつれて、視点が変わるでしょう。あなたの予想通り、すべてが完璧に順調に進んでいるようです。あなたのアプローチに懐疑的だった人たちも、あなたの洞察力に感銘を受けるでしょう。"
    },
    "sagittarius": {
      "date": "2025-11-13",
      "sign": "Sagittarius",
      "horoscope": "You might struggle to establish a sense of stability, both mentally and physically. Your thoughts could feel hazy or caught in a whimsical daydream, so tread carefully as you move forward. Your focus seems to be elsewhere, and you may not be fully aware of what lies ahead. Take a detour from the fast lane and allow your imagination to roam in a safe space.",
      "horoscope_ja": "精神的にも肉体的にも、安定感を得るのに苦労するかもしれません。思考がぼんやりしたり、気まぐれな白昼夢に囚われたりしているかもしれません。慎重に前進してください。集中力がどこか別のところに向いていて、これから何が起こるのか完全には理解できていないかもしれません。高速道路から少し外れて、安全な場所で想像力を自由に羽ばたかせましょう。"
    },
    "capricorn": {
      "date": "2025-11-13",
      "sign": "Capricorn",
      "horoscope": "You have a passion for sustainability, both at home and in your workplace. Embrace the role of a solution-maker by tidying up after yourself and ensuring you leave no trace behind. As environmental issues grow increasingly pressing, remember that every individual has the power to contribute to positive change.",
      "horoscope_ja": "あなたは家庭でも職場でも、持続可能性への情熱を持っています。後片付けをきちんと行い、痕跡を残さないよう心がけることで、解決策を生み出す人としての役割を担ってください。環境問題がますます深刻化する中、一人ひとりが前向きな変化に貢献する力を持っていることを忘れないでください。"
    },
    "aquarius": {
      "date": "2025-11-13",
      "sign": "Aquarius",
      "horoscope": "You might find yourself feeling irritated by individuals who project an image of sensitivity and honesty, yet behave in a harsh and confrontational manner. Be cautious not to be misled by those who consistently present one facade while revealing another. Stay vigilant and don’t squander your energy on giving people more opportunities than they truly merit.",
      "horoscope_ja": "繊細で誠実な印象を与えながら、実際には厳しく対立的な態度を取る人に、イライラしてしまうことがあるかもしれません。常に表面的な面と裏の面を見せる人に惑わされないように注意しましょう。常に警戒を怠らず、人に本来持つべき以上の機会を与えることにエネルギーを浪費しないようにしましょう。"
    },
    "pisces": {
      "date": "2025-11-13",
      "sign": "Pisces",
      "horoscope": "Today is a great day to connect with others and share your dreams for the future. Engage in conversations about the aspirations you hope to see realized in the years ahead. Your feelings are deeply intertwined with your creative visions, so be mindful that you might feel a bit protective if someone challenges your dreams. Rely on your intellect to stand your ground and advocate for the values and ideals you aspire to embody.",
      "horoscope_ja": "今日は、人と繋がり、将来の夢を共有する絶好の日です。これから実現したい夢について、積極的に話し合ってみましょう。あなたの感情は創造的なビジョンと深く結びついています。ですから、誰かがあなたの夢に異議を唱えると、少しばかり自己防衛的な気持ちになってしまうかもしれません。知性を頼りに、自分の立場を貫き、体現したい価値観や理想を主張しましょう。"
    }
  }
}