{
  "updated_at": "2026-02-19T07:46:14.130Z",
  "jst_date": "2026-02-19",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-19",
      "sign": "Aries",
      "horoscope": "You might feel the urge to escape from an emotional situation with a family member today, Aries. Embrace that feeling; it could be exactly what you need to gain clarity and mend your spirit before re-engaging with them. Additionally, you may uncover some unsettling truths about yourself and past wounds that you thought were behind you. Allow these realizations to surface without resistance; just let them go.",
      "horoscope_ja": "牡羊座のあなたは、今日、家族との感情的な状況から逃げ出したくなるかもしれません。その気持ちを受け入れてください。彼らと再び関わる前に、心の整理をつけ、心を癒すために必要なものかもしれません。さらに、自分自身や、乗り越えたと思っていた過去の傷について、不安な真実が明らかになるかもしれません。これらの気づきを、抵抗せずに表面化させ、ただ手放しましょう。"
    },
    "taurus": {
      "date": "2026-02-19",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find that lingering emotional matters from your past are holding you back. Your sensitivity might be heightened, leading you to perceive slights that aren't really there. It's important to resist the urge to take things personally. Instead, focus on acknowledging and letting go of these old wounds, or at the very least, commit to addressing them in the future. In the meantime, shower your loved ones with kindness. By the end of the day, you should notice a shift towards a more uplifting mood.",
      "horoscope_ja": "おうし座のあなたは、今日、過去の感情的な問題があなたを阻んでいることに気づくかもしれません。感受性が高まり、実際には存在しない軽蔑をも感じ取ってしまうかもしれません。物事を個人的な問題として捉える衝動を抑えることが重要です。むしろ、これらの古い傷を認め、手放すことに集中しましょう。少なくとも、将来的には対処することを約束しましょう。その間、愛する人たちに優しさを注いでください。一日の終わりには、気分がより明るくなっていることに気づくはずです。"
    },
    "gemini": {
      "date": "2026-02-19",
      "sign": "Gemini",
      "horoscope": "Gemini, you might find yourself facing some tension or challenges at work that could tempt you to throw in the towel. However, financial concerns may hold you back from making that leap. It's a good time to take a step back and evaluate your current circumstances. A shift in your role could be exactly what you need right now. You may possess hidden skills that could enhance your appeal in the job market, so consider honing those abilities. Reflect on your desires, and if a change truly calls to you, don’t hesitate to pursue it!",
      "horoscope_ja": "ふたご座のあなたは、仕事で緊張や課題に直面し、諦めてしまいたくなるかもしれません。しかし、経済的な不安が決断を阻むかもしれません。少し立ち止まって、現状を見つめ直す良い機会です。役割を変えることは、まさに今、あなたに必要なことかもしれません。もしかしたら、あなたは就職活動で魅力を高める隠れたスキルを持っているかもしれません。そのスキルを磨くことを検討してみてください。自分の願望をじっくりと見つめ直し、本当に変化を求めているなら、ためらわずに進んでください！"
    },
    "cancer": {
      "date": "2026-02-19",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you might find your self-esteem taking a hit. Old mistakes may resurface, leading to a nagging fear of repeating them. It's important to take a step back and view the situation with clarity to avoid spiraling into anxiety. Remember, you possess unique abilities and talents that distinguish you from others. Embrace your individuality and don’t let past missteps overshadow your worth.",
      "horoscope_ja": "蟹座のあなたは、今日、自尊心が傷ついているかもしれません。過去の過ちが再び浮かび上がり、同じ過ちを繰り返すのではないかという不安に苛まれるかもしれません。不安に陥らないためには、一歩引いて状況を冷静に見つめることが大切です。あなたは他の人とは違う、独自の能力と才能を持っていることを忘れないでください。自分の個性を受け入れ、過去の失敗に惑わされないでください。"
    },
    "leo": {
      "date": "2026-02-19",
      "sign": "Leo",
      "horoscope": "As a Leo, you're typically someone who thrives on physical activity, but today invites you to turn your gaze inward. This could be a perfect time to explore your intuitive side or delve into spiritual teachings. You may also discover a heightened appreciation for artistic expressions, especially those rooted in diverse cultures. Expect to be more reflective than normal; jotting down your insights could lead to some profound revelations.",
      "horoscope_ja": "獅子座のあなたは、普段は身体活動で活力を得るタイプですが、今日は内省を深める良い機会です。直感的な側面を探ったり、スピリチュアルな教えを深く探求したりするのに最適な時期かもしれません。また、芸術的表現、特に多様な文化に根ざした表現への理解が深まるかもしれません。普段よりも内省的になり、自分の洞察を書き留めることで、深い発見が生まれるかもしれません。"
    },
    "virgo": {
      "date": "2026-02-19",
      "sign": "Virgo",
      "horoscope": "Virgo, it seems that financial factors might hold up the launch of a long-anticipated project. You may find yourself short on funds or facing unexpected expenses. However, there's no need to feel disheartened; this is merely a short-lived setback. Consider adjusting your budget and exploring alternatives. Tap into your natural creativity to navigate these challenges, and you'll find that your project can still stay on track.",
      "horoscope_ja": "おとめ座さん、長らく待ち望んでいたプロジェクトの立ち上げが、経済的な問題で遅れるかもしれません。資金不足に陥ったり、予期せぬ出費に直面したりするかもしれません。しかし、落ち込む必要はありません。これは一時的な後退に過ぎません。予算を調整し、代替案を検討してみてください。持ち前の創造性を発揮してこれらの課題を乗り越えれば、プロジェクトは軌道に乗ることができるでしょう。"
    },
    "libra": {
      "date": "2026-02-19",
      "sign": "Libra",
      "horoscope": "Today, Libra, you might find yourself amidst some intriguing drama. It seems that certain members of your circle, especially the women, could be engaging in some secretive chatter. While your interest will surely be piqued, resist the urge to dive into their discussions. Remember, there's more beneath the surface than what appears, so it's wise to gather all the information before forming any opinions. Focus on your own pursuits and set aside the gossip for now!",
      "horoscope_ja": "天秤座のあなたは、今日、興味深いドラマに巻き込まれるかもしれません。あなたの周りの特定のメンバー、特に女性が、秘密の会話をしているかもしれません。きっと興味をそそられるでしょうが、彼らの会話に飛び込みたくなる衝動を抑えてください。表面上に見える以上のことが隠されていることを忘れないでください。ですから、意見を述べる前に、あらゆる情報を収集することが賢明です。今は自分のやりたいことに集中し、ゴシップは脇に置いておきましょう！"
    },
    "scorpio": {
      "date": "2026-02-19",
      "sign": "Scorpio",
      "horoscope": "As a Scorpio, your natural intuition is heightened today, leading to a surge of psychic insights. You may find that reflections on your own personality bring past wounds to light, allowing for healing and release. Expect your dreams to be particularly striking and perhaps a bit unsettling, but not in a harmful way—make sure to jot them down! Additionally, your appreciation for beauty is amplified, so you might find yourself drawn to Impressionist art more than usual.",
      "horoscope_ja": "蠍座のあなたは、今日、生まれ持った直感が研ぎ澄まされ、霊的な洞察が湧き上がってきます。自分の性格を振り返ることで、過去の傷が明るみに出たり、癒やしや解放がもたらされたりするかもしれません。夢は特に印象的で、少し不安を感じるかもしれませんが、決して悪い意味ではありません。必ずメモを取ってください。さらに、美への感性が深まるので、いつも以上に印象派の芸術に惹かれるかもしれません。"
    },
    "sagittarius": {
      "date": "2026-02-19",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, your thoughts are swirling around love and intimacy. You're brimming with passion, and your feelings run deep. While it's natural to focus on your own desires, remember to be attuned to your partner's needs too. You may find yourself drawn to steamy books and films, and the idea of exploring some enticing lingerie might cross your mind. Embrace it!",
      "horoscope_ja": "射手座のあなた、今日は愛と親密さについて考えが渦巻いているでしょう。情熱が溢れ、感情は深く揺さぶられます。自分の欲望に集中するのは自然なことですが、パートナーのニーズにも耳を傾けることを忘れないでください。官能的な本や映画に惹かれたり、魅力的なランジェリーを探してみたくなったりするかもしれません。その気持ちを受け入れてください！"
    },
    "capricorn": {
      "date": "2026-02-19",
      "sign": "Capricorn",
      "horoscope": "A relative might be experiencing some low spirits today, Capricorn, and while you might feel inclined to offer some motivational words, it’s best to hold back. They may not be receptive, and this could lead to unnecessary friction at home. Additionally, your self-esteem might be wavering right now. You often judge yourself harshly, and today that tendency is heightened. Remember to extend kindness not just to others, but also to yourself.",
      "horoscope_ja": "山羊座のあなた、今日は親戚が元気がないかもしれません。励ましの言葉をかけたい気持ちは分かりますが、控えた方が良いでしょう。相手は耳を傾けてくれず、家庭内で不必要な摩擦が生じる可能性があります。また、今、あなたの自尊心は揺らいでいるかもしれません。あなたはしばしば自分を厳しく批判しますが、今日はその傾向がさらに強まっています。他人だけでなく、自分自身にも優しく接することを忘れないでください。"
    },
    "aquarius": {
      "date": "2026-02-19",
      "sign": "Aquarius",
      "horoscope": "Aquarius, be mindful of how much time you spend with books, newspapers, and screens today, as it might lead to some eye strain and headaches. Take care when dealing with fine print or digital text. Your mind may wander to matters of the heart, which could distract you from your tasks. You might find yourself wanting to chat on the phone more than usual. It's perfectly normal to have days like this, so embrace it! Just ensure you’re in good spirits by the time evening arrives!",
      "horoscope_ja": "水瓶座のあなた、今日は本や新聞、スクリーンを見る時間に注意しましょう。目の疲れや頭痛につながる可能性があります。細かい文字やデジタルテキストを見る際は特に注意しましょう。恋愛関係のことに心が奪われ、仕事に集中できなくなるかもしれません。いつもより電話で話したくなるかもしれません。でも、こういう日があっても全く普通のことなので、受け入れましょう！夕方までに気分を良くしておきましょう！"
    },
    "pisces": {
      "date": "2026-02-19",
      "sign": "Pisces",
      "horoscope": "As a natural empath, Pisces, you possess an extraordinary talent for understanding the thoughts and intentions of others, even without deep familiarity. Today, this gift transcends mere psychology and ventures into the realm of the intuitive. You might find yourself acutely aware of the emotions swirling around you. Even the headlines in the news could spark profound insights about what lies ahead. Additionally, prepare for some strikingly vivid dreams that may carry significant messages. Be sure to jot down the symbols you encounter in your dreams; their meanings may astonish you.",
      "horoscope_ja": "生まれながらの共感力を持つ魚座のあなたは、たとえ深い親交がなくても、他人の考えや意図を理解する並外れた才能を持っています。今日、この才能は単なる心理学の域を超え、直感の領域へと踏み込みます。あなたは、周囲に渦巻く感情を鋭く認識しているかもしれません。ニュースの見出しさえも、これから起こることへの深い洞察を呼び起こすかもしれません。さらに、重要なメッセージを伝える、驚くほど鮮明な夢を見るかもしれません。夢の中で出会ったシンボルは必ず書き留めてください。その意味に、きっとあなたは驚くでしょう。"
    }
  }
}