{
  "updated_at": "2026-01-10T16:30:43.176Z",
  "jst_date": "2026-01-11",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-11",
      "sign": "Aries",
      "horoscope": "A boost in your finances is likely to fill your home with joy and positivity. While you may have some worries about maintaining this momentum, there's no need for concern, Aries. The stars indicate that your prosperity and good luck are here to stay for a while. Consider the possibility of making some prudent investments; this could enhance your financial stability and provide you with a greater sense of security than you've experienced before.",
      "horoscope_ja": "財政状況の改善は、あなたの家庭を喜びとポジティブな雰囲気で満たしてくれるでしょう。この勢いを維持できるか不安に思うかもしれませんが、牡羊座さん、心配する必要はありません。星は、あなたの繁栄と幸運がしばらく続くことを示しています。賢明な投資を検討してみてください。そうすれば、経済的な安定が高まり、これまでにないほどの安心感が得られるでしょう。"
    },
    "taurus": {
      "date": "2026-01-11",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find yourself on the phone quite a bit, exploring potential business opportunities with friends or acquaintances who could provide valuable insights. Someone in your circle might have achieved great success in an area that piques your interest. Everything is likely to unfold positively, but it's essential to gather all the necessary information first. You're making a wise choice by ensuring you have all the facts before diving in.",
      "horoscope_ja": "おうし座のあなたは今日、貴重な洞察を提供してくれるかもしれない友人や知人と、電話でのやり取りが頻繁になるかもしれません。あなたの周りの誰かが、あなたの興味をそそる分野で大きな成功を収めているかもしれません。すべてが順調に展開する可能性が高いですが、まずは必要な情報をすべて集めることが不可欠です。行動に移す前に、すべての事実を把握しておくことは賢明な選択です。"
    },
    "gemini": {
      "date": "2026-01-11",
      "sign": "Gemini",
      "horoscope": "Your recent achievements in your career are shining brightly, and it's easy to feel proud of your expanding finances. This positive momentum is likely to persist, Gemini, as long as you continue your diligent efforts and nurture an optimistic outlook. Expect your interactions, especially with those of the opposite sex, to be particularly affectionate and supportive today. Embrace this delightful energy and make the most of it!",
      "horoscope_ja": "最近のキャリアにおける成果は輝かしく、財産も増えていることに誇りを感じるのも無理はありません。双子座のあなた、このポジティブな勢いは、あなたが懸命に努力を続け、楽観的な見通しを育む限り、きっと続くでしょう。今日は、特に異性との交流が、愛情深く支え合うものになるでしょう。この素晴らしいエネルギーを受け入れ、最大限に活用しましょう！"
    },
    "cancer": {
      "date": "2026-01-11",
      "sign": "Cancer",
      "horoscope": "Your recent achievements at work could spark the desire to host a small celebration with your nearest and dearest, Cancer. You're radiating positivity and charm right now, and this newfound confidence is likely to deepen your connections with those around you. Expect love and romance to flourish as well. After all your hard work, it's the perfect moment to treat yourself. Wishing you a productive day and a delightful evening ahead!",
      "horoscope_ja": "蟹座のあなたは、最近仕事で成果を上げたことで、大切な人たちとちょっとしたお祝いをしたい気持ちが湧いてくるかもしれません。今、あなたはポジティブで魅力的な雰囲気を醸し出しており、この新たな自信が周りの人たちとの絆を深めてくれるでしょう。愛とロマンスも芽生えそうです。一生懸命頑張った後は、自分にご褒美をあげるのにぴったりな時です。実りある一日と素敵な夜をお過ごしください！"
    },
    "leo": {
      "date": "2026-01-11",
      "sign": "Leo",
      "horoscope": "Your connections with loved ones are set to be particularly fulfilling today, Leo. On the financial front, things are looking exceptionally bright, leading you to believe that the good times will keep rolling. This positive outlook and excitement don’t imply that you’re overlooking your blessings; instead, they’re likely to inspire you to maintain your current path, but with a newfound sense of calm.",
      "horoscope_ja": "獅子座さん、今日は愛する人との繋がりが特に充実するでしょう。経済面では、状況が非常に明るく、好景気が続くと確信できます。この前向きな見通しと興奮は、あなたが恵まれた状況を見過ごしているという意味ではありません。むしろ、新たな落ち着きとともに、現在の道を歩み続ける意欲を掻き立ててくれるでしょう。"
    },
    "virgo": {
      "date": "2026-01-11",
      "sign": "Virgo",
      "horoscope": "Virgo, your dedication and hard work have been evident for quite some time, and now you may find yourself contemplating how to treat yourself. A journey you've longed to embark on could suddenly feel within reach. Today could be the day you take the plunge and start planning. You might even consider extending your stay, as this adventure holds valuable lessons waiting to be discovered.",
      "horoscope_ja": "おとめ座さん、あなたの献身と努力は長い間明らかでしたが、今、自分へのご褒美をどうするかを考えているかもしれません。ずっと憧れていた旅が、突然手の届くところにあるように感じるかもしれません。今日こそ、思い切って計画を立て始める日かもしれません。この冒険には、これから発見される貴重な教訓が隠されているので、滞在を延長することも検討してみてもいいかもしれません。"
    },
    "libra": {
      "date": "2026-01-11",
      "sign": "Libra",
      "horoscope": "Libra, expect a lively atmosphere at home today as you welcome visitors who could range from business partners to fellow group members or innovative creatives. Engaging conversations and stimulating exchanges of ideas are on the horizon. Your romantic life is also looking bright, fueled by your current zest for life. Don't hesitate to share your aspirations with your guests; they may offer valuable insights that could help turn your dreams into reality.",
      "horoscope_ja": "天秤座さん、今日はビジネスパートナーからグループメンバー、革新的なクリエイターまで、様々なゲストを迎えるので、家は活気に溢れる雰囲気になるでしょう。魅力的な会話や刺激的なアイデアの交換が期待できます。恋愛面でも、今のあなたの人生への情熱に支えられ、輝かしい未来が待っています。ゲストにあなたの夢を遠慮なく伝えましょう。彼らはあなたの夢を現実にするのに役立つ貴重なヒントを提供してくれるかもしれません。"
    },
    "scorpio": {
      "date": "2026-01-11",
      "sign": "Scorpio",
      "horoscope": "Social gatherings in your community are likely to be delightful for you, Scorpio. Engaging in conversations, especially regarding potential new ventures, will yield a wealth of beneficial insights that you can leverage effectively. The admiration you receive from those in your circle may be especially rewarding. Your dedication has not only enhanced your financial situation but has also strengthened your relationships. Make the most of your day!",
      "horoscope_ja": "蠍座のあなたにとって、地域社会での社交の場はきっと楽しいものになるでしょう。特に新しい事業の可能性について話し合うことで、多くの有益な洞察が得られ、それを効果的に活用できるでしょう。周りの人々から称賛されることは、特に大きな喜びとなるでしょう。あなたの献身的な努力は、経済状況を改善しただけでなく、人間関係も強化しました。今日という日を精一杯楽しんでください！"
    },
    "sagittarius": {
      "date": "2026-01-11",
      "sign": "Sagittarius",
      "horoscope": "Today is an excellent opportunity for you to delve into meditation or explore spiritual subjects, Sagittarius. Your intuition is heightened, making it simpler for you to connect with the emotions, thoughts, and desires of those around you, especially from the opposite gender. You may even encounter psychic revelations or visions that provide clarity on lingering questions you've had. Be sure to jot down your reflections; they will be worth remembering.",
      "horoscope_ja": "射手座のあなたにとって、今日は瞑想に没頭したり、スピリチュアルなテーマを探求したりする絶好の機会です。直感力が研ぎ澄まされ、周囲の人々、特に異性の感情、思考、そして願望に共感しやすくなります。長年抱いていた疑問を解き明かすような、超自然的な啓示やビジョンに出会うこともあるでしょう。心に留めておきたいことを、ぜひ書き留めておきましょう。"
    },
    "capricorn": {
      "date": "2026-01-11",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you can expect your interactions with friends, partners, children, coworkers, and even unfamiliar faces to be harmonious, affectionate, and encouraging. Emotions will flow freely, often communicated in understated ways rather than through words. You might discover fresh business prospects by connecting with intriguing individuals. Engaging in social gatherings and collaborative activities will likely enhance your personal development and emotional health more than usual. Embrace these opportunities!",
      "horoscope_ja": "山羊座のあなたは今日、友人、パートナー、子供、同僚、そして見知らぬ人との交流が、調和のとれた、愛情に満ちた、そして励ましに満ちたものになるでしょう。感情は自由に溢れ、言葉ではなく控えめな方法で伝えられることが多いでしょう。興味深い人々との繋がりを通して、新たなビジネスの可能性を発見できるかもしれません。社交の場や共同活動に参加することで、普段以上に自己成長と心身の健康が促進されるでしょう。これらの機会をぜひ活かしてください！"
    },
    "aquarius": {
      "date": "2026-01-11",
      "sign": "Aquarius",
      "horoscope": "Aquarius, as you contemplate your recent achievements and the positive turns in your career, a sense of strength, optimism, and excitement for what lies ahead is likely to wash over you. Your creative endeavors are thriving, and your interactions with the opposite sex are flourishing. Today promises to be deeply fulfilling, filled with affectionate moments with loved ones and indications of ongoing advancement. Make the most of this day, and consider treating yourself to a delightful evening out.",
      "horoscope_ja": "水瓶座のあなた、最近の成果やキャリアの好転を思い返すと、力強さ、楽観的な気持ち、そして未来への期待感があなたを包み込むでしょう。創造的な活動は活気づき、異性との交流も盛んになります。今日は、愛する人との愛情あふれるひとときや、継続的な前進の兆しに満ちた、充実した一日になりそうです。この日を最大限に活用し、素敵な夜を過ごすのも良いでしょう。"
    },
    "pisces": {
      "date": "2026-01-11",
      "sign": "Pisces",
      "horoscope": "Exciting news from afar, perhaps from another state or even a foreign land, is likely to brighten your day, Pisces. You may find yourself reveling in the joy of this information for the rest of the day. However, it won't interfere with your interactions or the projects you're currently working on. Today is perfect for soaking up some sunshine, so consider taking a stroll or a scenic drive! Make the most of your day!",
      "horoscope_ja": "魚座さん、遠くから、もしかしたら別の州、あるいは外国から、ワクワクするようなニュースがあなたの一日を明るくしてくれるでしょう。その喜びに一日中浸りきってしまうかもしれません。しかし、それがあなたの交流や現在取り組んでいるプロジェクトに支障をきたすことはありません。今日は太陽の光を浴びるのに最適な日です。散歩や景色の良いドライブに出かけてみてはいかがでしょうか。一日を最大限に楽しんでください！"
    }
  }
}