{
  "updated_at": "2026-01-09T16:34:45.981Z",
  "jst_date": "2026-01-10",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-10",
      "sign": "Aries",
      "horoscope": "Aries, are you off on an adventure today, whether by plane or train? If that's the case, keep an eye out for an intriguing individual during your journey. Don't hold back—let go of any hesitation or concerns about appearances when it comes to starting a chat. Engaging with this person could make the journey more enjoyable, offer you new insights, and who knows, you might just forge a new friendship. So, take a deep breath, flash your brightest smile, and savor the experience!",
      "horoscope_ja": "牡羊座さん、今日は飛行機でも電車でも冒険に出かけますか？もしそうなら、旅の途中で魅力的な人に出会えるかもしれません。ためらわずに、外見を気にせず、さっさと話しかけてみてください。その人と交流することで、旅がより楽しくなり、新たな発見が得られるかもしれません。もしかしたら、新しい友情が生まれるかもしれません。さあ、深呼吸をして、最高の笑顔を浮かべて、この体験を味わいましょう！"
    },
    "taurus": {
      "date": "2026-01-10",
      "sign": "Taurus",
      "horoscope": "Taurus, have you recently invested in some new gadgets for your home? Whether it's a cutting-edge computer, a high-tech entertainment system, or a shiny new appliance, you and your household may find yourselves dedicating a good portion of the day to figuring it all out. It might feel a bit challenging at first, but don't worry! What seems complex is often simpler than it appears. Keep at it, and remember to enjoy the process!",
      "horoscope_ja": "おうし座の皆さん、最近、ご自宅に新しいガジェットを購入しましたか？最先端のコンピューター、ハイテクなエンターテイメントシステム、ピカピカの最新家電など、ご家族でその使い方をあれこれと試行錯誤して、一日の大半を費やしているかもしれません。最初は少し大変に感じるかもしれませんが、ご安心ください！複雑に見えるものも、実は意外とシンプルなものなのです。諦めずに、そしてそのプロセスを楽しむことを忘れないでくださいね！"
    },
    "gemini": {
      "date": "2026-01-10",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you might receive an unexpected call from a familiar face, possibly an old friend. While they may be feeling a bit down, they are likely to share some uplifting news with you. This conversation could lead to insights that subtly shift your perspective on life. Overall, anticipate a day filled with delightful surprises. Embrace the joy!",
      "horoscope_ja": "ふたご座のあなたは今日、馴染みの人、もしかしたら古い友人から思いがけない電話を受けるかもしれません。相手は少し落ち込んでいるかもしれませんが、きっと明るいニュースをくれるでしょう。この会話は、あなたの人生観を微妙に変える洞察につながるかもしれません。全体として、楽しいサプライズに満ちた一日になるでしょう。喜びを噛み締めましょう！"
    },
    "cancer": {
      "date": "2026-01-10",
      "sign": "Cancer",
      "horoscope": "Cancer, it seems the cosmos has a delightful financial surprise in store for you! This unexpected boost could come in the form of a bonus, a long-lost loan repayment, or even a settlement. No matter the source, it’s sure to bring a smile to your face. However, resist the urge to splurge immediately. Take a moment to pause and consider your options—waiting a few days to seek advice from a financial expert could greatly enhance your future. Make sure to handle this windfall wisely!",
      "horoscope_ja": "蟹座さん、宇宙はあなたに嬉しい経済的なサプライズを用意してくれているようです！この予期せぬ幸運は、ボーナス、長らく滞っていたローンの返済、あるいは和解金といった形で訪れるかもしれません。どんな形であれ、きっと笑顔になるでしょう。しかし、すぐに散財したいという衝動は抑えましょう。少し立ち止まって、選択肢を検討してみましょう。数日待って、ファイナンシャルの専門家に相談してみるのも、あなたの未来を大きく変えるかもしれません。この思いがけない幸運を賢く利用しましょう！"
    },
    "leo": {
      "date": "2026-01-10",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might find yourself swept up in a thrilling group event, likely alongside several friends. Your thoughts will be racing, sparking a flurry of ideas and engaging discussions. This could also be a chance to connect with some intriguing new faces. However, be cautious—one of these new acquaintances may have their own motives. Choose wisely about any future meetings.",
      "horoscope_ja": "獅子座さん、今日はきっと数人の友人と一緒に、刺激的なグループイベントに巻き込まれるでしょう。思考が駆け巡り、次々とアイデアが湧き出し、興味深い議論が繰り広げられるでしょう。また、興味深い新しい人々と出会うチャンスにもなり得ます。ただし、注意が必要です。新しい知り合いの中には、独自の目的を持っている人もいるかもしれません。今後の出会いについては、慎重に選びましょう。"
    },
    "virgo": {
      "date": "2026-01-10",
      "sign": "Virgo",
      "horoscope": "Today holds the potential for unexpected and delightful surprises, Virgo. You might experience an advancement that catches you off guard. The arrival of a fascinating new individual or the launch of an exhilarating project could get your heart racing. As a result, the day is likely to fly by. This evening, consider sharing your enthusiasm with your partner or a family member.",
      "horoscope_ja": "おとめ座さん、今日は思いがけず嬉しいサプライズが訪れるかもしれません。予想外の進展に遭遇するかもしれません。魅力的な新しい人との出会いや、刺激的なプロジェクトの立ち上げに、胸が高鳴るかもしれません。その結果、一日があっという間に過ぎてしまうかもしれません。今晩は、パートナーや家族とあなたの情熱を分かち合ってみてはいかがでしょうか。"
    },
    "libra": {
      "date": "2026-01-10",
      "sign": "Libra",
      "horoscope": "Feeling particularly adventurous today, Libra? This is the perfect opportunity to dive into new experiences and emerge unscathed. Consider signing up for a marathon, taking up rock climbing, or exploring an unfamiliar destination. No matter where your journey takes you, expect to find tranquility and a deeper sense of awareness. Don’t hold back! If your plans carry low risk, seize the moment and make it happen!",
      "horoscope_ja": "てんびん座さん、今日は特に冒険心が湧いていますか？新しい経験に飛び込んで、無事に成功をおさめる絶好の機会です。マラソンに挑戦したり、ロッククライミングに挑戦したり、未知の場所を探検したりしてみてはいかがでしょうか。どんな旅路を辿ろうとも、静寂と深い気づきが得られるはずです。ためらわずに！もしリスクの少ない計画なら、この瞬間を逃さず実現させましょう！"
    },
    "scorpio": {
      "date": "2026-01-10",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you may find yourself captivated by the mysteries of the occult, whether through historical texts or practical experiments. Fields like astrology, alchemy, numerology, and herbalism are likely to pique your interest, and your intuition will be particularly sharp in these areas. However, exercise caution when it comes to your sources of information; not all guides are trustworthy. While you might encounter some questionable teachings, it's wise to maintain a healthy dose of skepticism. Remember, even on a day filled with inspiration, it's important to critically evaluate what you read and hear.",
      "horoscope_ja": "蠍座のあなたは今日、歴史書を通してでも実験を通してでも、オカルトの神秘に魅了されるかもしれません。占星術、錬金術、数秘術、本草学といった分野に興味をそそられ、これらの分野では特に鋭い直感が発揮されるでしょう。しかし、情報源については注意が必要です。すべてのガイドが信頼できるとは限りません。疑わしい教えに遭遇することもあるかもしれませんが、健全な懐疑心を持ち続けることが賢明です。インスピレーションに満ちた日であっても、読んだり聞いたりしたことを批判的に評価することが重要だということを忘れないようにしましょう。"
    },
    "sagittarius": {
      "date": "2026-01-10",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may find yourself presented with a chance to fly, possibly at someone else's cost. This could be linked to work or serve an educational purpose. It's an excellent day for travel or to finalize your plans. The adventure ahead is sure to be thrilling and memorable. Take the necessary steps to organize everything, and then seize the opportunity! Have a wonderful day!",
      "horoscope_ja": "射手座のあなたは今日、誰かの負担で飛行機に乗るチャンスに恵まれるかもしれません。仕事や教育目的のためかもしれません。旅行や計画を最終決定するのに最適な日です。これからの冒険はきっとスリリングで思い出深いものになるでしょう。必要な準備をして、チャンスを掴みましょう！素晴らしい一日をお過ごしください！"
    },
    "capricorn": {
      "date": "2026-01-10",
      "sign": "Capricorn",
      "horoscope": "Tonight, Capricorn, you might experience some unusual dreams filled with unexpected symbols—faces or items that you wouldn't typically consider. However, these dream elements hold significance for you at this moment. Take some time to jot down the symbols and occurrences from your dream, and reflect on their personal meanings. Your subconscious is conveying an important message, so be sure to pay attention and embrace the insights it offers.",
      "horoscope_ja": "今夜、山羊座のあなたは、普段は考えも及ばないような顔や物といった、思いもよらないシンボルに満ちた、ちょっと変わった夢を見るかもしれません。しかし、これらの夢の要素は、今のあなたにとって重要な意味を持っています。少し時間を取って、夢に出てきたシンボルや出来事を書き留め、それぞれの意味をじっくり考えてみましょう。あなたの潜在意識は重要なメッセージを伝えています。注意深く耳を傾け、そこから得られる洞察を受け入れてください。"
    },
    "aquarius": {
      "date": "2026-01-10",
      "sign": "Aquarius",
      "horoscope": "Aquarius, are you considering skipping out on tonight's party? Think again! If you're flying solo, you might just meet someone special who could spark a thrilling connection, and you could end up enjoying the night together. For those already in a relationship, keep an eye out for a newcomer who could turn out to be a significant business ally, possibly leading to a fruitful collaboration. Unless you're completely worn out, make the effort to attend! You’ll be glad you did!",
      "horoscope_ja": "水瓶座さん、今夜のパーティーを欠席しようと思っている？ちょっと考え直した方がいいですよ！もし一人でいるなら、特別な人と出会って、スリリングな出会いが生まれ、一緒に夜を楽しめるかもしれません。すでに恋人がいる方は、新しい人が現れるかもしれません。それがビジネスの重要なパートナーになり、実りあるコラボレーションにつながるかもしれません。本当に疲れていない限り、ぜひ参加してみてください！きっと満足できるはずです！"
    },
    "pisces": {
      "date": "2026-01-10",
      "sign": "Pisces",
      "horoscope": "Today may bring some surprising shifts for you, Pisces. You might encounter the challenge of adapting to cutting-edge technology that’s unfamiliar to you. Stay calm; you’ll navigate this just fine and soon become quite adept at it. Concentrate on this task and absorb as much knowledge as possible. You've got this!",
      "horoscope_ja": "魚座のあなたにとって、今日は驚くべき変化が訪れるかもしれません。馴染みのない最先端のテクノロジーに適応するという課題に直面するかもしれません。落ち着いてください。きっとうまく乗り越え、すぐに使いこなせるようになるでしょう。この課題に集中し、できるだけ多くの知識を吸収してください。あなたならきっとできるはずです！"
    }
  }
}