{
  "updated_at": "2025-12-24T16:31:17.024Z",
  "jst_date": "2025-12-25",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-25",
      "sign": "Aries",
      "horoscope": "You might find yourself feeling a bit irritable and low on energy today. However, this heavy atmosphere can provide you with a clearer perspective on your current circumstances. Take a moment to assess areas in your life that don't spark joy or excitement; they may be in need of a transformation.",
      "horoscope_ja": "今日は少しイライラしたり、エネルギーが枯渇したりしているかもしれません。しかし、この重苦しい雰囲気は、現状をより明確に捉えるきっかけを与えてくれるかもしれません。少し時間を取って、人生の中で喜びやワクワクを感じられない部分を見直してみましょう。もしかしたら、変革が必要なのかもしれません。"
    },
    "taurus": {
      "date": "2025-12-25",
      "sign": "Taurus",
      "horoscope": "Today, the atmosphere feels a bit heavy. You might find yourself wanting to distance yourself from those who create hurdles in your way, or perhaps you wish to escape entirely! This day presents a valuable opportunity to assess your limits. Consider how far you can stretch your personal capabilities, both emotionally and in your career.",
      "horoscope_ja": "今日は少し重苦しい雰囲気です。邪魔をする人たちと距離を置きたくなるかもしれませんし、もしかしたら完全に逃げ出したいと思うかもしれません。この日は、自分の限界を見極める貴重な機会です。感情面でも仕事面でも、自分の能力をどこまで伸ばせるかを考えてみましょう。"
    },
    "gemini": {
      "date": "2025-12-25",
      "sign": "Gemini",
      "horoscope": "You're ready to come clean about your own shortcomings! It’s become clear that you’re not quite hitting the mark lately. Now is the moment to harness your self-discipline. You might revamp your approach to work, manage your finances with greater precision, or explore new interests. There’s a chance you’ll also rethink your team dynamics. A variety of solutions are at your fingertips!",
      "horoscope_ja": "自分の欠点を正直に認める準備はできましたか？最近、目標達成がうまくいっていないことがはっきりと分かりました。今こそ、自制心を発揮する時です。仕事への取り組み方を見直したり、より正確にお金の管理をしたり、新しい趣味を探したりしてみてはいかがでしょうか。チームの力関係を見直すチャンスもあるかもしれません。様々な解決策がすぐに見つかります！"
    },
    "cancer": {
      "date": "2025-12-25",
      "sign": "Cancer",
      "horoscope": "Are you caught in a tug-of-war between your professional ambitions and family commitments? Or perhaps you're weighing the value of social acclaim against your own happiness? Today, you might find yourself grappling with these dilemmas, dedicating much of your time to seeking clarity. While you're striving to balance everything, the fatigue you experience serves as a reminder that it's time to consider making some thoughtful and practical adjustments for your future.",
      "horoscope_ja": "仕事への野心と家族の責任の間で綱引きをしていますか？あるいは、社会的な称賛と自分の幸福を天秤にかけていますか？今日、あなたはこうしたジレンマに苦しみ、物事の明確化に多くの時間を費やしているかもしれません。あらゆるバランスを取ろうと努力する中で、あなたが感じる疲労は、将来のために思慮深く現実的な調整を検討する時期が来たことを思い出させてくれます。"
    },
    "leo": {
      "date": "2025-12-25",
      "sign": "Leo",
      "horoscope": "Today, you may find yourself facing both inner turmoil and external challenges. Your tendency to get swept away in your daydreams can sometimes make you oblivious to reality. However, today, you'll be jolted awake by some urgent matters concerning your job or finances. There's no point in succumbing to panic; you've come to understand that avoiding issues only exacerbates them.",
      "horoscope_ja": "今日は、内面の葛藤と外的な課題の両方に直面するかもしれません。空想にふけりがちな性格で、現実を忘れてしまうこともあります。しかし今日は、仕事やお金に関する緊急の問題で、ハッと目が覚めるでしょう。パニックに陥っても仕方ありません。問題を避ければ避けるほど、事態は悪化するだけだと、あなたは理解しているはずです。"
    },
    "virgo": {
      "date": "2025-12-25",
      "sign": "Virgo",
      "horoscope": "Your well-known impatience is leading you astray. You're rushing things too much. While you may have altered your surroundings, your true self remains unchanged. Avoid the urge to wipe the slate clean and begin anew. If you do, you might find yourself back at square one in just a few months. Consider a more thoughtful strategy.",
      "horoscope_ja": "よく知られたあなたのせっかちな性格が、あなたを迷わせています。物事を急ぎすぎています。環境は変えたかもしれませんが、あなたの本質は変わりません。過去を白紙に戻したいという衝動を抑えましょう。そうすると、数ヶ月で振り出しに戻ってしまうかもしれません。もっと思慮深い戦略を検討しましょう。"
    },
    "libra": {
      "date": "2025-12-25",
      "sign": "Libra",
      "horoscope": "Your determination can sometimes come off as stubbornness, and today, you're showcasing this trait quite vividly. While you may take your time to get going, once you set your mind to something, it's nearly impossible to divert your course! However, making the needed changes isn't as daunting as it seems. Just remember to be patient with yourself.",
      "horoscope_ja": "あなたの強い意志は時に頑固さとして捉えられてしまうことがありますが、今日はまさにその特徴を如実に表しています。行動を起こすまでには時間がかかるかもしれませんが、一度心に決めたら、方向転換するのはほぼ不可能です！しかし、必要な変化を起こすことは、見た目ほど難しいことではありません。ただ、自分自身に辛抱強く接することを忘れないでください。"
    },
    "scorpio": {
      "date": "2025-12-25",
      "sign": "Scorpio",
      "horoscope": "It might seem like delving into your emotions is becoming increasingly difficult, yet it's essential to keep pushing forward. You possess an incredible ability to suppress issues, often gliding through life without acknowledging them. While this approach helps you maintain a cheerful demeanor, it may prevent you from experiencing true, deep-seated happiness. Don't you think it's time to reflect on that?",
      "horoscope_ja": "自分の感情を掘り下げるのがますます難しくなっているように思えるかもしれませんが、それでも前進し続けることが不可欠です。あなたは問題を抑圧する驚くべき能力を持っており、しばしば問題を認めることなく人生を流暢に過ごしています。このアプローチは明るい態度を保つのに役立ちますが、真の、根深い幸福を経験することを妨げているかもしれません。今こそ、そのことをじっくり考える時ではないでしょうか？"
    },
    "sagittarius": {
      "date": "2025-12-25",
      "sign": "Sagittarius",
      "horoscope": "You're currently navigating a shift in your career path, and this transformation won't happen overnight. It may feel challenging at times, and progress might seem slow, demanding deep self-reflection and honesty. Resist the urge to escape from this process. Have faith that you're closer to achieving your aspirations than you realize.",
      "horoscope_ja": "あなたは今、キャリアパスの転換期を迎えています。この変化は一夜にして起こるものではありません。時には困難に感じ、進歩が遅く、深い自己反省と誠実さが求められることもあるでしょう。このプロセスから逃げ出したい衝動を抑えてください。あなたが思っている以上に、あなたの夢の実現に近づいていると信じてください。"
    },
    "capricorn": {
      "date": "2025-12-25",
      "sign": "Capricorn",
      "horoscope": "Today calls for you to showcase your resilience. There's a lot on your plate, and stepping up to meet the expectations is non-negotiable. You play a vital role in the unfolding situations around you, and it's hard to ignore that fact. As tempting as it may be to escape for a getaway, now isn't the time to do so.",
      "horoscope_ja": "今日は、あなたの粘り強さを発揮する時です。やるべきことが山積みで、期待に応えるために全力を尽くすことは譲れません。あなたは周囲の状況において重要な役割を果たしており、その事実を無視することは難しいでしょう。どこかへ逃げ出したくなるかもしれませんが、今はそうすべき時ではありません。"
    },
    "aquarius": {
      "date": "2025-12-25",
      "sign": "Aquarius",
      "horoscope": "You might find yourself brimming with brilliant ideas in your career today, but are you fully confident in your understanding of them? If there's room for growth, embrace the opportunity to learn from courses or seasoned professionals in your industry. Seeking guidance is a sign of strength, not weakness. Let go of any skepticism or criticism towards the suggestions others offer you.",
      "horoscope_ja": "仕事で素晴らしいアイデアが溢れているかもしれませんが、それらを完全に理解している自信はありますか？成長の余地があるなら、講座を受講したり、業界のベテランから学ぶ機会を積極的に活用しましょう。指導を求めることは弱さではなく、強さの証です。他人からの提案に対して、疑念や批判を抱くのはやめましょう。"
    },
    "pisces": {
      "date": "2025-12-25",
      "sign": "Pisces",
      "horoscope": "You might find yourself troubled by some lingering worries today, whether they're related to finances or a slight health issue. Don't allow these concerns to weigh you down. You possess the strength within to navigate through these challenges. While the present circumstances may cast a shadow over your mood, brighter days filled with optimism are on the horizon. In the meantime, lean on the pillars of love, friendship, and faith to uplift your spirits.",
      "horoscope_ja": "今日は、経済的なことやちょっとした健康上の問題など、何か不安なことが頭から離れないかもしれません。でも、そんな心配に押しつぶされないでください。あなたには、これらの困難を乗り越える力があります。現状が気分に暗い影を落とすかもしれませんが、明るい未来がすぐそこまで来ています。それまでの間、愛、友情、そして信仰という柱に頼って、気持ちを明るく保ちましょう。"
    }
  }
}