{
  "updated_at": "2025-11-24T16:28:01.554Z",
  "jst_date": "2025-11-25",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-25",
      "sign": "Aries",
      "horoscope": "Today, you might receive some positive news regarding your finances, which could unlock a range of exciting opportunities. You may feel inspired to invest in enhancing your living space, or this could be the financial boost you've been waiting for to launch your own business. Your enthusiasm and energy for new projects are palpable, but remember to take it slow and steady for lasting success.",
      "horoscope_ja": "今日は、経済面で良い知らせが届くかもしれません。それは、様々な刺激的なチャンスの扉を開くかもしれません。生活空間の充実に投資する意欲が湧くかもしれませんし、あるいは、自分のビジネスを立ち上げるために待ち望んでいた資金援助が舞い込むかもしれません。新しいプロジェクトへの熱意とエネルギーは明らかですが、永続的な成功のためには、ゆっくりと着実に進めることを忘れないでください。"
    },
    "taurus": {
      "date": "2025-11-25",
      "sign": "Taurus",
      "horoscope": "Get ready for a thrilling day ahead! It’s going to be quite active, and your adventurous spirit is calling for something new. Consider gathering some friends for an outing this afternoon. Whether it’s catching a film or taking a stroll in the park, you’re bound to relish this refreshing shift in your routine.",
      "horoscope_ja": "刺激的な一日に向けて準備を始めましょう！今日はとてもアクティブで、冒険心が新しい何かを求めています。午後は友達とお出かけしてみてはいかがでしょうか。映画を見たり、公園を散歩したり、いつものルーティンに新鮮な変化を加えることで、きっと気分転換になるでしょう。"
    },
    "gemini": {
      "date": "2025-11-25",
      "sign": "Gemini",
      "horoscope": "Stay alert today, as you may come across some valuable insights. There’s a chance you’ll receive a promising investment opportunity or a lucrative stock market tip. While it appears that your financial situation is on the verge of improvement, exercise caution and avoid making impulsive decisions. Remember, acting too quickly can lead to mistakes!",
      "horoscope_ja": "今日は油断せずに、貴重な洞察に出会うかもしれません。有望な投資機会や、有利な株式市場の情報を得るチャンスがあります。財政状況は改善に向かっているように見えますが、衝動的な決断は避け、慎重に行動しましょう。性急な行動は間違いにつながることを忘れないでください。"
    },
    "cancer": {
      "date": "2025-11-25",
      "sign": "Cancer",
      "horoscope": "Your friendships play a vital role in your life, and as time goes on, their significance will only grow. Today presents a wonderful opportunity to expand your social circle, whether it's by adding one new friend or several. You might find yourself joining a group that shares your passions, or you could meet someone with whom you instantly click. No matter the scenario, these new connections are sure to bring a wealth of joy and enrichment to your life.",
      "horoscope_ja": "友情はあなたの人生において重要な役割を果たし、時が経つにつれて、その重要性はますます増していくでしょう。今日は、新しい友人を一人増やすだけでも、何人か増やすだけでも、あなたの交友関係を広げる絶好の機会です。同じ情熱を持つグループに参加したり、すぐに意気投合する人に出会ったりするかもしれません。どんな状況であっても、これらの新しいつながりは、あなたの人生に豊かな喜びと豊かさをもたらしてくれるでしょう。"
    },
    "leo": {
      "date": "2025-11-25",
      "sign": "Leo",
      "horoscope": "Today, you may find yourself grappling with mixed feelings. While you might take pleasure in your pursuits, there's a nagging sense that you lack the ability to commit to one in particular. Remember, this is a matter of confidence rather than capability. An experience could arise today that highlights your true intelligence and skills. Embrace any chance that comes your way!",
      "horoscope_ja": "今日は、複雑な感情に苛まれているかもしれません。自分のやりたいことに喜びを感じている一方で、特定のことに打ち込めるだけの力がないという、どこか不安な気持ちを抱えているかもしれません。これは能力の問題ではなく、自信の問題です。今日、あなたの真の知性とスキルを浮き彫りにする出来事が訪れるかもしれません。どんなチャンスも掴みましょう！"
    },
    "virgo": {
      "date": "2025-11-25",
      "sign": "Virgo",
      "horoscope": "Explore the subjects that captivate your curiosity. Embrace the freedom to delve into even the most unconventional interests, as they may blossom into a true passion. Your quest for knowledge could connect you with a community of individuals who share your enthusiasm, and some of these connections might evolve into lasting friendships.",
      "horoscope_ja": "好奇心を掻き立てるテーマを探求しましょう。たとえ型破りな興味であっても、自由に探求しましょう。それが真の情熱へと発展するかもしれません。知識の探求を通して、同じ情熱を持つ人々と繋がり、その繋がりが長続きする友情へと発展するかもしれません。"
    },
    "libra": {
      "date": "2025-11-25",
      "sign": "Libra",
      "horoscope": "Be sure to check your phone and go through your mail today, as you might receive some unexpected financial news. This could be a significant boost that transforms your life in remarkable ways. With this newfound wealth, you could launch a business or provide your family with opportunities you never thought possible. Today is set to be an exciting day!",
      "horoscope_ja": "今日は携帯電話とメールをしっかりチェックしてください。予期せぬ経済ニュースが届くかもしれません。これはあなたの人生を劇的に変える大きな後押しとなるかもしれません。この新たな富で、ビジネスを立ち上げたり、家族にこれまで考えられなかったようなチャンスを与えたりできるかもしれません。今日はきっとエキサイティングな一日になるでしょう！"
    },
    "scorpio": {
      "date": "2025-11-25",
      "sign": "Scorpio",
      "horoscope": "Exploring far-off places could be on the horizon for you. Although you're eager for a shift, take a moment to consider before diving into the first chance that arises. The opportunity at hand may involve a significant commitment, potentially lasting a lifetime. Reflect carefully before you agree. That said, if you do choose to embrace it, you’re likely to find satisfaction in your choice.",
      "horoscope_ja": "遠く離れた場所への冒険が、あなたの目の前に迫っているかもしれません。変化を待ちわびているかもしれませんが、最初のチャンスに飛びつく前に、少し考えてみてください。目の前のチャンスは、一生続くかもしれない大きな決断を伴うかもしれません。同意する前に、よく考えてみてください。とはいえ、もし受け入れることに決めたなら、きっと満足感を得られるでしょう。"
    },
    "sagittarius": {
      "date": "2025-11-25",
      "sign": "Sagittarius",
      "horoscope": "Prepare yourself for some exciting news today! It's your time to shine and reap the rewards you've worked so hard for. Whether it's a promotion, a salary increase, a new and challenging project, or a delightful mix of all three, something wonderful is on the horizon. Additionally, you might find your love life taking a turn for the better. Your dedication has been nothing short of extraordinary, and now it's time to enjoy the fruits of your labor. Embrace whatever blessings come your way with your signature grace and flair.",
      "horoscope_ja": "今日はワクワクするニュースに備えましょう！輝ける時が来ました。これまで懸命に努力してきた成果を、今こそ手に入れましょう。昇進、昇給、やりがいのある新しいプロジェクト、あるいはこれら3つを組み合わせた素晴らしいものなど、素晴らしい何かが目の前に迫っています。さらに、恋愛運も好転するかもしれません。これまであなたは並外れた努力を続けてきました。今こそ、その努力の成果を味わう時です。持ち前の優雅さとセンスで、どんな祝福も受け止めてください。"
    },
    "capricorn": {
      "date": "2025-11-25",
      "sign": "Capricorn",
      "horoscope": "Now is the perfect moment to enhance your tech skills. With technology firmly integrated into our lives, it's wise to welcome it instead of pushing back. Your brain is primed to take in fresh knowledge, allowing you to delve into the more complex features of computer technology. Once you master these skills, you'll find joy in exploring websites, shopping online, and connecting with friends through email, no matter the distance.",
      "horoscope_ja": "今こそ、テクノロジースキルを高める絶好の機会です。テクノロジーは私たちの生活に深く浸透しているので、抵抗するのではなく、積極的に受け入れるべきです。脳は新しい知識を吸収する準備が整っており、コンピューターテクノロジーのより複雑な機能を深く理解できるようになります。これらのスキルを習得すれば、ウェブサイトを閲覧したり、オンラインショッピングをしたり、距離に関係なくメールで友人とつながったりすることに喜びを見出すでしょう。"
    },
    "aquarius": {
      "date": "2025-11-25",
      "sign": "Aquarius",
      "horoscope": "Today, your home is likely to be buzzing with activity. You might find yourself welcoming unexpected guests, hosting houseguests, or having repair workers bustling about. While the atmosphere may feel a bit chaotic, there's an exhilarating energy that comes with having so many people around. Remember, even amidst the hustle and bustle, this day can still be enjoyable and fulfilling.",
      "horoscope_ja": "今日は、あなたの家はきっと賑やかになるでしょう。予期せぬ来客を迎えたり、来客をもてなしたり、修理業者が忙しく動き回ったりするかもしれません。少し混沌とした雰囲気に感じるかもしれませんが、たくさんの人が集まることで、爽快なエネルギーが生まれます。どんなに慌ただしい中でも、この日は楽しく充実した日になることを忘れないでください。"
    },
    "pisces": {
      "date": "2025-11-25",
      "sign": "Pisces",
      "horoscope": "Expect to hear some intriguing news today! It might arrive via a phone call or an email from someone dear to you. This information could motivate you to spring into action, leading to a flurry of errands and the need to wrap up a project swiftly. You're feeling upbeat, full of energy, and more than capable of handling whatever comes your way!",
      "horoscope_ja": "今日は興味深いニュースが届くかもしれません！大切な人からの電話やメールかもしれません。この情報がきっかけで、あなたはすぐに行動を起こすようになり、用事が山積みになったり、プロジェクトを急いで終わらせる必要に迫られたりするかもしれません。あなたは気分が明るく、エネルギーに満ち溢れ、どんな困難にも対処できる力を持っています！"
    }
  }
}