{
  "updated_at": "2025-11-23T16:27:41.919Z",
  "jst_date": "2025-11-24",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-24",
      "sign": "Aries",
      "horoscope": "Today, someone may inquire about your thoughts. You tend to ponder matters that others find elusive. It might feel as though you've embarked on an inward journey, seeking answers to profound spiritual questions or the mysteries of existence. Simply let them know you're in a state of reflection, as they likely won't grasp the depth of your contemplations.",
      "horoscope_ja": "今日、誰かがあなたの考えを尋ねてくるかもしれません。あなたは、他の人には理解しがたい事柄について深く考える傾向があります。深遠な精神的な問いや存在の神秘への答えを求めて、内省の旅に出ているような気分になるかもしれません。相手にはあなたの思索の深さを理解できない可能性が高いので、ただ自分が内省中であることを伝えましょう。"
    },
    "taurus": {
      "date": "2025-11-24",
      "sign": "Taurus",
      "horoscope": "You have a passion for diving deep into meaningful conversations that stretch late into the night, envisioning a better world alongside your friends. However, lately, you find yourself feeling sleepy by ten and tucked in bed shortly after. This trend continues today. Are you simply worn out, or is it that you crave some solitude to reflect on your thoughts?",
      "horoscope_ja": "あなたは、友人たちと夜遅くまで有意義な会話に没頭し、より良い世界を思い描くことに情熱を注いでいます。しかし最近は、10時頃には眠くなってしまい、すぐにベッドに潜り込んでしまうことがよくあります。この傾向は今も続いています。単に疲れているだけでしょうか、それとも一人でじっくり考えたいだけでしょうか？"
    },
    "gemini": {
      "date": "2025-11-24",
      "sign": "Gemini",
      "horoscope": "Do you find yourself treating the world as if it's unchanging and fixed? There are moments when you might believe that humanity and the world are set in their ways, leading you to follow a predetermined path. But have you considered the concept of evolution? Both people and the planet are in a state of continuous transformation. Take a moment to observe your surroundings!",
      "horoscope_ja": "あなたは、世界を不変で固定されたものとして捉えていませんか？人類や世界は固定されていて、決められた道を歩むように仕向けられていると感じてしまう瞬間があるかもしれません。しかし、進化という概念について考えたことはありますか？人類も地球も、常に変化し続けています。少し時間を取って、周囲を観察してみましょう！"
    },
    "cancer": {
      "date": "2025-11-24",
      "sign": "Cancer",
      "horoscope": "Allow your feelings to blend with your thoughts today. There's little value in convincing yourself to enjoy something that truly doesn't resonate with you. What purpose do lofty ideals serve if your heart isn't aligned with them? Make it a priority to harmonize your mind and emotions today.",
      "horoscope_ja": "今日は感情と思考を融合させましょう。本当に心に響かないものを楽しもうと自分に言い聞かせても意味がありません。心がそれと調和していなければ、高尚な理想は何の役にも立ちません。今日は、心と感情を調和させることを最優先にしましょう。"
    },
    "leo": {
      "date": "2025-11-24",
      "sign": "Leo",
      "horoscope": "Today, you might find yourself reflecting on your past. One part of you yearns for the comfort of the \"good old days,\" while another part eagerly anticipates what lies ahead, embracing the uncertainty of the future. Although these feelings may seem at odds, both aspects of your personality play a vital role in driving progress. Take some time to contemplate this duality today.",
      "horoscope_ja": "今日は、過去を振り返っている自分に気づくかもしれません。心の片隅では「古き良き時代」の安らぎを懐かしむ一方で、もう片隅では未来への期待を胸に、未来の不確実性を受け入れています。これらの感情は相反するように見えるかもしれませんが、あなたの人格におけるこの二つの側面は、前進を促す上で重要な役割を果たしています。今日は少し時間を取って、この二面性についてじっくり考えてみましょう。"
    },
    "virgo": {
      "date": "2025-11-24",
      "sign": "Virgo",
      "horoscope": "Your awareness of your surroundings is heightened today, and it feels as though your heart is guiding your thoughts. This emotional intensity may make you more susceptible to outside influences, potentially clouding your judgment in personal connections. If you were planning to keep something under wraps, be cautious; your feelings are likely to be evident, even if you remain silent.",
      "horoscope_ja": "今日は周囲への意識が高まり、心が思考を導いているように感じます。この感情の激しさは、外部からの影響を受けやすく、人間関係において判断力を鈍らせる可能性があります。何かを隠そうと思っていたなら、慎重に行動しましょう。たとえ沈黙を守っていたとしても、あなたの感情は表に出てしまう可能性が高いでしょう。"
    },
    "libra": {
      "date": "2025-11-24",
      "sign": "Libra",
      "horoscope": "If faced with a choice between poetry and physics in a test today, you'd undoubtedly choose poetry. This day leans towards interpretation rather than strict analysis. As the atmosphere shifts in the coming days, it will influence your thought processes. Be prepared for some misunderstandings with those who are nearest to you.",
      "horoscope_ja": "もし今日のテストで詩と物理のどちらかを選ばなければならなかったら、あなたは間違いなく詩を選ぶでしょう。今日は厳密な分析よりも解釈が重視される日です。今後数日で変化する雰囲気は、あなたの思考プロセスにも影響を与えるでしょう。身近な人たちとの誤解に備えましょう。"
    },
    "scorpio": {
      "date": "2025-11-24",
      "sign": "Scorpio",
      "horoscope": "Are you a natural wordsmith? Your ability to articulate thoughts with clarity and precision shines through, and it may play a significant role in your professional life. Today, consider channeling this talent to convey your emotions to someone special. Whether it's a heartfelt note to a family member or a romantic letter, inspiration is on your side.",
      "horoscope_ja": "あなたは生まれながらの言葉遣いが得意ですか？考えを明快かつ正確に表現する能力は、あなたの才能を輝かせ、仕事で大きな役割を果たすかもしれません。今日は、この才能を活かして、大切な人にあなたの気持ちを伝えてみませんか？家族への心のこもったメッセージでも、ロマンチックな手紙でも、インスピレーションはあなたの味方です。"
    },
    "sagittarius": {
      "date": "2025-11-24",
      "sign": "Sagittarius",
      "horoscope": "Anticipate a delightful day ahead! While those around you might not be in a playful mood, their affection and care in relationships will shine through, just the way you appreciate it. The stars are aligned for you to share your feelings with someone special—don't hesitate! This supportive vibe is fleeting, so seize the moment!",
      "horoscope_ja": "素敵な一日が待っています！周りの人たちは遊び心がないかもしれませんが、あなたが感謝しているように、彼らの愛情と気遣いが光り輝くでしょう。特別な人にあなたの気持ちを伝えるのにぴったりの星が揃っています。ためらわずに！この温かい雰囲気は束の間なので、その瞬間を掴みましょう！"
    },
    "capricorn": {
      "date": "2025-11-24",
      "sign": "Capricorn",
      "horoscope": "Today, anticipate a sense of warmth in your interactions with others. Your connections will carry a uniquely gentle and nurturing vibe. It seems as though everyone is more attuned and considerate than usual. The cosmos feels like a joyful, united family. Feel free to share your thoughts and emotions; there's no need to hesitate in opening up to a friend about your deepest feelings.",
      "horoscope_ja": "今日は、人との交流に温かさを感じるでしょう。人との繋がりは、独特の優しく、育むような雰囲気を帯びるでしょう。誰もがいつも以上に調和し、思いやり深くなっているように感じます。宇宙は喜びに満ちた、一つになった家族のように感じられます。考えや感情を遠慮なく分かち合ってください。心の奥底にある感情を、友人に打ち明けることをためらう必要はありません。"
    },
    "aquarius": {
      "date": "2025-11-24",
      "sign": "Aquarius",
      "horoscope": "Today is a day of satisfaction for you. In the coming days, you’ll find yourself setting aside your logical mindset and allowing your emotions to take the lead. Your focus will be on the loved ones in your life, and if someone reaches out for assistance, you’ll be there to lend a hand without any judgment or lectures about their past mistakes!",
      "horoscope_ja": "今日はあなたにとって満足のいく日です。これからの数日間は、論理的な思考を脇に置き、感情に身を委ねる日々が続くでしょう。大切な人たちに目を向け、誰かが助けを求めてきたら、過去の過ちを批判したり説教したりすることなく、手を差し伸べてあげましょう。"
    },
    "pisces": {
      "date": "2025-11-24",
      "sign": "Pisces",
      "horoscope": "Today is an excellent day to unleash your creativity, particularly in ways that highlight your unique flair. While you may find yourself quite productive, be mindful that your creations might mirror current trends rather than your authentic self. This tendency can hinder you from expressing your true style. Instead, let your emotions guide your inspiration today.",
      "horoscope_ja": "今日は創造性を解き放つ絶好の日です。特に、あなた独自の個性を際立たせる方法で。生産性は高いかもしれませんが、作品が今のトレンドを反映し、本来の自分らしさを反映できていない可能性もあるので注意が必要です。こうした傾向は、本来のスタイルを表現する妨げになることがあります。今日は、感情に導かれてインスピレーションを得ましょう。"
    }
  }
}