{
  "updated_at": "2026-01-22T16:40:44.919Z",
  "jst_date": "2026-01-23",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-23",
      "sign": "Aries",
      "horoscope": "Today, Aries, your views are likely to be quite powerful, and you might feel invincible. Keep in mind, though, that you share this world with others, so be mindful of their presence as you navigate your day. While voicing your opinions should come easily, opening up about your feelings might be a different story. If it doesn’t feel comfortable to share your emotions right now, it’s perfectly okay to hold back.",
      "horoscope_ja": "牡羊座のあなた、今日はあなたの意見がかなり力強く、無敵だと感じるかもしれません。しかし、この世界は他者と共有していることを忘れないでください。ですから、日々を過ごす中で、彼らの存在を意識するようにしてください。意見を表明するのは簡単ですが、自分の気持ちを率直に伝えるとなると話は別です。もし今、自分の感情を分かち合うのが心地よくないなら、控えても全く問題ありません。"
    },
    "taurus": {
      "date": "2026-01-23",
      "sign": "Taurus",
      "horoscope": "Taurus, it's important to recognize that you might be influencing those around you without even realizing it. Today could bring unexpected emotional reactions from others, triggered by the pressure you may be unintentionally applying. Remember, you are not obligated to shoulder the weight of everyone else's choices. Focus on navigating your own challenges, as you may already have your hands full.",
      "horoscope_ja": "おうし座のあなたは、気づかないうちに周りの人に影響を与えているかもしれないと認識することが大切です。今日は、あなたが無意識のうちに与えているプレッシャーがきっかけで、他人から予期せぬ感情的な反応を受けるかもしれません。他人の選択の重荷を背負う義務はあなたにはないことを忘れないでください。すでに手一杯になっているかもしれませんので、自分の課題を乗り越えることに集中しましょう。"
    },
    "gemini": {
      "date": "2026-01-23",
      "sign": "Gemini",
      "horoscope": "Stay alert for surprises today, Gemini. The silver lining is that your adaptable nature is just what you need to navigate the day's unpredictable events. While others might feel frustrated when their plans fall apart, you'll effortlessly ride the waves and transform any challenge into an opportunity, no matter how different things turn out from your initial expectations.",
      "horoscope_ja": "ふたご座の皆さん、今日はサプライズに要注意です。明るい兆しは、あなたの順応性の高さが、今日の予測不可能な出来事を乗り越えるために必要な力になっていることです。他の人は計画が崩れてフラストレーションを感じるかもしれませんが、あなたはどんなに当初の期待と違っても、波を楽々と乗り越え、どんな困難もチャンスに変えていきます。"
    },
    "cancer": {
      "date": "2026-01-23",
      "sign": "Cancer",
      "horoscope": "Today is the day to break free from your comfort zone, Cancer. Avoid being distant; the perfect path won’t reveal itself until you venture into various possibilities. The silver lining is that your emotional strength is on the rise, empowering you to engage with others assertively. This will help you gain their respect and trust in the projects you’re currently pursuing.",
      "horoscope_ja": "蟹座のあなた、今日こそコンフォートゾーンから抜け出す日です。距離を置くのは避けましょう。様々な可能性に挑戦してみなければ、完璧な道は見えてきません。明るい兆しは、あなたの感情的な強さが高まっており、他者と積極的に関わることができるようになっていることです。これは、現在取り組んでいるプロジェクトにおいて、彼らからの尊敬と信頼を得るのに役立つでしょう。"
    },
    "leo": {
      "date": "2026-01-23",
      "sign": "Leo",
      "horoscope": "You might find yourself puzzled by the heightened sensitivity of those around you today, Leo, especially when you perceive it as just another ordinary day. Remember to be a bit more forgiving when others don’t seem to share your cheerful demeanor. To earn their trust, it’s essential to demonstrate that you can connect with them on their level. Take the time to show empathy and acknowledge the needs of others.",
      "horoscope_ja": "獅子座さん、今日は周りの人の感受性の高まりに戸惑うかもしれません。特に、いつもの一日のように感じている時はなおさらです。周りの人があなたのような明るい態度をとってくれない時は、もう少し寛容になることを忘れずに。信頼を得るには、彼らと同じレベルで接することができることを示すことが不可欠です。時間をかけて共感を示し、相手のニーズに寄り添いましょう。"
    },
    "virgo": {
      "date": "2026-01-23",
      "sign": "Virgo",
      "horoscope": "Virgo, you might find it challenging to kick off your day until you address a concern that's been weighing on your mind. Today, you possess an unusual reservoir of emotional resilience, and it's crucial to cling to this strength no matter what. While others may attempt to undermine you with their comments, take a moment to listen closely. Are they presenting valid points, or merely sharing their personal views?",
      "horoscope_ja": "おとめ座のあなたは、ずっと頭を悩ませている問題に対処しないと、一日を始めるのが難しいと感じるかもしれません。今日、あなたは並外れた感情的な回復力の蓄えを持っており、どんなことがあってもこの強さを貫くことが重要です。周りの人があなたの意見を弱めようとするかもしれませんが、少し時間を取って、よく耳を傾けてください。彼らは正当な意見を述べているのでしょうか、それとも単に個人的な意見を述べているだけなのでしょうか？"
    },
    "libra": {
      "date": "2026-01-23",
      "sign": "Libra",
      "horoscope": "Libra, don't allow a careless remark from someone else to spoil your day. It seems that people around you might be holding back, whether it's their finances, feelings, or quality time with family and friends. Remember, the more you insist that someone is mistaken, the more likely they are to dismiss your perspective. Overall, it’s best to keep your distance from others today.",
      "horoscope_ja": "天秤座さん、誰かの軽率な発言で一日を台無しにしないでください。周りの人たちは、経済面、感情面、家族や友人との充実した時間など、何かしらためらっているようです。相手が間違っていると主張しれば主張するほど、あなたの意見を否定される可能性が高くなります。全体的に見て、今日は他人と距離を置くのが賢明です。"
    },
    "scorpio": {
      "date": "2026-01-23",
      "sign": "Scorpio",
      "horoscope": "Lately, Scorpio, you might be sensing a wave of fatigue washing over you. It's crucial to listen to your body and allow yourself the rest it craves. While the allure of joining in on all the exciting activities around you is strong, remember that your well-being comes first. Don't ignore the vital signals your body is sending; take a step back and give yourself the time to recharge.",
      "horoscope_ja": "蠍座のあなたは、最近、疲労の波が押し寄せてくるのを感じているかもしれません。体の声に耳を傾け、体が求める休息を自分に与えることが大切です。周りの刺激的なアクティビティに参加したくなる気持ちは強いですが、まずは自分の健康が最優先であることを忘れないでください。体が発する重要なサインを無視せず、少し立ち止まって、エネルギーを充電する時間を取りましょう。"
    },
    "sagittarius": {
      "date": "2026-01-23",
      "sign": "Sagittarius",
      "horoscope": "Sagittarius, today is a reminder to avoid squandering your energy on someone who is unlikely to shift their perspective. It’s a day where pushing for your preferred approach could lead to frustration for both you and others. If you have a vision for how things should unfold, pursue it! However, if someone else has their own method, allow them the space to follow their path.",
      "horoscope_ja": "射手座さん、今日は、自分の視点を変えてくれそうな人にエネルギーを無駄遣いしないよう、注意喚起です。自分の好みのアプローチを押し付けると、自分自身だけでなく周りの人もフラストレーションを感じてしまう日です。物事がどう展開していくべきか、明確なビジョンがあるなら、それを追求しましょう！しかし、もし他の人が独自のやり方を持っているなら、その人の道を歩む余地を与えてあげましょう。"
    },
    "capricorn": {
      "date": "2026-01-23",
      "sign": "Capricorn",
      "horoscope": "It seems there's someone in your life, Capricorn, who is eager to deepen their connection with you. If you keep your guard up, tensions may flare this evening. While you might be inclined to respond strongly with your views, tread lightly to avoid pushing them away completely. This individual is looking to create a more personal bond, but they might be uncertain about how to approach it.",
      "horoscope_ja": "山羊座のあなた、あなたの人生には、あなたとの絆を深めたいと切望している人がいます。警戒心を強めすぎると、今夜は緊張が高まるかもしれません。自分の意見を強く主張したくなるかもしれませんが、相手を完全に拒絶しないよう、慎重に行動しましょう。その人はより親密な絆を築きたいと願っていますが、どうアプローチすればいいのか迷っているのかもしれません。"
    },
    "aquarius": {
      "date": "2026-01-23",
      "sign": "Aquarius",
      "horoscope": "While it's a breeze to attend a gathering or pick up the phone for your best friend sharing exciting news, Aquarius, consider where you stand when times get tough. It's essential to extend your support to those around you in every circumstance. Avoid being a friend only in good times. Today, your commitment to others might be challenged as tensions rise and disagreements surface.",
      "horoscope_ja": "集まりに参加したり、親友に電話をかけて楽しいニュースを伝えたりするのは簡単ですが、水瓶座さん、困難な状況に陥った時の自分の立場を考えてみてください。どんな状況でも、周りの人を支えることが大切です。良い時だけの友達でいるのは避けましょう。今日は、緊張が高まり意見の相違が表面化すると、他者への献身が試されるかもしれません。"
    },
    "pisces": {
      "date": "2026-01-23",
      "sign": "Pisces",
      "horoscope": "Pisces, be aware that your emotions are clearly visible to those around you, simply through your expressions. Trying to conceal your feelings, especially today, won't be effective. It's wiser to openly share your thoughts, even if you fear it might unsettle someone. Your emotional strength is on your side, so leverage it to express yourself authentically.",
      "horoscope_ja": "魚座の皆さん、あなたの感情は周りの人に、表情を通してはっきりと伝わってしまうことを自覚しましょう。特に今日は、感情を隠そうとしてもうまくいきません。誰かを不安にさせてしまうかもしれないと心配でも、自分の考えを率直に伝える方が賢明です。あなたは感情面で強いので、それを活かしてありのままの自分を表現しましょう。"
    }
  }
}