{
  "updated_at": "2025-12-01T16:34:53.272Z",
  "jst_date": "2025-12-02",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-02",
      "sign": "Aries",
      "horoscope": "You might believe that only seasoned surfers can conquer the towering waves. However, how can you enhance your skills if you never challenge yourself? Today is your moment. Seize the opportunity and stretch your limits. You'll discover a sense of affirmation. This is one of those incredible periods for you, where your vibrant energy shines brightly, illuminating the world around you.",
      "horoscope_ja": "熟練したサーファーだけがそびえ立つ波を征服できると信じているかもしれません。しかし、自分自身に挑戦しなければ、スキルを磨くことはできません。今日があなたのチャンスです。チャンスを掴み、限界に挑戦しましょう。きっと自信が湧いてくるでしょう。今こそ、あなたにとって素晴らしい時期です。あなたの活力に満ちたエネルギーが輝き、周りの世界を照らします。"
    },
    "taurus": {
      "date": "2025-12-02",
      "sign": "Taurus",
      "horoscope": "Today, your inner sleuth is in full swing, making it easy to uncover answers. You might sense that the real essence of situations is hidden beneath the surface. While you often glide over the surface without delving deeper, today invites you to explore the underlying currents. Expect to confront some intense emotions and turbulent feelings that are bubbling up from within.",
      "horoscope_ja": "今日はあなたの内なる探偵魂がフル稼働し、答えを見つけ出すのが容易になります。状況の本質が表面下に隠されていることを察知するかもしれません。普段は表面を滑るように流すばかりで、深く掘り下げることはありません。しかし今日は、その根底にある流れを探る機会となるでしょう。内面から湧き上がる激しい感情や、荒れ狂う感情に直面することになるでしょう。"
    },
    "gemini": {
      "date": "2025-12-02",
      "sign": "Gemini",
      "horoscope": "Today, you may find yourself experiencing life in vivid contrasts. The good moments will feel heavenly, while the challenging ones might seem overwhelming. There's little room for moderation; it's all or nothing. Embrace the intensity of your feelings, as this is a pivotal time for you. Instead of fighting against the powerful emotions swirling around you, harness that energy and channel it to your benefit.",
      "horoscope_ja": "今日は、人生において鮮やかなコントラストを体験するかもしれません。良い瞬間は至福のひとときのように感じられる一方で、困難な瞬間は手に負えないほどの重圧を感じるかもしれません。節度を保つ余地はほとんどなく、全てを受け入れるか、何も受け入れないかのどちらかです。今こそあなたにとって極めて重要な時期です。激しい感情を受け止め、受け入れましょう。周囲に渦巻く激しい感情に抗うのではなく、そのエネルギーをうまく利用し、自分の利益へと導きましょう。"
    },
    "cancer": {
      "date": "2025-12-02",
      "sign": "Cancer",
      "horoscope": "Steer clear of challenges rather than diving headfirst into them. The obstacles may not be immediately visible, so it might be wise to choose a different path. Avoid wasting your energy on pitfalls that can be sidestepped. You might find it tough to navigate your feelings today, as your instinct is to suppress or overlook them, relying instead on logic. However, this approach won't be beneficial for you right now.",
      "horoscope_ja": "困難に飛び込むのではなく、避けるようにしましょう。障害はすぐには見えないかもしれないので、別の道を選ぶのが賢明かもしれません。回避できる落とし穴にエネルギーを浪費するのは避けましょう。今日は感情を抑制したり無視したりして、論理に頼ろうとする本能があるため、感情をうまくコントロールするのが難しいと感じるかもしれません。しかし、このアプローチは今のあなたにとって有益ではありません。"
    },
    "leo": {
      "date": "2025-12-02",
      "sign": "Leo",
      "horoscope": "Today is a fantastic opportunity for you to pierce through the illusions and uncover the heart of the matter. Avoid getting caught up in trivial chats and shallow experiences; your energy is far too precious to be wasted on those who overlook the profound. Expect moments of deep reflection, meaningful discussions, and fiery romance. Allow yourself to connect with your inner sensual and sensitive self.",
      "horoscope_ja": "今日は、幻想を突き破り、物事の本質を見抜く絶好の機会です。つまらないおしゃべりや浅はかな経験に囚われないようにしましょう。あなたのエネルギーは、深遠なことを見逃すような人に浪費するにはあまりにも貴重です。深い思索、有意義な議論、そして燃え上がるロマンスの瞬間が訪れるでしょう。官能的で繊細な内なる自分と繋がってください。"
    },
    "virgo": {
      "date": "2025-12-02",
      "sign": "Virgo",
      "horoscope": "Today brings a powerful energy that might make you want to retreat. You could feel the urge to express your thoughts and then escape from the situation. Your self-assurance might not be at its peak, and you may sense that others are scrutinizing you. Keep in mind that this journey is yours to navigate, not someone else's. You have the authority to create your own guidelines and define your own expectations.",
      "horoscope_ja": "今日は、あなたを引きこもらせてしまうような強いエネルギーが流れ込んでくるかもしれません。自分の考えを表現し、その状況から逃げ出したい衝動に駆られるかもしれません。自信が持てず、周りの人が自分を詮索しているように感じるかもしれません。しかし、この旅路は他人のものではなく、あなた自身が歩む道であることを忘れないでください。あなた自身が、自分自身の指針を作り、自分自身の期待を定める力を持っているのです。"
    },
    "libra": {
      "date": "2025-12-02",
      "sign": "Libra",
      "horoscope": "Today radiates a wonderful, comforting energy. Those in your circle are affirming both your inner self and your outward presence. While feelings may run deep, your stable viewpoint allows you to navigate through any challenges. Consider whipping up a delicious meal for your loved ones. If cooking isn't on your agenda, treat yourself to a delightful dining experience at your go-to restaurant.",
      "horoscope_ja": "今日は素晴らしく心地よいエネルギーに満ちています。周りの人たちは、あなたの内面と外面の両方を肯定してくれています。感情は深く揺れ動くかもしれませんが、安定した視点があればどんな困難も乗り越えられます。愛する人のために、美味しい料理を手早く作ってみてはいかがでしょうか。料理をする時間がない場合は、行きつけのレストランで美味しい食事を楽しんでください。"
    },
    "scorpio": {
      "date": "2025-12-02",
      "sign": "Scorpio",
      "horoscope": "Today, you might find yourself grappling with a wave of emotional intensity that could touch every aspect of your day. You may question why others seem so worked up over seemingly trivial matters. This could be a sign for you to approach situations with greater seriousness and empathy. While your ability to remain detached can serve you well, it might also pose a challenge on a day like today.",
      "horoscope_ja": "今日は、一日のあらゆる側面に影響を及ぼしかねない激しい感情の波に揉まれているかもしれません。なぜ周りの人は些細なことでそんなにも動揺するのか、と疑問に思うかもしれません。これは、状況に対してより真剣さと共感を持って接すべきサインかもしれません。冷静さを保つ能力は確かに役立つかもしれませんが、今日のような日にはそれが困難になるかもしれません。"
    },
    "sagittarius": {
      "date": "2025-12-02",
      "sign": "Sagittarius",
      "horoscope": "Right now, your relationships are charged with intensity, making it seem like every issue is a matter of life and death. It's important to quiet those racing thoughts. Consider meditating, joining a yoga session, or simply focusing on your breath. Remember, things aren't as dire as they appear. This phase will eventually fade. Soon enough, you'll find yourself able to chuckle at the concerns that feel so heavy today.",
      "horoscope_ja": "今、あなたの人間関係は緊張感に満ち溢れ、あらゆる問題が生死に関わる問題のように思えるかもしれません。頭の中を駆け巡る思考を静めることが大切です。瞑想したり、ヨガのセッションに参加したり、ただ呼吸に集中したりしてみましょう。物事は見た目ほど悲惨なものではないことを忘れないでください。この時期はやがて過ぎ去ります。すぐに、今日は重苦しく感じる不安も、くすっと笑って済ませられるようになるでしょう。"
    },
    "capricorn": {
      "date": "2025-12-02",
      "sign": "Capricorn",
      "horoscope": "You might find yourself feeling burdened by a heavy emotional atmosphere today. While it can be challenging not to let this feeling consume you, try to stay grounded. A close friend may reach out, seeking your support and understanding. Remember to keep the conversation balanced; avoid making it solely about your own feelings. Today, embodying loyalty and compassion will be essential.",
      "horoscope_ja": "今日は、重苦しい感情に押しつぶされそうになるかもしれません。この感情に飲み込まれないようにするのは難しいかもしれませんが、落ち着いて冷静さを保つようにしてください。親しい友人があなたのサポートと理解を求めて手を差し伸べるかもしれません。会話はバランスの取れたものにし、自分の感情ばかりに浸らないようにしましょう。今日は、忠誠心と思いやりを体現することが不可欠です。"
    },
    "aquarius": {
      "date": "2025-12-02",
      "sign": "Aquarius",
      "horoscope": "Embrace everything you do with enthusiasm today. You might find yourself getting caught up in overthinking when your instincts are actually guiding you. Trust your inner voice; it knows the right path and how to connect with those around you. Avoid trying to control or twist circumstances to fit your desires. Today holds great potential for you to express yourself and connect with others. Open your heart to the love and compassion that is rightfully yours.",
      "horoscope_ja": "今日は、何事にも情熱を持って取り組んでください。本能が導いているのに、考えすぎてしまうこともあるかもしれません。内なる声を信じてください。正しい道と、周りの人々とどのように繋がるべきかを知っています。自分の欲望を満たすために状況をコントロールしたり、歪めたりするのはやめましょう。今日は、自分を表現し、他の人と繋がる絶好の機会です。あなたにふさわしい愛と慈悲に心を開いてください。"
    },
    "pisces": {
      "date": "2025-12-02",
      "sign": "Pisces",
      "horoscope": "Plunge into the depths today! It's not a time for skimming the surface; instead, push past your usual boundaries. While you might feel a surge of emotions in everything you tackle, let that energy ignite your enthusiasm rather than hold you back. You might find it challenging to kick off your day, tempted to lounge in bed, but once you find your momentum, you’ll discover it’s hard to hit the brakes.",
      "horoscope_ja": "今日は、深みへと飛び込んでみましょう！表面をなぞるのではなく、いつもの限界を超えていきましょう。何事にも感情が溢れてくるかもしれませんが、そのエネルギーを足止めするのではなく、情熱の火に繋げましょう。一日のスタートが難しく、ベッドでゴロゴロしたくなるかもしれませんが、一度勢いがつかめれば、ブレーキをかけるのは難しくなるでしょう。"
    }
  }
}