{
  "updated_at": "2026-02-21T18:03:40.011Z",
  "jst_date": "2026-02-22",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-22",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find yourself at your computer for a quick search, only to lose track of time and find the afternoon slipping away as you delve into captivating content. You may uncover intriguing insights into the realms of the occult and mysticism—topics that have long piqued your curiosity. With this newfound knowledge, you may feel inspired to dive deeper, perhaps even considering enrolling in a workshop to connect with like-minded individuals who share your passion.",
      "horoscope_ja": "牡羊座のあなたは今日、ちょっとした検索のためにパソコンの前に座ったものの、時間を忘れて魅力的なコンテンツに没頭し、あっという間に午後が過ぎてしまうかもしれません。オカルトや神秘主義といった、長年あなたの好奇心を掻き立ててきたテーマについて、興味深い洞察が得られるかもしれません。この新たな知識によって、さらに深く探求したいという気持ちが湧き上がり、同じ情熱を持つ仲間と繋がるためのワークショップへの参加を検討するかもしれません。"
    },
    "taurus": {
      "date": "2026-02-22",
      "sign": "Taurus",
      "horoscope": "Taurus, your financial instincts are sharper than ever today! You've stumbled upon a wealth of free investment resources online, and you're soaking up the knowledge effortlessly. Your innate understanding of finances allows you to distinguish between the fluff and the genuine advice. As a result, both your investment portfolio and your spirits are set to thrive!",
      "horoscope_ja": "おうし座さん、今日はあなたの金融に関する直感がこれまで以上に鋭敏です！オンラインで豊富な無料投資リソースを見つけ、そこから得た知識を難なく吸収しています。生まれ持った金融知識のおかげで、中身のない情報と本物のアドバイスを見分けることができます。その結果、投資ポートフォリオもあなたの精神も、ますます充実していくでしょう！"
    },
    "gemini": {
      "date": "2026-02-22",
      "sign": "Gemini",
      "horoscope": "Stay alert today, Gemini, as you might just encounter your ideal partner! Alternatively, you could unexpectedly find a pile of money. Expect the day to be quite extraordinary, so stay sharp and be receptive to new opportunities. If an exciting business proposition presents itself, resist the urge to jump in right away. Gather all the details and take some time to evaluate it when things calm down a bit.",
      "horoscope_ja": "ふたご座の皆さん、今日は油断せずに過ごしましょう。理想のパートナーに出会うかもしれません！あるいは、思いがけず大金が舞い込むかもしれません。今日は特別な一日になりそうなので、油断せずに新しいチャンスに積極的に取り組んでください。もし魅力的なビジネス案件が舞い込んできたら、すぐに飛びつきたくなる衝動を抑えましょう。詳細をすべて集め、少し落ち着いてからじっくり検討してみてください。"
    },
    "cancer": {
      "date": "2026-02-22",
      "sign": "Cancer",
      "horoscope": "The cosmos suggests that a shift in your career path could be on the horizon, Cancer, or at the very least, a new hobby might beckon. You're feeling particularly drawn to the latest tech innovations, and filmmaking is igniting your creativity. Now might be the perfect moment to enroll in a weekend workshop or treat yourself to that video camera you've been considering. This new pursuit could bring you immense joy and rejuvenation.",
      "horoscope_ja": "蟹座さん、宇宙の予感によると、キャリアパスの転換が近づいているかもしれません。少なくとも、新しい趣味があなたを誘っているかもしれません。特に最新の技術革新に惹かれ、映画制作があなたの創造性を刺激しています。週末のワークショップに参加したり、ずっと気になっていたビデオカメラを自分にご褒美として買ってみたりするには、今が絶好の機会かもしれません。この新しい探求は、あなたに計り知れない喜びと活力をもたらすでしょう。"
    },
    "leo": {
      "date": "2026-02-22",
      "sign": "Leo",
      "horoscope": "Leo, today you may find yourself yearning for far-off destinations. Perhaps you'll find yourself pausing at that travel agency you've often passed, captivated by the stunning images of places like Thailand, Hong Kong, and New Zealand. Those visuals are calling to you! Don't hesitate to start planning a getaway, even if it turns out to be a brief escape. This desire to explore reflects a deeper restlessness within you that needs to be addressed.",
      "horoscope_ja": "獅子座さん、今日は遠く離れた場所への憧れに駆られるかもしれません。もしかしたら、いつも通り過ぎていた旅行代理店に立ち寄り、タイ、香港、ニュージーランドといった美しい場所の写真に心を奪われるかもしれません。これらの光景があなたを呼んでいるのです！たとえ束の間の逃避行に終わっても、ためらわずに旅行の計画を立て始めましょう。この探求心は、あなたの中に潜む、より深い不安の表れであり、それに対処する必要があります。"
    },
    "virgo": {
      "date": "2026-02-22",
      "sign": "Virgo",
      "horoscope": "Embracing change can be daunting, even when it leads to positive outcomes, Virgo. You might find yourself feeling uncertain about a new job offer or making improvements to your living space. However, this is a fantastic chance that has come your way. If you let it slip by, you may look back with regret. Remember, what’s unfolding is ultimately for your benefit, so raise your arms and go after that golden opportunity!",
      "horoscope_ja": "乙女座さん、変化を受け入れるのは、たとえ良い結果につながるとしても、気が遠くなるようなことかもしれません。新しい仕事のオファーや住居のリフォームなど、不安に感じることもあるかもしれません。しかし、これはまさにあなたの前に現れた素晴らしいチャンスです。この機会を逃してしまうと、後悔することになるかもしれません。今起こっていることは、最終的にはあなたの利益になることを忘れないでください。さあ、両手を上げて、この絶好の機会を掴みましょう！"
    },
    "libra": {
      "date": "2026-02-22",
      "sign": "Libra",
      "horoscope": "Opportunities are abundant, and you might feel the urge to grab them all, Libra. However, a touch of discernment will help you navigate this favorable energy effectively. Travel is on the horizon, along with the chance to expand your knowledge. This could be as straightforward as signing up for a cooking class at a local community center, or you might take a significant step towards a long-held dream by applying to business school. Kudos to you!",
      "horoscope_ja": "天秤座のあなたは、チャンスに溢れ、全て掴み取りたい衝動に駆られるかもしれません。しかし、少しの洞察力があれば、この好ましいエネルギーをうまく乗り切ることができるでしょう。旅行が間近に迫っており、知識を広げるチャンスも訪れます。地元のコミュニティセンターで料理教室に申し込むといったシンプルな方法もあれば、ビジネススクールに出願することで長年の夢への大きな一歩を踏み出すことも可能です。素晴らしいですね！"
    },
    "scorpio": {
      "date": "2026-02-22",
      "sign": "Scorpio",
      "horoscope": "Today, you may find yourself on the receiving end of a financial boost, Scorpio. Exercise caution with this newfound fortune. If you make smart investments, it could benefit you for a long time. Your interest in intriguing and perhaps mysterious subjects is growing, especially in areas like the dark arts. Consider heading to your local library to explore some literature on these captivating themes.",
      "horoscope_ja": "蠍座のあなたは、今日、経済的な恩恵を受けるかもしれません。しかし、この新たな幸運には注意が必要です。賢明な投資をすれば、長期的に恩恵を受けることができるでしょう。特に闇の魔術のような、興味深く、時には謎めいたテーマへの関心が高まっています。地元の図書館に行って、これらの魅力的なテーマに関する本を探してみるのも良いでしょう。"
    },
    "sagittarius": {
      "date": "2026-02-22",
      "sign": "Sagittarius",
      "horoscope": "Get ready for a shift in your surroundings, Sagittarius! Whether this change is by choice or not remains uncertain, but expect a whirlwind of activity and some disarray in the coming days. There's a lot on your plate, but your knack for organization will shine through. You’ll take charge like a commander, clipboard in hand, rallying everyone to follow your lead. Before you know it, the transition will be wrapped up in no time!",
      "horoscope_ja": "射手座のあなた、環境の変化に備えてください！この変化が自分の意思によるものかどうかはまだ分かりませんが、これから数日間は目まぐるしい活動と多少の混乱が予想されます。やるべきことは山積みですが、あなたの組織力は光るでしょう。クリップボードを手に、指揮官のように指揮を執り、皆を率いて自分の指揮に従わせるでしょう。あっという間に、変化は終わるでしょう！"
    },
    "capricorn": {
      "date": "2026-02-22",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you might find yourself feeling anxious about your job security. However, there's no need to worry—these concerns are likely exaggerated. There's quite a bit of chaos happening in your workplace, so it's wise to keep your distance from it if possible. By maintaining your strong performance, you could be in line for a bonus or promotion as a reward for your hard work. You truly deserve it!",
      "horoscope_ja": "山羊座のあなたは、今日、仕事の安定について不安を感じているかもしれません。しかし、心配する必要はありません。おそらく、その不安は誇張されているだけです。職場ではかなりの混乱が起きているので、可能であれば距離を置くのが賢明です。好調を維持すれば、努力が報われ、ボーナスや昇進が期待できるかもしれません。あなたは本当にそれに値するのです！"
    },
    "aquarius": {
      "date": "2026-02-22",
      "sign": "Aquarius",
      "horoscope": "The magnetic pull of chemistry with another individual is undeniable. Today, you may encounter someone new, or perhaps you've recently crossed paths with someone who captivates your thoughts, Aquarius. This person is hard to shake off your mind. It's uncertain if this connection will blossom into a fleeting affair or evolve into something more enduring. Regardless of the outcome, the thrill of feeling so invigorated and alive is exhilarating.",
      "horoscope_ja": "人との相性がもたらす磁力は、紛れもなく魅力的です。今日、水瓶座のあなたは新しい人に出会うかもしれませんし、もしかしたら最近、心を奪われる人と出会ったかもしれません。その人は、なかなか忘れられない存在です。この繋がりが束の間の恋に発展するのか、それともより永続的なものに発展するのかは分かりません。結果がどうであれ、この爽快感と活力に満ちた感覚は、まさに爽快です。"
    },
    "pisces": {
      "date": "2026-02-22",
      "sign": "Pisces",
      "horoscope": "You might resonate with the saying, \"The one with the most toys wins,\" Pisces. Today, you're definitely making strides in that direction as you welcome yet another gadget into your space. What new marvel are you bringing home? Perhaps a scanner, a digital camera, a DVD player, or maybe even a combination of them all? Treating yourself to these little luxuries is well-deserved after all the effort you put in. If these items bring you joy, then go ahead and enjoy them!",
      "horoscope_ja": "魚座のあなたは、「おもちゃをたくさん持っている人が勝つ」という格言に共感するかもしれません。今日、あなたは間違いなくその方向に大きく前進し、新たなガジェットを家に迎え入れます。どんな新しい驚きを家に持ち帰りますか？スキャナー、デジタルカメラ、DVDプレーヤー、あるいはそれらを全部組み合わせたものかもしれません。せっかくの努力の甲斐あって、こうしたちょっとした贅沢を自分にご褒美として買ってあげるのは、当然のことです。もしこれらのアイテムがあなたに喜びをもたらすなら、ぜひ楽しんでください！"
    }
  }
}