{
  "updated_at": "2025-12-30T16:33:20.239Z",
  "jst_date": "2025-12-31",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-31",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find your passion for new ambitions sparked by a social gathering or group meeting. These aspirations could allow you to showcase your creative skills while also relishing the company and support of your peers. So, any events on your agenda today are likely to be fulfilling and fun. Embrace the moment! Take the initiative, engage in something meaningful, and have a great time.",
      "horoscope_ja": "牡羊座のあなたは今日、社交の場やグループミーティングで、新たな野心への情熱が燃え上がるかもしれません。こうした野心は、あなたの創造力を発揮すると同時に、仲間との交流やサポートを味わう機会となるでしょう。ですから、今日の予定はどれも充実感と楽しさに満ち溢れたものになるでしょう。この瞬間を大切に！率先して、何か意義のあることに積極的に参加し、素晴らしい時間を過ごしましょう。"
    },
    "taurus": {
      "date": "2025-12-31",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find yourself diving into a long-desired project, whether it's tied to your career or a personal passion. This endeavor is likely to propel you forward on your chosen path. However, be cautious of being overly critical and harsh on yourself regarding your progress. Aim to adopt a more objective perspective, assessing your work with the same fairness you would apply to others' efforts.",
      "horoscope_ja": "おうし座のあなたは今日、キャリアに関係するものであれ、個人的な情熱に関係するものであれ、長年の夢だったプロジェクトに飛び込むかもしれません。この努力は、あなたが選んだ道を前進させる原動力となるでしょう。しかし、自分の進歩について過度に批判的になったり、厳しく評価したりしないように注意しましょう。より客観的な視点を持ち、他人の努力と同じように公平に自分の仕事を評価するようにしましょう。"
    },
    "gemini": {
      "date": "2025-12-31",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you're set to broaden your perspectives. You and a companion might be organizing an exciting getaway that has you buzzing with anticipation. This adventure could take you flying, possibly over the ocean. While the primary goal is enjoyment, it also leads you to a destination you've long been curious about, making it a journey of discovery too. There's so much to anticipate, so embrace it and enjoy every moment!",
      "horoscope_ja": "ふたご座のあなたは、今日、視野を広げるチャンスに恵まれています。パートナーとワクワクする旅行を計画し、ワクワクドキドキワクワクの旅に出るかもしれません。この冒険では、空を飛び、もしかしたら海の上を飛ぶかもしれません。本来の目的は楽しむことですが、同時に、ずっと気になっていた目的地へと導いてくれる、発見の旅でもあります。期待することはたくさんあります。それを受け入れ、一瞬一瞬を楽しんでください！"
    },
    "cancer": {
      "date": "2025-12-31",
      "sign": "Cancer",
      "horoscope": "You might hear some exciting news about your professional life today, Cancer! This could be related to a salary increase, fresh benefits, or even new profit-sharing opportunities. Keep an eye out for any financial gains that extend beyond your regular paycheck. If you have any contracts or legal documents waiting to be signed, today is the perfect day to finalize them, as they are likely to turn out in your favor!",
      "horoscope_ja": "蟹座のあなたは、今日、仕事に関する嬉しいニュースを聞くかもしれません！昇給、新しい福利厚生、あるいは新たな利益分配の機会など、様々なものがあります。普段の給料以外にも、何か経済的なメリットがあるかもしれません。もし署名を待っている契約書や法的書類があるなら、今日はそれらを締結するのに最適な日です。きっとあなたにとって有利な結果になるでしょう！"
    },
    "leo": {
      "date": "2025-12-31",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might encounter a thrilling new romantic possibility that could sweep you off your feet! This could be one of those electrifying connections that makes your heart race and your senses come alive. Whether you choose to explore this spark is up to your circumstances, but regardless of your choice, revel in the excitement it brings. So, be sure to put your best foot forward when you step out—you'll appreciate the effort!",
      "horoscope_ja": "獅子座さん、今日はあなたを夢中にさせるような、スリリングで新しい恋愛の可能性に出会うかもしれません！それは、心臓が高鳴り、五感が研ぎ澄まされるような、刺激的な出会いかもしれません。この刺激的な出会いを実際に体験するかどうかは状況次第ですが、どちらを選ぶにせよ、その刺激的な瞬間を存分に楽しんでください。ですから、一歩踏み出す時は、全力を尽くしてください。きっとその努力は報われるでしょう！"
    },
    "virgo": {
      "date": "2025-12-31",
      "sign": "Virgo",
      "horoscope": "Virgo, today is a day brimming with energy and excitement for you! It's the perfect time to embark on a new venture, especially one related to your home or any aspect of self-improvement. You may find yourself faced with multiple opportunities—one could spark your creativity, while another might be more routine. Whichever path you choose, be prepared for a busy period ahead. Dive in and give it your all!",
      "horoscope_ja": "おとめ座さん、今日はエネルギーとワクワク感に溢れる一日です！新しいことに挑戦するのに最適な時期です。特に家事や自己啓発など、何か新しいことに挑戦するのにぴったりです。いくつものチャンスに直面するかもしれません。創造性を刺激するチャンスもあれば、よりルーティンワークに近いチャンスもあるかもしれません。どの道を選ぶにせよ、これからの忙しい時期に備えてください。思い切って飛び込んで、全力を尽くしましょう！"
    },
    "libra": {
      "date": "2025-12-31",
      "sign": "Libra",
      "horoscope": "Libra, you may find yourself dedicating a significant portion of your time and energy to organizing a party or social event. There could be numerous messages to send, calls to make, or other forms of communication to manage, but this presents a wonderful opportunity to reconnect with your friends. Think of today as a prelude to the festivities, perfectly suited to your social nature. Have a fantastic day!",
      "horoscope_ja": "天秤座さん、パーティーや社交イベントの企画に、かなりの時間とエネルギーを費やすことになるかもしれません。たくさんのメッセージを送ったり、電話をかけたり、その他様々なコミュニケーション手段を管理したりする必要があるかもしれませんが、これは友人と再びつながる絶好の機会です。今日は、あなたの社交的な性格にぴったりの、お祭りへの前触れだと考えてください。素晴らしい一日をお過ごしください！"
    },
    "scorpio": {
      "date": "2025-12-31",
      "sign": "Scorpio",
      "horoscope": "You may start your day feeling a bit under the weather, Scorpio, but don’t worry—by the afternoon, your vibrant self will return. Focus your energy on tackling those tedious tasks and chores that you’d prefer to avoid. Once you’ve checked those off your list, you can dive into the projects that truly inspire you and ignite your passion. Put in the hard work this morning, and you’ll be free to relish the rest of your day.",
      "horoscope_ja": "蠍座のあなたは、今日は少し体調が優れないかもしれませんが、心配しないでください。午後には元気な自分に戻ります。避けたい退屈な仕事や雑用に取り組むことにエネルギーを集中しましょう。それらを片付けたら、心からインスピレーションを受け、情熱を燃やせるプロジェクトに没頭しましょう。今朝は一生懸命頑張れば、残りの一日を思う存分満喫できるはずです。"
    },
    "sagittarius": {
      "date": "2025-12-31",
      "sign": "Sagittarius",
      "horoscope": "Today is an excellent opportunity for you, Sagittarius, to embark on any endeavors related to writing, acting, or public speaking. Your creative juices are likely to be flowing effortlessly, bringing a delightful surge of fresh ideas your way. Engaging discussions with your close friends will further fuel your enthusiasm. Be prepared to spend plenty of time chatting on the phone or perhaps driving around to visit these friends. Make the most of your day!",
      "horoscope_ja": "射手座のあなたにとって、今日は執筆、演技、スピーチなど、あらゆることに着手する絶好の機会です。創造力が自然と湧き上がり、新鮮なアイデアが次々と湧き出てくるでしょう。親しい友人との楽しい議論は、あなたの情熱をさらに燃え上がらせるでしょう。電話でたっぷりおしゃべりしたり、車で友人たちに会いに行ったりする時間も十分に取る覚悟をしておきましょう。今日という日を精一杯楽しんでください！"
    },
    "capricorn": {
      "date": "2025-12-31",
      "sign": "Capricorn",
      "horoscope": "Capricorn, if you haven't yet explored the realms of real estate, gardening, or interior design, today could unveil a hidden knack for one or more of these areas, prompting you to delve deeper. You may see potential for a future income stream, leading you to contemplate formal training in your chosen field. Ultimately, the decision lies in your hands. Take the time to weigh your options thoughtfully before making a choice.",
      "horoscope_ja": "山羊座のあなた、もしあなたがまだ不動産、ガーデニング、インテリアデザインといった分野に足を踏み入れたことがないなら、今日はこれらの分野のいずれか、あるいは複数の隠れた才能が開花し、より深く探求するきっかけとなるかもしれません。将来の収入源となる可能性を感じ、選んだ分野の正式な研修を受けることを検討するかもしれません。最終的な決定はあなた自身に委ねられています。決断を下す前に、時間をかけて選択肢を慎重に検討してください。"
    },
    "aquarius": {
      "date": "2025-12-31",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, your vitality and zest for life are likely to be at their peak! This is a perfect opportunity to connect with friends, and you might feel inspired to throw together a spontaneous gathering. Expect to be engaged in lively discussions and thrilling updates that will keep your mind active for hours. As the day progresses, you may find the need to channel some of that abundant energy, so consider going for a brisk walk or hitting the gym. Have a fantastic day!",
      "horoscope_ja": "水瓶座さん、今日はあなたのバイタリティと人生への情熱が最高潮に達しそうです！友人と交流する絶好の機会です。思いつきで集まりを企画するかもしれません。活発な議論や刺激的な最新情報に浸り、何時間も頭が冴え続けるでしょう。日が進むにつれて、溢れんばかりのエネルギーを発散させる必要性に気づくかもしれません。さあ、軽めの散歩やジムでのトレーニングを検討してみてはいかがでしょうか。素晴らしい一日をお過ごしください！"
    },
    "pisces": {
      "date": "2025-12-31",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you might stumble upon an opportunity to earn some extra cash through a casual acquaintance, possibly linked to a social gathering you both attended in the past. While the nature of the work may be somewhat unfamiliar to you, your mental acuity is heightened today, allowing you to grasp new concepts swiftly. Just be cautious, as you might find yourself putting in more effort than necessary, which could lead to exhaustion. Remember to prioritize your well-being.",
      "horoscope_ja": "魚座のあなたは今日、偶然の知り合いを通して、ちょっとした収入を得るチャンスに出会うかもしれません。もしかしたら、過去に二人で参加した社交の場がきっかけかもしれません。仕事の内容はあなたにとって馴染みのないものであるかもしれませんが、今日は思考力が研ぎ澄まされており、新しい概念を素早く理解することができます。ただし、必要以上に努力しすぎて疲れ切ってしまう可能性があるので、注意が必要です。健康を最優先にしてください。"
    }
  }
}