{
  "updated_at": "2026-01-24T16:30:39.265Z",
  "jst_date": "2026-01-25",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-25",
      "sign": "Aries",
      "horoscope": "Today, love flourishes as you and your partner enjoy a deeper connection, Aries. There's a newfound ease when you're together, and you both present a strong, cohesive image to those around you. Later, you might join a group of friends for a fun outing. Anticipate engaging and intriguing conversations that will likely carry on when it's just the two of you. Enjoy the moment!",
      "horoscope_ja": "牡羊座さん、今日はパートナーとの絆が深まり、愛が花開きます。一緒にいると新たな安らぎを感じ、周りの人々に力強くまとまりのある印象を与えます。その後は、友人グループと楽しいお出かけに出かけるかもしれません。二人きりになった時も、きっと魅力的で興味深い会話が続くでしょう。この瞬間を心ゆくまでお楽しみください！"
    },
    "taurus": {
      "date": "2026-01-25",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find your home bustling with visitors, likely gathering to chat about shared interests. While some heated debates could surface, you have the ability to maintain harmony. Your sharp intellect, combined with your intuitive insights, will help you grasp and clarify intricate concepts, allowing you to prevent any potential miscommunications before they escalate. Offering delicious snacks could also be a great way to ease any tension.",
      "horoscope_ja": "おうし座のあなたは、今日、あなたの家にはたくさんの人が訪れ、共通の趣味について語り合うでしょう。激しい議論が巻き起こることもあるでしょうが、あなたは調和を保つ力を持っています。鋭い知性と直感的な洞察力を組み合わせることで、複雑な概念を理解し、明確に理解し、誤解がエスカレートする前に防ぐことができます。美味しいおやつを振る舞うことも、緊張を和らげる良い方法かもしれません。"
    },
    "gemini": {
      "date": "2026-01-25",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, if you have a passion for technology and the digital world, prepare to immerse yourself in screen time. Whether you're engaged in writing, web design, or animation, your output is likely to surpass your usual standards. The blend of intellect and intuition will spark creativity and provide valuable insights. Seize this opportunity, and you could cultivate new skills that stick with you for the long haul!",
      "horoscope_ja": "ふたご座のあなた、もしテクノロジーとデジタルの世界に情熱を感じているなら、今日はスクリーンタイムに没頭する準備をしましょう。ライティング、ウェブデザイン、アニメーションなど、どんな分野でも、あなたのアウトプットは普段の水準をはるかに超えるものになるでしょう。知性と直感の融合が創造性を刺激し、貴重な洞察をもたらすでしょう。この機会を逃さず掴めば、長く役立つ新しいスキルを身につけることができるかもしれません！"
    },
    "cancer": {
      "date": "2026-01-25",
      "sign": "Cancer",
      "horoscope": "Cancer, today you might find that the world of computers—whether for boosting your earnings or handling your finances—becomes much clearer. Your innate practicality is paired with a sharper intellect and a surge of intuition, providing you with a unique edge. If you dedicate yourself to mastering these skills today, they could serve you well for a long time to come. Dive in!",
      "horoscope_ja": "蟹座のあなたは、今日、収入を増やすためでも、家計管理のためでも、コンピューターの世界がより鮮明になるかもしれません。持ち前の実用性に加え、鋭敏な知性と鋭い直感が相まって、他にはない強みを生み出しています。今日、これらのスキルを習得することに専念すれば、きっと長く役立つはずです。さあ、飛び込んでみましょう！"
    },
    "leo": {
      "date": "2026-01-25",
      "sign": "Leo",
      "horoscope": "Today, Leo, your intellect and emotions are beautifully intertwined, particularly in your interactions with friends. Your ability to understand others is heightened by a sharper intuition. You may find yourself drawn to a cause that resonates with you, whether it's metaphysical, social, ecological, or humanitarian. It's likely that several causes will catch your interest at this time. Harness your enhanced mental and emotional insights to determine which ones truly align with your values.",
      "horoscope_ja": "獅子座さん、今日はあなたの知性と感情が美しく絡み合い、特に友人との交流において顕著です。鋭敏な直感によって、他者を理解する能力がさらに高まります。形而上学的なもの、社会的なもの、環境問題、人道的なものなど、心に響く活動に惹かれるかもしれません。この時期は、複数の活動に興味を持つ可能性が高いでしょう。研ぎ澄まされた精神的・感情的な洞察力を活かし、どれがあなたの価値観と真に合致するのかを見極めましょう。"
    },
    "virgo": {
      "date": "2026-01-25",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, your sharpened focus and intuitive insights can be invaluable as you navigate career-related decisions. There's a shift on the horizon, and it's wise to explore the various opportunities that may be presenting themselves. Remember, there's no need to hurry into a choice. Allow yourself some time to let these possibilities marinate in your mind for a day or two.",
      "horoscope_ja": "乙女座のあなた、今日はキャリアに関する決断を下す上で、研ぎ澄まされた集中力と直感的な洞察力が大きな力となるでしょう。変化の兆しが見えているので、目の前に現れている様々な機会を探るのが賢明です。決断を急ぐ必要はありません。1、2日ほど時間を取って、これらの可能性をじっくりと頭の中で考えてみましょう。"
    },
    "libra": {
      "date": "2026-01-25",
      "sign": "Libra",
      "horoscope": "Today, Libra, you might find yourself yearning for the outside world rather than staying at home. Whether you're mingling at a bustling event or simply wandering through the city, you'll be soaking in the sights and sounds around you. Expect to have some enlightening thoughts and realizations that you'll grasp more clearly than usual, as your intellect and emotions are harmoniously aligned. Be sure to jot down your insights! Have a wonderful day!",
      "horoscope_ja": "天秤座のあなたは今日、家にこもるよりも外の世界に憧れるかもしれません。賑やかなイベントで交流したり、街をぶらぶら歩いたりしながら、周囲の光景や音に浸ることでしょう。知性と感情が調和し、いつもより鮮明に理解できる、啓発的な考えや気づきが生まれるでしょう。気づいたことは必ずメモしておきましょう！素敵な一日を！"
    },
    "scorpio": {
      "date": "2026-01-25",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, your creativity is soaring to new heights! Your mind and instincts are merging in a dynamic and powerful way, creating a synergy that’s truly remarkable. Seize this moment and channel this vibrant energy into your current creative endeavors, or kick off a new project if you don’t have one in the works. This burst of inspiration might not return soon, so make sure to take full advantage of it. Enjoy the process!",
      "horoscope_ja": "蠍座のあなた、今日はあなたの創造性が新たな高みへと舞い上がります！あなたの精神と本能がダイナミックかつ力強く融合し、真に素晴らしい相乗効果を生み出しています。この瞬間を捉え、この活力あるエネルギーを現在のクリエイティブな取り組みに注ぎ込みましょう。もしまだ計画していないなら、新しいプロジェクトを立ち上げてみてはいかがでしょうか。このインスピレーションの爆発はすぐには戻ってこないかもしれません。だからこそ、この瞬間を最大限活用し、そのプロセスを楽しんでください！"
    },
    "sagittarius": {
      "date": "2026-01-25",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, your mind may wander to distant places, sparking a desire to take a break and explore a destination you've long dreamed of visiting. A friend or romantic partner may express interest in joining you on this adventure. The challenge lies in choosing the perfect spot to explore, which could lead to some tough choices. Remember, don’t let this decision weigh heavily on you—trust your instincts and let your heart guide you.",
      "horoscope_ja": "射手座のあなたは、今日、遠い場所へと心をさまよわせ、休暇を取ってずっと夢見てきた目的地を探検したいという気持ちが湧き上がるかもしれません。友人や恋人が、この冒険に一緒に行きたいと言ってくれるかもしれません。問題は、探検に最適な場所を選ぶこと。難しい選択を迫られるかもしれません。しかし、この決断に重荷を背負い込まないでください。自分の直感を信じ、心の導きに身を任せましょう。"
    },
    "capricorn": {
      "date": "2026-01-25",
      "sign": "Capricorn",
      "horoscope": "Tonight, Capricorn, you may experience some intriguing dreams that leave you feeling they hold significant meaning. The visuals are likely to be vivid, making it easier for you to decipher their messages. Today, your intellect and intuition will merge, providing you with a surge of clarity and understanding. Seize this opportunity to harness your insights, and take your time later to determine the best course of action based on your newfound revelations.",
      "horoscope_ja": "今夜、山羊座のあなたは、何か意味深な、興味深い夢を見るかもしれません。鮮明な映像で、そのメッセージを読み解くのがより容易になるでしょう。今日は、知性と直感が融合し、明晰さと理解力が一気に高まります。この機会を捉えて洞察力を高め、その後は時間をかけて、新たな発見に基づいて最善の行動方針を決めましょう。"
    },
    "aquarius": {
      "date": "2026-01-25",
      "sign": "Aquarius",
      "horoscope": "Aquarius, this is a wonderful time for all your relationships to flourish. Your intellect and emotions are harmonizing beautifully, allowing you to deepen your connections with those you care about. In particular, your romantic relationships are set to grow stronger as you gain a clearer insight into your partner's values, beliefs, and motivations. Share these newfound understandings with those around you, but consider doing so in a more understated manner rather than through direct conversation, as the latter may come off as condescending.",
      "horoscope_ja": "水瓶座のあなたにとって、今はあらゆる人間関係が豊かになる素晴らしい時期です。知性と感情が美しく調和し、大切な人との絆を深めることができます。特に恋愛関係は、パートナーの価値観、信念、そして動機をより深く理解することで、より強固なものになるでしょう。これらの新たな理解を周りの人と共有しましょう。ただし、直接的な会話は相手を見下したように受け取られる可能性があるため、控えめな表現にするようにしましょう。"
    },
    "pisces": {
      "date": "2026-01-25",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you'll find that tasks of all sorts are completed much more swiftly with the help of friends or family who are eager to lend a hand. This collaboration is a result of your ability to blend intellect with emotion, enhancing your communication skills. The adage \"You catch more flies with honey than with vinegar\" rings especially true for you today, and you'll discover just how effective this approach can be! Once everything is wrapped up, consider celebrating with a spontaneous gathering!",
      "horoscope_ja": "魚座のあなたは今日、あらゆるタスクが、喜んで手を貸してくれる友人や家族の助けを借りれば、はるかに早く完了することに気づくでしょう。この協力関係は、あなたの知性と感情を融合させ、コミュニケーション能力を高める能力の賜物です。「酢よりも蜂蜜でハエを捕まえる」という格言は、今日のあなたに特に当てはまります。そして、このアプローチがどれほど効果的であるかを実感するでしょう！すべてが終わったら、思いつきで集まってお祝いしてみてはいかがでしょうか！"
    }
  }
}