{
  "updated_at": "2025-12-28T16:30:20.396Z",
  "jst_date": "2025-12-29",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-29",
      "sign": "Aries",
      "horoscope": "Today is a day of positive energy for you, Aries, and you'll likely enjoy the warmth and companionship of those around you. There's a whimsical vibe in the air that may make your feelings feel a bit unanchored, so embrace it! If you can, let go of the need to be grounded in reality. Consider visiting an art gallery, catching a dance show, enjoying a film, or dining at your favorite eatery.",
      "horoscope_ja": "牡羊座のあなたにとって、今日はポジティブなエネルギーに満ちた日です。周りの人たちの温かさや友情をきっと楽しめるでしょう。空気中に漂う気まぐれな雰囲気に、少し気持ちが落ち着かない気分になるかもしれませんが、それを受け入れましょう！もし可能であれば、現実に縛られることを忘れましょう。美術館を訪れたり、ダンスショーを見たり、映画を楽しんだり、お気に入りのレストランで食事をしたりしてみてはいかがでしょうか。"
    },
    "taurus": {
      "date": "2025-12-29",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, resist the urge to seek definitive answers, as it may lead to more frustration than clarity. Instead of trying to impose your desires on others, you'll discover that things tend to align in your favor more effortlessly. Focus on appreciating the knowledge and achievements you've already gained rather than stressing over unresolved issues. Embrace a lighthearted approach.",
      "horoscope_ja": "おうし座の皆さん、今日は明確な答えを求める衝動を抑えましょう。それは、明確な答えよりもむしろフラストレーションにつながる可能性があります。自分の願望を他人に押し付けようとするのではなく、物事はもっと簡単に自分の思い通りに物事が進むことに気づくでしょう。未解決の問題に悩むよりも、これまでに得た知識や成果に感謝することに集中しましょう。気楽なアプローチを大切にしましょう。"
    },
    "gemini": {
      "date": "2025-12-29",
      "sign": "Gemini",
      "horoscope": "Embrace your playful spirit today, Gemini! Your imagination is vibrant, so allow it to guide you. Engage in fun chats with friends about the newest films and your go-to online spots. It’s also a great time to think about hitting the gym or refreshing your hairstyle. Focus on enhancing your overall look, as your appreciation for beauty is heightened today.",
      "horoscope_ja": "ふたご座さん、今日は遊び心を大切に！想像力が豊かなので、その力に身を任せましょう。最新の映画やお気に入りのオンラインスポットについて、友達と楽しい会話を楽しみましょう。ジム通いやヘアスタイルのリフレッシュを考えるのにも最適な時期です。美への意識が高まる今日この日、全体的なルックスの向上に意識を向けてみましょう。"
    },
    "cancer": {
      "date": "2025-12-29",
      "sign": "Cancer",
      "horoscope": "Cancer, it's time to step away from your usual route and explore uncharted territory. Today invites you to pursue your aspirations and creative thoughts instead of getting bogged down by obligations or seeking definitive answers. Embrace curiosity and engage in lively discussions. Above all, make sure to enjoy yourself! This is an ideal day for outdoor adventures, particularly those involving friends. Gather your pals and share stories about the latest happenings in your life while soaking up the fresh air.",
      "horoscope_ja": "蟹座のあなた、いつもの道を外れ、未知の領域を探検する時です。今日は、義務に縛られたり、明確な答えを求めたりするのではなく、自分の夢や創造的な思考を追求する日です。好奇心を持ち、活発な議論に参加しましょう。何よりも、楽しむことが大切です！今日はアウトドアアドベンチャー、特に友人との冒険に最適な日です。仲間を集めて、新鮮な空気を吸いながら、最近の出来事を語り合いましょう。"
    },
    "leo": {
      "date": "2025-12-29",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might struggle to view your feelings with clarity. A delicate matter could be weighing heavily on you, making it feel as though you're disconnected from those around you. It may be wise to let someone else take charge for a change, allowing a sense of balance to develop before you make any further choices.",
      "horoscope_ja": "獅子座さん、今日は自分の感情を冷静に捉えるのが難しいかもしれません。デリケートな問題が重くのしかかり、周りの人々と疎遠になっているように感じるかもしれません。少しの間、誰かに主導権を委ね、バランス感覚を養ってから、次の決断を下すのが賢明かもしれません。"
    },
    "virgo": {
      "date": "2025-12-29",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, take a moment to scrutinize the validity of any conflicts that arise. You may discover that others are operating on partial truths, leading to misunderstandings or unfounded accusations against you. Strive to restore balance by clarifying the facts and revealing the true intentions behind the situation. Remember, emotions may run high, so approach your interactions with care and sensitivity.",
      "horoscope_ja": "乙女座の皆さん、今日は少しでも時間を取って、生じた対立の妥当性を吟味してみましょう。相手が不完全な真実に基づいて行動し、誤解や根拠のない非難を招いていることに気づくかもしれません。事実を明らかにし、状況の背後にある真意を明らかにすることで、バランスを取り戻すよう努めましょう。感情が高ぶることもあるので、注意深く、繊細に接することが大切です。"
    },
    "libra": {
      "date": "2025-12-29",
      "sign": "Libra",
      "horoscope": "Today, Libra, it seems like a light bulb has gone off, revealing the final piece of a puzzle you've been piecing together for some time. The insights you seek might be understated, yet they are present. Embrace your imaginative side and a sense of playfulness, as they will guide you to these revelations with ease. Share your thoughts with the world today and foster an atmosphere that invites others to partake in your whimsical visions.",
      "horoscope_ja": "天秤座さん、今日はまるで電球が点灯したかのようです。長い間組み立ててきたパズルの最後のピースが姿を現したのです。あなたが求めている洞察は控えめかもしれませんが、確かにそこにあります。想像力と遊び心を大切にしてください。それらが、あなたを容易にこれらの啓示へと導いてくれるでしょう。今日はあなたの考えを世界と共有し、他の人々があなたの気まぐれなビジョンに加わりたくなるような雰囲気を醸し出してください。"
    },
    "scorpio": {
      "date": "2025-12-29",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you might find the world around you feeling a bit dreamlike, so try not to get too caught up in what others are saying. It's a perfect moment to connect with someone special, so don’t hesitate to make that call. Share your aspirations, no matter how outlandish they may appear. People might give you puzzled looks, but as long as you stay true to yourself, there's no need to hold back.",
      "horoscope_ja": "蠍座のあなた、今日は周りの世界が少し夢のように感じてしまうかもしれません。周りの人の言うことにあまり囚われすぎないようにしましょう。大切な人と繋がる絶好の機会です。ためらわずに連絡してみてください。どんなに突飛に見えても、あなたの夢をぜひ伝えてください。周りの人は不思議そうな顔をするかもしれませんが、自分に忠実でいられる限り、遠慮する必要はありません。"
    },
    "sagittarius": {
      "date": "2025-12-29",
      "sign": "Sagittarius",
      "horoscope": "Today is a wonderful opportunity for you, Sagittarius, to indulge in lively and playful exchanges with those around you. Expect your imagination to take center stage, and you might catch yourself lost in daydreams as you stroll through your day. If possible, steer clear of the mundane and embrace a more whimsical vibe. It's a perfect time to keep things lighthearted and fun. Dive into your imaginative realm and don’t hesitate to share it with others!",
      "horoscope_ja": "射手座のあなたにとって、今日は周りの人と活発で遊び心のある交流を楽しむ絶好の機会です。想像力が中心となり、日々を過ごしながらも空想にふけってしまうかもしれません。可能であれば、日常から離れ、もっと気まぐれな雰囲気を取り入れてみてください。軽快で楽しい時間を過ごしたいなら、まさにうってつけの時間です。想像力の世界に飛び込み、それをためらわずに他の人と共有しましょう！"
    },
    "capricorn": {
      "date": "2025-12-29",
      "sign": "Capricorn",
      "horoscope": "Today might bring a sense of confusion for you, Capricorn, as you find yourself eager to take action, yet the full picture isn't quite clear. Making decisions could prove challenging with the details feeling obscured. Instead of diving into significant choices or commitments, consider spending your time with friends or indulging in a beloved hobby.",
      "horoscope_ja": "山羊座のあなたにとって、今日は混乱を招くかもしれません。行動を起こしたい気持ちはあるものの、全体像がはっきりとしていないように感じるからです。細部が曖昧なため、決断を下すのが難しくなるかもしれません。重要な選択や約束に飛び込むのではなく、友人と過ごしたり、大好きな趣味に没頭したりすることを検討してみてください。"
    },
    "aquarius": {
      "date": "2025-12-29",
      "sign": "Aquarius",
      "horoscope": "Today, embrace your inner leading actor, Aquarius, and take pride in the unique role you embody. You may find yourself channeling various characters as your mood shifts throughout the day. Your smile radiates a special charm that deserves to be shared with those around you. There's no need to hurry; you've already reached your destination. Relish the moments spent with your loved ones.",
      "horoscope_ja": "水瓶座のあなた、今日はあなたの内なる主役を受け止め、あなたが体現する唯一無二の役割に誇りを持ってください。一日を通して気分が移り変わり、様々なキャラクターを演じている自分に気づくかもしれません。あなたの笑顔は、周りの人々と分かち合う価値のある特別な魅力を放っています。急ぐ必要はありません。あなたはすでに目的地に到着しています。愛する人たちと過ごすひとときを心ゆくまで味わいましょう。"
    },
    "pisces": {
      "date": "2025-12-29",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, it's time to step away from your usual routine and explore new avenues. The universe is in your favor, allowing you to disconnect for a bit. Trust that any direction you choose is the right one for you. Let go of regret; it serves no purpose. Embrace the day and savor the little pleasures it brings. Share your aspirations and work towards achieving harmony in your life.",
      "horoscope_ja": "魚座の皆さん、今日は普段のルーティンから抜け出し、新しい道を模索する時です。宇宙はあなたに味方してくれており、少しの間、日常から離れることを許してくれます。どんな道を選んでも、それはあなたにとって正しい道だと信じてください。後悔は捨て去りましょう。何の意味もありません。今日という日を大切にし、小さな喜びを噛み締めましょう。あなたの夢を分かち合い、人生の調和を目指しましょう。"
    }
  }
}