{
  "updated_at": "2025-12-27T16:29:58.379Z",
  "jst_date": "2025-12-28",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-28",
      "sign": "Aries",
      "horoscope": "Today, your creativity is likely to soar, making it a perfect time to explore writing, painting, or music composition. You may find yourself drawn to the allure of the past, so consider visiting an art gallery, museum, or catching a live concert. Trust your instincts, as your intuition is particularly sharp right now. You might discover profound messages conveyed through art that offer you valuable insights or even revelations. Be sure to jot down your thoughts and feelings!",
      "horoscope_ja": "今日はあなたの創造力が飛躍的に高まり、文章を書いたり、絵を描いたり、作曲したりするのに最適な時期です。過去の魅力に惹かれるかもしれませんので、美術館や博物館を訪れたり、ライブコンサートに出かけたりしてみてはいかがでしょうか。直感を信じてください。今、あなたの直感は特に鋭敏です。芸術を通して伝えられる深いメッセージに出会い、貴重な洞察や啓示を得るかもしれません。考えや気持ちを書き留めておきましょう！"
    },
    "taurus": {
      "date": "2025-12-28",
      "sign": "Taurus",
      "horoscope": "Your natural curiosity is heightened today, sparking an even greater thirst for knowledge. While you often lean towards idealism, your creativity is particularly vibrant now. Consider diving into writing or painting, and let your imagination roam free—fiction or impressionism will serve you better than historical or realistic themes. Exploring spiritual or esoteric topics could also bridge the gap between your intellect and intuition.",
      "horoscope_ja": "今日はあなたの生まれ持った好奇心が高まり、知識欲がさらに高まります。理想主義に傾倒することが多いですが、今は特に創造力が活気づいています。文章を書いたり絵を描いたりして、想像力を自由に解き放ってみてはいかがでしょうか。歴史や写実主義のテーマよりも、フィクションや印象派の作品の方があなたに合っているでしょう。スピリチュアルなテーマや神秘的なテーマを探求することで、知性と直感の溝を埋めることもできるかもしれません。"
    },
    "gemini": {
      "date": "2025-12-28",
      "sign": "Gemini",
      "horoscope": "Today, your normally reliable judgment might feel a bit obscured by your emotions. You could find yourself torn between various options or struggling to concentrate on your tasks. It's perfectly okay to take a step back and engage in something less demanding. Clarity will return by tomorrow. Take this time to unwind and set work aside for a bit.",
      "horoscope_ja": "今日は、普段は確かな判断力が、感情によって少し曇ってしまうかもしれません。様々な選択肢の間で板挟みになったり、仕事に集中できなくなったりするかもしれません。少し距離を置いて、負担の少ない何かに取り組んでも全く問題ありません。明日には頭が冴えてきます。この時間を使ってリラックスし、少しの間仕事から離れてみましょう。"
    },
    "cancer": {
      "date": "2025-12-28",
      "sign": "Cancer",
      "horoscope": "Today calls for a blend of optimism and vision as you step into the driver's seat of your life, actively pursuing fresh opportunities. Engaging discussions may spark ideas that could enhance both your personal and professional growth, leading to a flurry of communication on your end. You might even find yourself contemplating a relocation, possibly to a new city. Take your time with this decision; thoughtful planning will ensure everything unfolds in your favor.",
      "horoscope_ja": "今日は、楽観主義とビジョンを融合させ、人生の運転席に座り、積極的に新たな機会を模索することが求められます。魅力的な議論から、個人としてもキャリアとしても成長を促すアイデアが生まれ、コミュニケーションが活発になるかもしれません。もしかしたら、新しい街への移住を検討するかもしれません。この決断には時間をかけてください。綿密な計画を立てることで、すべてがあなたにとって好ましい方向に進むでしょう。"
    },
    "leo": {
      "date": "2025-12-28",
      "sign": "Leo",
      "horoscope": "Today, you might encounter fresh concepts and chances to boost your financial situation. However, it's wise to refrain from making hasty decisions or implementing significant changes to your financial setup just yet. Your clarity of thought may be somewhat compromised, making it challenging to choose between various alternatives. Take the time to jot down all the details, analyze them thoroughly, and give yourself a few nights to reflect before making any commitments.",
      "horoscope_ja": "今日は、経済状況を改善するための新しいアイデアやチャンスに出会うかもしれません。しかし、性急な決断や、財務状況に大きな変更を加えるのは、まだ控えた方が賢明です。思考力がやや低下し、様々な選択肢の中から選ぶのが難しくなるかもしれません。時間をかけて詳細を書き留め、徹底的に分析し、何かを実行する前に数晩じっくり考える時間を取りましょう。"
    },
    "virgo": {
      "date": "2025-12-28",
      "sign": "Virgo",
      "horoscope": "Today, you might find yourself in a particularly friendly mood. It could be a great time to reconnect with old friends you haven't spoken to in ages, possibly to mend any past misunderstandings or hurt feelings. Focus on letting go of the past rather than rehashing it. You may be feeling a bit more sensitive than normal, so be cautious, as discussions could spark tension. Remember to appreciate the positive traits of your friends to fully enjoy your time together.",
      "horoscope_ja": "今日は、特に友好的な気分になれるかもしれません。長い間連絡を取っていなかった旧友と再会し、過去の誤解や傷ついた気持ちを癒す絶好の機会かもしれません。過去を蒸し返すのではなく、過去を手放すことに集中しましょう。普段より少し敏感になっているかもしれませんので、話し合いが緊張を生む可能性があるので注意が必要です。一緒に過ごす時間を最大限に楽しむために、友人の良いところも大切にしましょう。"
    },
    "libra": {
      "date": "2025-12-28",
      "sign": "Libra",
      "horoscope": "Today, your energy levels might be on the lower side, leaving you feeling a bit off. This could lead to some restlessness and a touch of melancholy. It's likely that stress is contributing to this feeling. Consider playing some soothing music and surrounding yourself with vibrant flowers or other cheerful items. If you can, treat yourself to a massage; it will help you unwind. By tomorrow, you should be back to your usual self.",
      "horoscope_ja": "今日はエネルギーレベルが少し低く、気分が落ち込んでいるかもしれません。そのため、落ち着かなくなり、少し憂鬱な気分になっているかもしれません。ストレスがこの気分の一因となっている可能性があります。心地よい音楽を聴いたり、鮮やかな花や楽しいものに囲まれたりしてみてはいかがでしょうか。可能であれば、マッサージを受けてリラックスするのも良いでしょう。明日にはいつもの自分に戻っているはずです。"
    },
    "scorpio": {
      "date": "2025-12-28",
      "sign": "Scorpio",
      "horoscope": "Love is on the upswing! It's a great time to have an open conversation with your partner about your relationship. Keep in mind that a friend might not fully align with your views, so be prepared to find some common ground. Don't let differing opinions put a damper on your spirits. The outlook for romance is promising in the coming days, especially if you prioritize clear communication.",
      "horoscope_ja": "愛は最高潮！パートナーと二人の関係について率直に話し合う絶好の機会です。友人は必ずしもあなたの考えに完全に同意するとは限りません。ですから、共通点を見つける準備をしておきましょう。意見の相違に心を痛めないでください。特に、明確なコミュニケーションを大切にすれば、これからの恋愛は明るい兆しを見せます。"
    },
    "sagittarius": {
      "date": "2025-12-28",
      "sign": "Sagittarius",
      "horoscope": "Are you considering giving your home a makeover? Today is the perfect opportunity to dive into that project! Your creative energy and eye for design are at their peak. Involve your family in brainstorming ideas for colors, styles, and layouts. Expect a flurry of activity around your living space, and embrace the excitement! Just remember to pace yourselves and avoid overdoing it.",
      "horoscope_ja": "家のリフォームをお考えですか？今日こそ、そのプロジェクトに飛び込む絶好の機会です！あなたの創造力とデザインセンスは最高潮です。ご家族と一緒に、色、スタイル、レイアウトのアイデア出しに取り組んでみましょう。リビングスペースでの生活が目まぐるしく変化し、ワクワクする気持ちを味わいましょう！ただし、ペースを守り、やり過ぎにはご注意ください。"
    },
    "capricorn": {
      "date": "2025-12-28",
      "sign": "Capricorn",
      "horoscope": "A surprise encounter or phone call from a friend could deliver thrilling news your way. You may feel inspired to meet up and celebrate this delightful turn of events. Luck is on your side, arriving from an unexpected direction, so don’t spend too long pondering its origins—seize the opportunity! Your future achievements might depend on how you respond today. By the time the sun sets, you could find yourself pursuing entirely new aspirations compared to what you envisioned this morning.",
      "horoscope_ja": "友人からの突然の出会いや電話が、あなたに嬉しい知らせをもたらすかもしれません。この嬉しい出来事を誰かと会って祝いたくなるかもしれません。幸運はあなたの味方です。思いがけない方向からやって来ます。そのきっかけをあれこれ考えすぎず、チャンスを掴みましょう！将来の成果は、今日のあなたの反応にかかっているかもしれません。日が沈む頃には、今朝思い描いていたものとは全く異なる目標を追い求めている自分に気づくかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-28",
      "sign": "Aquarius",
      "horoscope": "As the day begins, you might feel a bit anxious about your financial situation, reflecting on previous impulsive purchases. Take some time to review your financial records with a clear mind. You may discover that the reality isn't as dire as you fear. Consider jotting down a strategy to address any issues that require your focus. You'll find that you can manage your affairs calmly and effectively.",
      "horoscope_ja": "一日が始まると、過去の衝動買いを思い出し、経済状況に少し不安を感じるかもしれません。少し時間を取って、冷静な気持ちで家計簿を見直してみましょう。現実はあなたが恐れているほど悲惨ではないことに気づくかもしれません。集中すべき問題に対処するための戦略を書き留めておくことを検討してみてください。そうすれば、落ち着いて効果的に物事を管理できるようになるでしょう。"
    },
    "pisces": {
      "date": "2025-12-28",
      "sign": "Pisces",
      "horoscope": "Today, the themes of love and commitment take center stage in your life. You may find yourself radiating warmth and charm, making you feel particularly appealing to others. Expect romantic moments to flourish, enhancing your connections with partners. Additionally, this day is favorable for strengthening other types of relationships, as a deeper understanding develops between you and those around you. You might discover that casual acquaintances have the potential to blossom into genuine friendships.",
      "horoscope_ja": "今日、愛と献身というテーマがあなたの人生の中心となります。温かさと魅力を放ち、周りの人々にとって特に魅力的だと感じられるかもしれません。ロマンチックな瞬間が溢れ、パートナーとの絆が深まるでしょう。さらに、この日はあなたと周囲の人々の間により深い理解が深まるため、他の種類の人間関係を強化するのにも適しています。ちょっとした知り合いが真の友情に発展する可能性に気づくかもしれません。"
    }
  }
}