{
  "updated_at": "2026-02-19T16:59:46.124Z",
  "jst_date": "2026-02-20",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-20",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find yourself feeling a bit drained from either mental or physical exertion. Your usual quick wit and energy may seem to be lagging, leaving those around you puzzled by your slower pace. It's essential to prioritize rest and recharge your batteries, as you'll need it to regain your vitality. If work is unavoidable, focus on simple, routine tasks that don't demand much mental strain.",
      "horoscope_ja": "牡羊座のあなたは、今日、精神的にも肉体的にも疲れを感じてしまうかもしれません。いつもの機転やエネルギーが鈍り、周りの人はあなたのペースの遅さに戸惑うかもしれません。活力を取り戻すには、休息とエネルギーチャージを最優先に取ることが重要です。どうしても仕事に追われている場合は、精神的な負担がそれほど大きくない、単純でルーティンワークに集中しましょう。"
    },
    "taurus": {
      "date": "2026-02-20",
      "sign": "Taurus",
      "horoscope": "Taurus, while your partner is likely in a very romantic mood right now, you might not share the same enthusiasm for intimacy. After a few hectic days, you may find yourself feeling drained and less inclined to engage in passionate moments. Your feelings for them remain strong, but they might misread your lack of energy as a sign of disinterest. Whatever path you choose, it's important to communicate openly with your partner about your feelings and the reasons behind them.",
      "horoscope_ja": "おうし座さん、パートナーは今とてもロマンチックな気分になっているかもしれませんが、あなたは親密な関係にそれほど熱心ではないかもしれません。慌ただしい日々が数日続くと、疲れを感じ、情熱的な瞬間に身を委ねる気持ちが薄れてしまうかもしれません。パートナーへの気持ちは依然として強いままですが、相手はあなたのエネルギー不足を無関心のサインと誤解してしまうかもしれません。どのような道を選ぶにせよ、自分の気持ちとその背景にある理由をパートナーに率直に伝えることが大切です。"
    },
    "gemini": {
      "date": "2026-02-20",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, your home might feel a bit somber. With someone important missing from the household, their absence will be deeply felt. The best approach is to keep everyone engaged and occupied until they come back. A great way to lift spirits is to rally the family for a cleaning session, preparing for a heartfelt reunion!",
      "horoscope_ja": "ふたご座さん、今日はあなたの家が少し陰鬱な雰囲気になっているかもしれません。大切な人が家にいないので、その不在は深く心に刻まれるでしょう。一番良いのは、その人たちが戻ってくるまで、家族全員が何かに夢中になって、何かに取り組めるようにすることです。気分を明るくする良い方法は、家族全員で大掃除をして、心温まる再会の準備をすることです！"
    },
    "cancer": {
      "date": "2026-02-20",
      "sign": "Cancer",
      "horoscope": "Today, a senior family member or neighbor might reach out for your support, Cancer. While it may feel like an inconvenient moment given your own busy schedule, your instinct to lend a hand will prevail. Remember to manage your time wisely, take things at a steady pace, and avoid overwhelming yourself. By doing so, you'll ensure you're ready to assist again in the future.",
      "horoscope_ja": "蟹座のあなた、今日は年配の家族や近所の人が助けを求めてくるかもしれません。ご自身のスケジュールが忙しいので、少し不便に感じるかもしれませんが、手を差し伸べたいというあなたの本能が勝るはずです。時間を賢く管理し、物事を着実に進め、無理をしすぎないようにしましょう。そうすることで、将来再び助けが必要な時に備えることができます。"
    },
    "leo": {
      "date": "2026-02-20",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might find your creative spark feeling a bit dim. There's a project on your mind that you're eager to dive into, and while your concentration is sharp, the inspiration may be lacking. This could lead to some frustration, tempting you to vent your feelings—perhaps by tossing a pillow or two. If you feel the urge, go ahead! However, the best course of action might be to set your work aside for now. Tomorrow should bring a renewed sense of creativity.",
      "horoscope_ja": "獅子座さん、今日は創造力が少し弱まっているように感じるかもしれません。夢中になれるプロジェクトがあるのに、集中力は鋭いものの、インスピレーションが湧かないのかもしれません。それがストレスにつながり、感情をぶちまけたくなるかもしれません。枕を投げ捨てるなど、衝動に駆られるかもしれません。もしそうしたいなら、どうぞ！しかし、最善の策は、今は仕事を一旦脇に置くことかもしれません。明日はきっと、新たな創造力が湧いてくるはずです。"
    },
    "virgo": {
      "date": "2026-02-20",
      "sign": "Virgo",
      "horoscope": "Today is not the ideal time for you to remain indoors tackling chores, Virgo. If you choose to do so, you might find yourself overwhelmed by gloomy and illogical thoughts. Regardless of the weather, it's much more beneficial for you to venture out and engage in activities that uplift your spirits. Consider going shopping, catching a sports game, watching a film, or spending time with a friend. The key is to divert your attention away from your own worries. Embrace the day and have some fun!",
      "horoscope_ja": "おとめ座さん、今日は家の中にこもって家事に追われるには最適な時間ではありません。もしそうしてしまうと、陰鬱で非論理的な考えに圧倒されてしまうかもしれません。天候に関わらず、外に出て気分を高揚させるような活動に取り組んだ方がずっと良いでしょう。買い物に行ったり、スポーツ観戦をしたり、映画を見たり、友達と時間を過ごしたりしてみてはいかがでしょうか。重要なのは、自分の心配事から意識をそらすことです。今日という日を大切に、楽しく過ごしましょう！"
    },
    "libra": {
      "date": "2026-02-20",
      "sign": "Libra",
      "horoscope": "Today, Libra, you might encounter some disheartening news that could cast a shadow over your mood. A close friend may unexpectedly need to head out of town for a few weeks, leaving you feeling a bit isolated. Instead of fixating on this situation, focus on maintaining your connection through calls or emails, and anticipate their return. In the meantime, you'll likely find yourself occupied with various activities!",
      "horoscope_ja": "天秤座のあなたは今日、気分に暗い影を落とすような、気が滅入るようなニュースに遭遇するかもしれません。親しい友人が突然数週間出張することになり、少し寂しく感じるかもしれません。この状況にとらわれるのではなく、電話やメールで連絡を取り合い、彼らが戻ってくるのを待ちましょう。その間、あなたは様々な活動に忙しくなるでしょう！"
    },
    "scorpio": {
      "date": "2026-02-20",
      "sign": "Scorpio",
      "horoscope": "Your group's fundraising efforts have been thriving, Scorpio, but today you might notice a bit of a slowdown. You could find that checks are delayed, key individuals are unresponsive, or someone fails to show up for their responsibilities. While this can be quite irritating, rest assured that this lull is likely temporary. By tomorrow, things should pick up again, and you'll be back to your productive selves. Stay patient!",
      "horoscope_ja": "蠍座さん、あなたのグループの資金調達活動は順調に進んでいますが、今日は少し停滞を感じるかもしれません。小切手の受け取りが遅れたり、主要人物からの連絡が途絶えたり、誰かが職務を全うしなかったりするかもしれません。これはかなりイライラさせられるかもしれませんが、この停滞は一時的なものなのでご安心ください。明日には状況は再び好転し、あなたも本来の生産的な状態に戻れるでしょう。辛抱強く待ってください！"
    },
    "sagittarius": {
      "date": "2026-02-20",
      "sign": "Sagittarius",
      "horoscope": "Today, you might find your professional life dragging at a snail's pace, Sagittarius, and it could be tempting to throw in the towel. Resist that urge! It's simply one of those days when things feel off-kilter, despite the fact that overall, you’re still on solid ground. Don’t anticipate significant advancements today, and be prepared for a bit of a gloomy atmosphere from your coworkers. To lighten the mood, consider hanging a calendar filled with cartoons on your wall for some much-needed chuckles throughout the day.",
      "horoscope_ja": "射手座さん、今日は仕事がカタツムリのように遅く感じられ、投げ出したくなるかもしれません。でも、その衝動を抑えてください！全体的にはまだ順調ですが、何かがどこか調子が狂っているように感じる日です。今日は大きな進展は期待できません。同僚の雰囲気が少し暗いかもしれません。気分を明るくするために、漫画がいっぱいのカレンダーを壁に掛けて、一日を通して笑いを誘ってみてはいかがでしょうか。"
    },
    "capricorn": {
      "date": "2026-02-20",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today may not be the best time to dive into your studies. Your focus might be wandering, making the material feel incomprehensible. Unless it's absolutely essential, consider setting your books aside for now. You might find that attempting to study could create a false sense of understanding. It’s wiser to wait until tomorrow when your mind is clearer!",
      "horoscope_ja": "山羊座さん、今日は勉強に没頭するのに最適な時間ではないかもしれません。集中力が散漫になり、内容が理解しにくく感じるかもしれません。どうしても必要な場合を除き、今は本を脇に置いておくことを検討してください。勉強しようとすると、誤った理解感を抱く可能性があります。頭がもっとクリアになる明日まで待つ方が賢明です。"
    },
    "aquarius": {
      "date": "2026-02-20",
      "sign": "Aquarius",
      "horoscope": "Tonight, Aquarius, you may find yourself caught in a whirlwind of dreams that swing from the somber to the silly, leaving you both puzzled and amused. As you wake up, you might feel a bit bewildered by the vivid scenes that played out in your mind. Resist the urge to brush them off; these dreams hold valuable insights about your inner self. Reflect on your recent emotional rollercoaster—have you experienced moments of joy and sorrow in quick succession? Take a moment to ponder their significance!",
      "horoscope_ja": "今夜、水瓶座のあなたは、暗い夢から滑稽な夢まで、次々と夢をめぐる嵐に巻き込まれ、戸惑いと面白さの両方を味わうことになるかもしれません。目が覚めると、頭の中で鮮明に映し出された光景に、少し戸惑うかもしれません。でも、それらを無視したい衝動を抑えてください。これらの夢は、あなたの内面についての貴重な洞察を秘めているのです。最近の感情のジェットコースターのような出来事を振り返ってみてください。喜びと悲しみが立て続けに訪れたことはありませんか？少し時間を取って、その意味についてじっくり考えてみましょう！"
    },
    "pisces": {
      "date": "2026-02-20",
      "sign": "Pisces",
      "horoscope": "Are you sure you haven't received an invitation to a gathering happening today, Pisces? It might be time to double-check your schedule. The stars indicate that you could overlook some significant details at the moment, and a social or business event could be among them. Today may not shine as brightly as usual for you. Typically, your memory is quite sharp, but for now, it’s wise to keep your calendar close at hand!",
      "horoscope_ja": "魚座さん、今日開催される集まりの招待状を受け取っていませんか？スケジュールをもう一度確認した方がいいかもしれません。星占いによると、重要な予定を見落としている可能性があり、その中には社交イベントやビジネスイベントも含まれるかもしれません。今日は、いつもほど輝かしい日ではないかもしれません。普段は記憶力が非常に鋭いのですが、今はカレンダーを手元に置いておくのが賢明です！"
    }
  }
}