{
  "updated_at": "2026-01-21T17:00:44.629Z",
  "jst_date": "2026-01-22",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-22",
      "sign": "Aries",
      "horoscope": "Today, Aries, you may find yourself drawn to exploring religious and spiritual topics. Engaging in a deep conversation with a close friend about your insights and beliefs could lead to some enlightening revelations for both of you. The knowledge you gain is likely to spark your creativity, so be prepared to jot down your reflections or express them through art. Embrace this inspiration without holding back!",
      "horoscope_ja": "牡羊座のあなたは今日、宗教やスピリチュアルなテーマの探求に惹かれるかもしれません。親しい友人とあなたの洞察や信念について深く語り合うことで、お互いにとって啓発的な発見があるかもしれません。そこで得た知識はあなたの創造性を刺激するでしょう。思いついたことを書き留めたり、アートを通して表現したりする準備をしておきましょう。このインスピレーションをためらわずに受け入れましょう！"
    },
    "taurus": {
      "date": "2026-01-22",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, your interactions are likely to transcend mere words, leaning more towards a deeper, intuitive connection. You may find that when the phone rings, you have a strong sense of who is calling even before you answer. Additionally, you might tap into the unspoken thoughts of those around you. Exploring literature or articles about individuals with similar experiences can enhance your empathy and insight. Embrace this energy and allow yourself to flow with it!",
      "horoscope_ja": "おうし座のあなた、今日は言葉を超えた、より深く直感的な繋がりへと向かうでしょう。電話が鳴った時、出る前から誰からの電話かはっきりと分かるかもしれません。また、周囲の人々の言葉にされない思いに触れることができるかもしれません。同じような経験をした人々に関する文献や記事を読むことで、共感力と洞察力を高めることができます。このエネルギーを受け入れ、流れに身を任せましょう！"
    },
    "gemini": {
      "date": "2026-01-22",
      "sign": "Gemini",
      "horoscope": "Recent spiritual or religious experiences may spark a wave of inspiration for you, Gemini, prompting you to document your thoughts and stories, possibly with the intention of sharing them with a wider audience in the future. Your focus is likely to be sharp today, making writing not just a creative outlet but also a form of therapy. Engaging in classes, workshops, or even conversations with a friend about these topics will be beneficial. Remember, gaining knowledge is key.",
      "horoscope_ja": "ふたご座のあなたにとって、最近のスピリチュアルな体験や宗教的な体験がインスピレーションの波を呼び起こし、自分の考えやストーリーを記録し、将来的にもっと多くの人と共有したいという思いに駆られるかもしれません。今日は集中力が鋭く、書くことは創造的な表現方法であるだけでなく、一種のセラピーにもなります。これらのテーマについて、クラスやワークショップに参加したり、友人と話し合ったりするのも良いでしょう。知識を得ることが鍵となることを忘れないでください。"
    },
    "cancer": {
      "date": "2026-01-22",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you are likely to feel a surge of vitality and well-being. Embrace the urge to get moving, especially if you can do so solo and in the fresh air; this will boost your endorphins and elevate your mood, sparking a wave of creativity and insight. Once you've completed your workout, consider unwinding in a park, ideally by a body of water, to help you relax. Take some time to meditate and reflect on your inner feelings.",
      "horoscope_ja": "蟹座のあなたは、今日、活力と幸福感が湧き上がるでしょう。体を動かしたいという衝動を受け入れましょう。特に一人で新鮮な空気の中でできるならなおさらです。そうすることでエンドルフィンが分泌され、気分が高揚し、創造性と洞察力が湧き出てきます。運動を終えたら、公園、できれば水辺でゆったりとくつろぐのも良いでしょう。リラックスするために、少し時間を取って瞑想し、自分の内なる感情と向き合ってみましょう。"
    },
    "leo": {
      "date": "2026-01-22",
      "sign": "Leo",
      "horoscope": "Today, Leo, you may tap into some surprising telepathic vibes from a friend who’s far away. A phone call could bring delightful news from them, and coincidentally, they were just about to reach out to you! This might not be your only moment of heightened intuition today. Your psychic senses are particularly sharp, so get ready for some powerful insights coming your way.",
      "horoscope_ja": "獅子座さん、今日は遠く離れた友人から、驚くべきテレパシーの波動を感じるかもしれません。電話がかかってきて、嬉しい知らせがもたらされるかもしれません。そして偶然にも、彼らはまさにあなたに連絡しようとしていたのです！今日、あなたの直感が研ぎ澄まされる瞬間はこれだけではないかもしれません。あなたのサイキックな感覚は特に鋭敏なので、力強い洞察が訪れる準備をしておきましょう。"
    },
    "virgo": {
      "date": "2026-01-22",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you’ll find that your creative juices are flowing abundantly, allowing you to express yourself in various forms. A chance to earn a significant income through your artistic talents may present itself. This could also tie into your interests in spiritual or metaphysical subjects. It feels like you’re on the verge of achieving a long-term aspiration, and the excitement is palpable. In the evening, gather your friends and celebrate this achievement!",
      "horoscope_ja": "乙女座のあなたは、今日、創造力が豊かに湧き上がり、様々な形で自分を表現できるようになるでしょう。芸術的な才能を通して、大きな収入を得るチャンスが訪れるかもしれません。これは、スピリチュアルや形而上学的なテーマへの関心とも繋がるかもしれません。長年の夢が実現しそうな気配が漂い、その興奮は計り知れません。夜には、友人たちを集めてこの成果を祝いましょう！"
    },
    "libra": {
      "date": "2026-01-22",
      "sign": "Libra",
      "horoscope": "Typically, you tackle situations with a logical and analytical perspective, Libra, but today your intuition is heightened, allowing you to tap into deeper realms of awareness. This shift may challenge your usual way of thinking. You might find that some uneasy feelings you've sensed regarding current events are indeed valid, which could be unsettling. Keep in mind that the Universe holds mysteries that often defy rational explanation!",
      "horoscope_ja": "天秤座のあなたは、普段は論理的かつ分析的な視点で状況に対処しますが、今日は直感が研ぎ澄まされ、より深い意識の領域へと踏み込むことができるでしょう。この変化は、あなたのこれまでの思考回路を揺るがすかもしれません。最近の出来事に関して感じていた不安な感情が、実は正当なものだったことに気づき、不安に駆られることもあるかもしれません。宇宙には、理性的な説明がつかない謎が隠されていることを忘れないようにしましょう。"
    },
    "scorpio": {
      "date": "2026-01-22",
      "sign": "Scorpio",
      "horoscope": "Scorpio, if you've been contemplating diving into the realms of astrology, numerology, alchemy, or any mystical discipline, today is the perfect opportunity to embark on that journey. Your analytical mind, paired with heightened intuitive abilities, will pave the way for you to develop a newfound talent in these areas. Reach out to friends who share your curiosity and consider joining a class or workshop that resonates with you. By the time the day wraps up, your thoughts may be racing with all the exciting possibilities!",
      "horoscope_ja": "蠍座のあなた、もし占星術、数秘術、錬金術、あるいは神秘的な分野に足を踏み入れたいと考えているなら、今日こそその旅に出る絶好の機会です。分析力と鋭い直感力が相まって、これらの分野で新たな才能を開花させる道が開かれるでしょう。同じ好奇心を持つ友人に連絡を取り、共感できるクラスやワークショップへの参加を検討してみましょう。一日が終わる頃には、ワクワクするような可能性が次々と頭を駆け巡っているかもしれませんよ！"
    },
    "sagittarius": {
      "date": "2026-01-22",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may find yourself captivated by some striking and powerful dreams that spark a desire to delve deeply into a topic that fascinates you. This could relate to the realms of art, philosophy, or metaphysics. You might also be contemplating a journey to one of the planet's renowned spiritual hubs, like Jerusalem, Glastonbury, or Vrindavana. Your intuition is particularly sharp today, so take the time to reflect on your aspirations. They could hold the key to what you truly seek!",
      "horoscope_ja": "射手座のあなたは今日、印象的で力強い夢に心を奪われ、心を奪われるテーマを深く探求したいという欲求が掻き立てられるかもしれません。それは芸術、哲学、あるいは形而上学といった分野に関わるかもしれません。あるいは、エルサレム、グラストンベリー、ヴリンダーヴァナといった、地球上で有名なスピリチュアルな聖地への旅を考えているかもしれません。今日は特に直感が鋭いので、自分の願望についてじっくり考えてみましょう。もしかしたら、それがあなたが本当に求めているものへの鍵となるかもしれません！"
    },
    "capricorn": {
      "date": "2026-01-22",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today your romantic connections are infused with a magical quality, reminiscent of the legendary love between Lancelot and Guinevere. It's an ideal time to plan a cozy evening with your significant other. You might find yourself so in sync with a friend that you both express the same thoughts simultaneously. Savor this enchanting experience, but remember to stay grounded in reality.",
      "horoscope_ja": "山羊座のあなた、今日のあなたの恋愛は、ランスロットとグィネヴィアの伝説的な愛を彷彿とさせる、魔法のような魅力に満ちています。大切な人と心地よい夜を過ごすには絶好のタイミングです。友人と心が通い合い、同じ思いを同時に口にすることもあるかもしれません。この魅惑的な体験を満喫しつつ、現実に根ざした行動を忘れないようにしましょう。"
    },
    "aquarius": {
      "date": "2026-01-22",
      "sign": "Aquarius",
      "horoscope": "Today, you may find yourself participating in multiple gatherings or social events centered around spiritual or metaphysical themes. Your intuition is heightened, Aquarius, and your comprehension is particularly sharp. Ideas that might usually perplex you will appear crystal clear today. You could forge meaningful connections with fellow attendees, possibly leading to plans for future meet-ups. Embrace the experience!",
      "horoscope_ja": "今日は、スピリチュアルや形而上学的なテーマを中心とした集まりや社交イベントに複数参加することになるかもしれません。水瓶座のあなたは、直感が研ぎ澄まされ、理解力も特に鋭敏です。普段なら戸惑ってしまうようなアイデアも、今日は明晰に浮かび上がるでしょう。参加者同士の有意義な繋がりが生まれ、将来のミートアップの計画につながるかもしれません。この経験を大切にしましょう！"
    },
    "pisces": {
      "date": "2026-01-22",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you may find yourself deeply immersed in intellectual or creative pursuits. Your inspiration is soaring, and you're brimming with ideas that could greatly benefit others. Additionally, you might pick up on the emotions and thoughts of those around you even before they recognize them themselves. This heightened awareness can enhance your professional reputation and also bring positive vibes to your romantic life. Have a wonderful day!",
      "horoscope_ja": "魚座のあなたは今日、知的または創造的な活動に深く没頭するかもしれません。インスピレーションが湧き上がり、周りの人々にとって大きな助けとなるアイデアが溢れています。さらに、周囲の人々が自分では気づかないうちに、彼らの感情や考えを察知する能力も備わっているかもしれません。この鋭い洞察力は、あなたの仕事上の評判を高め、恋愛にもポジティブな雰囲気をもたらすでしょう。素敵な一日をお過ごしください！"
    }
  }
}