{
  "updated_at": "2026-01-31T16:35:00.481Z",
  "jst_date": "2026-02-01",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-01",
      "sign": "Aries",
      "horoscope": "Harness the dynamic energy of today to delve deep and remove any superficial layers that may be causing more trouble than they’re worth. Aries, it’s time to reveal your true self to those around you, showcasing the wealth of talents and insights you’ve been holding back. Step into a leadership position regarding your current circumstances and express your desires clearly. You’ll notice a significant enhancement in your everyday life once you start voicing what you truly need.",
      "horoscope_ja": "今日のダイナミックなエネルギーを活かして、自分の内面を深く掘り下げ、問題を引き起こしている表面的な部分を取り除いてください。牡羊座のあなた、これまで隠してきた豊かな才能と洞察力を周りの人々に披露し、真の自分を見せる時が来ました。現状においてリーダーシップを発揮し、自分の望みをはっきりと表現しましょう。本当に必要なことを声に出して話すようになると、日常生活が大きく向上していくことに気づくでしょう。"
    },
    "taurus": {
      "date": "2026-02-01",
      "sign": "Taurus",
      "horoscope": "Stay grounded, Taurus, even as the chaos swirls around you. Trust your instincts to discern right from wrong, and don’t sacrifice your integrity or self-respect. Be aware of the dynamics within your circle, but remember, you don’t have to conform to a path that doesn’t resonate with your true self. Focus on what you can manage, and let go of the rest.",
      "horoscope_ja": "牡牛座のあなた、たとえ周囲に混乱が渦巻いていても、地に足をつけて落ち着いてください。善悪を判断する直感を信じ、誠実さや自尊心を犠牲にしないでください。周りの人間関係には気を配りましょう。しかし、本当の自分と共鳴しない道に無理に従う必要はないことを忘れないでください。自分ができることに集中し、それ以外のことは手放しましょう。"
    },
    "gemini": {
      "date": "2026-02-01",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, it's time to rally your strength and seize the moment! You're poised to leave a significant mark on those around you. Collaborative efforts are particularly favored, so dive into group activities. With a surge of energy propelling you forward, be mindful of where you direct your efforts. Take the initiative in areas that have been stuck or stagnant. Embracing change is essential for your growth, and today presents a fantastic opportunity to chase after those vital aspirations.",
      "horoscope_ja": "ふたご座の皆さん、今日は力を結集し、この瞬間を掴む時です！周りの人々に大きな足跡を残す準備が整っています。特に協調的な取り組みが好調なので、グループ活動に積極的に参加しましょう。エネルギーが湧き上がり、前進する今、努力の方向を慎重に見極めましょう。行き詰まったり、停滞したりしている分野には、積極的に取り組んでみましょう。変化を受け入れることは成長に不可欠であり、今日はまさに、そうした重要な目標を追い求める絶好の機会です。"
    },
    "cancer": {
      "date": "2026-02-01",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, your feelings might be bubbling with energy, yet you may feel uncertain about which path to take. Your inner drive is strong, but your vision seems a bit obscured. Focus on the aspects of your life that are crying out for change and aim to improve them. Once you clear your perspective, rev up your engines and take the plunge. It's time to take the initiative, or you might find circumstances pushing you along instead.",
      "horoscope_ja": "蟹座のあなた、今日は感情がエネルギーに満ち溢れているかもしれませんが、どの道を進むべきか迷っているかもしれません。内なる衝動は強いものの、ビジョンが少しぼやけているように感じます。人生の中で変化を求めている部分に目を向け、改善を目指しましょう。視野が明確になったら、エンジンをフル回転させて思い切って行動を起こしましょう。今こそ主導権を握るべき時です。そうでなければ、状況に突き動かされるかもしれません。"
    },
    "leo": {
      "date": "2026-02-01",
      "sign": "Leo",
      "horoscope": "Today, Leo, you possess an incredible reservoir of energy that you should harness with caution. This is a pivotal time of transformation for you, and you might notice various shifts within your body. You have the potential to leave a lasting impact on those around you, so it's wise to pause and consider your actions. If this powerful energy isn't channeled correctly, it could lead to mishaps or unhealthy outcomes.",
      "horoscope_ja": "獅子座さん、今日あなたは信じられないほどのエネルギーの蓄えを持っていますが、それを慎重に扱うべきです。これはあなたにとって変革の重要な時期であり、体内の様々な変化に気づくかもしれません。あなたは周囲の人々に永続的な影響を与える可能性を秘めていますので、立ち止まって自分の行動をよく考えることが賢明です。この強力なエネルギーを正しく導かなければ、災難や不健康な結果につながる可能性があります。"
    },
    "virgo": {
      "date": "2026-02-01",
      "sign": "Virgo",
      "horoscope": "Virgo, you might find yourself caught in a significant conflict that feels beyond your control right now. It may seem as if a storm is brewing all around you, and your greatest desire is for it to cease. However, whether you acknowledge it or not, you hold a crucial role in this scenario, and you possess the ability to influence the resolution of this dispute. Embrace accountability for your choices and rise to the occasion.",
      "horoscope_ja": "おとめ座のあなたは、今、自分の力ではどうにもならないような大きな葛藤に巻き込まれているかもしれません。まるで嵐があなたの周りを覆い尽くしているかのようで、それを鎮めたいと切に願っているかもしれません。しかし、あなたがそれを自覚しているかどうかに関わらず、あなたはこの状況において重要な役割を担っており、この紛争の解決に影響を与える力を持っています。自分の選択に責任を持ち、状況に応じて行動しましょう。"
    },
    "libra": {
      "date": "2026-02-01",
      "sign": "Libra",
      "horoscope": "Today, Libra, you may feel as though a strong current is pushing against you, but remember, you hold the key to turning things around. Use this tension as an opportunity to restore harmony in a chaotic environment, and tread lightly around those in authority. You possess a significant amount of energy today, making your actions particularly impactful. Think about signing up for a course or exploring a spiritual journey.",
      "horoscope_ja": "天秤座のあなたは、今日、強い流れに逆らっているように感じるかもしれません。しかし、状況を好転させる鍵を握っているのはあなた自身だということを忘れないで下さい。この緊張を、混沌とした環境の中で調和を取り戻す機会と捉え、権威を持つ人々とは慎重に接しましょう。あなたは今日、大きなエネルギーに満ち溢れており、行動は特に大きな影響力を持つでしょう。講座に参加したり、スピリチュアルな旅に出たりしてみてはいかがでしょうか。"
    },
    "scorpio": {
      "date": "2026-02-01",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you might find that others are particularly oblivious to your emotions. Instead of letting this get to you, try to take it in stride. You may feel a strong desire to channel your energy physically, and it's a great idea to do so—just make sure it's in a positive way. Step outside for a walk or a jog by a nearby lake or river. This will help free your mind from its confines and allow you to gain a fresh perspective on your life.",
      "horoscope_ja": "蠍座のあなたは今日、周りの人があなたの感情に特に無頓着であることに気づくかもしれません。気に病むのではなく、冷静に受け止めましょう。エネルギーを肉体的に発散させたい衝動に駆られるかもしれません。そうするのは素晴らしいことですが、必ずポジティブな方法で発散させるようにしてください。近くの湖や川沿いを散歩したりジョギングしたりしてみましょう。そうすることで、心が束縛から解放され、人生を新鮮な視点で見つめることができるでしょう。"
    },
    "sagittarius": {
      "date": "2026-02-01",
      "sign": "Sagittarius",
      "horoscope": "Today is your day to shine, Sagittarius! You're brimming with unstoppable energy and potential, so harness it wisely. This is a prime opportunity for significant achievements and positive changes in your life. Your physical energy is at a peak, and your romantic life could be particularly vibrant. Remember to share your infectious enthusiasm with those around you. You're not alone in this world, so let your warmth and love radiate to others.",
      "horoscope_ja": "射手座のあなた、今日は輝く日です！あなたは尽きることのないエネルギーと可能性に満ち溢れています。それを賢く活用しましょう。人生において大きな成果を上げ、前向きな変化を遂げる絶好の機会です。体力はピークに達し、恋愛面でも特に活気に満ち溢れるでしょう。周りの人に伝染するような情熱を忘れずに分かち合いましょう。あなたはこの世界で一人ではありません。あなたの温かさと愛情を周りの人に広げましょう。"
    },
    "capricorn": {
      "date": "2026-02-01",
      "sign": "Capricorn",
      "horoscope": "Capricorn, you might feel a whirlwind of activity swirling around you, just out of reach. Your thoughts are darting about like a ball in a fast-paced tennis game. With changes happening at a rapid pace, it could be tempting to hop on the latest trend. However, take a moment to pause and assess the situation before diving in. Embrace the current flow, and keep in mind that the wisest choices often come from the heart rather than pure logic.",
      "horoscope_ja": "山羊座のあなたは、周囲に渦巻く活動の渦を感じるかもしれません。まるで手の届かないところに。思考は、ハイペースなテニスのボールのように飛び交っています。変化が目まぐるしく起こる中で、最新のトレンドに飛びつきたくなるかもしれません。しかし、飛び込む前に少し立ち止まり、状況をよく見極めましょう。流れに身を任せましょう。そして、最も賢明な選択は、純粋な論理ではなく、心から生まれるものであることを心に留めておきましょう。"
    },
    "aquarius": {
      "date": "2026-02-01",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you might encounter someone or something that challenges you. Remember, you have the power to harness the very energy that’s fueling their behavior to express your own perspective clearly. Don’t hesitate to assert yourself and make your voice count. At times, being a little bold and direct is essential to restore harmony in a chaotic environment.",
      "horoscope_ja": "水瓶座のあなたは、今日、あなたにとって挑戦的な人物や物事に遭遇するかもしれません。しかし、相手の行動の原動力となっているエネルギーを巧みに利用し、自分の意見を明確に表現する力を持っていることを忘れないでください。ためらわずに自己主張し、自分の意見を表明しましょう。混沌とした環境の中で調和を取り戻すには、時に大胆で率直な発言が不可欠です。"
    },
    "pisces": {
      "date": "2026-02-01",
      "sign": "Pisces",
      "horoscope": "Today marks a powerful opportunity for change, Pisces, and your choices carry significant weight. Be mindful of your intentions, as your words and actions may have a sharper impact than usual. You might find that others are getting under your skin, leaving you feeling like a kettle on the verge of boiling over. With tensions rising, it's crucial to keep your cool and avoid letting your emotions spill over onto those around you.",
      "horoscope_ja": "うお座のあなたにとって、今日は変化の大きなチャンスです。あなたの選択は大きな意味を持ちます。言葉や行動が普段よりも鋭い影響を与える可能性があるので、意図に気を付けてください。周りの人にイライラし、まるで沸騰寸前のやかんのように感じてしまうかもしれません。緊張が高まる中、冷静さを保ち、感情を周りの人にぶつけないようにすることが重要です。"
    }
  }
}