{
  "updated_at": "2026-02-16T16:52:21.486Z",
  "jst_date": "2026-02-17",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-17",
      "sign": "Aries",
      "horoscope": "Today, Aries, your intuition and mystical awareness are heightened. It’s a perfect time to delve into spiritual literature or participate in a seminar led by an expert in the field. Expect to receive some telepathic messages; you may find yourself and another person finishing each other's thoughts more than once throughout the day. Additionally, you may feel a strong connection with individuals from your past.",
      "horoscope_ja": "牡羊座のあなた、今日は直感と神秘的な意識が研ぎ澄まされています。スピリチュアルな文献を深く読んだり、専門家によるセミナーに参加したりするのに最適な時期です。テレパシー的なメッセージを受け取ることも期待できます。一日を通して、誰かと何度もお互いの考えを言い合えるかもしれません。また、過去の人との強い繋がりを感じるかもしれません。"
    },
    "taurus": {
      "date": "2026-02-17",
      "sign": "Taurus",
      "horoscope": "Typically, you are grounded and pragmatic, but today you might feel a stronger pull towards the mystical side of life. Spiritual themes are particularly captivating, and you may feel drawn to explore metaphysical shops or engage in conversations with those knowledgeable in these areas. Your imagination is likely to be quite active as well. Embrace some whimsical daydreams, Taurus; everyone deserves a little escape now and then!",
      "horoscope_ja": "普段は地に足が着いた現実的な方ですが、今日は人生の神秘的な側面に強く惹かれるかもしれません。スピリチュアルなテーマは特に魅力的で、形而上学的なお店を覗いたり、その分野に詳しい人と会話を交わしたりしたくなるかもしれません。想像力もかなり活発になるでしょう。牡牛座の皆さん、気まぐれな空想を楽しんでください。誰もが時々、ちょっとした現実逃避をする価値があるのですから！"
    },
    "gemini": {
      "date": "2026-02-17",
      "sign": "Gemini",
      "horoscope": "Gemini, you may find yourself drawn to group activities centered around meditation, spirituality, or creative expression today. It's an ideal time to enroll in a class or participate in a lecture on these fascinating topics. You might encounter some intriguing individuals who could turn into cherished friends. Expect to feel a deep connection with those you meet, and you may sense a positive shift in your life. Embrace the experience!",
      "horoscope_ja": "ふたご座のあなたは、今日、瞑想、スピリチュアリティ、あるいは創造的な表現を中心としたグループ活動に惹かれるかもしれません。これらの魅力的なテーマに関するクラスに参加したり、講義に参加したりするのに最適な時期です。きっと、大切な友人になれるような、魅力的な人たちと出会うでしょう。出会った人たちと深い繋がりを感じ、人生に良い変化が起こるかもしれません。この経験を大切にしてください！"
    },
    "cancer": {
      "date": "2026-02-17",
      "sign": "Cancer",
      "horoscope": "Your natural intuition is heightened today, and you might find yourself tapping into insights that could rival those of renowned seers. You may feel a strong connection to different realms, and your dreams are likely to be intense and memorable. Embrace the guidance you receive and channel it into your creative endeavors. Whether it’s painting, composing music, or writing poetry, you could be pleasantly surprised by what you create and the lessons you uncover along the way.",
      "horoscope_ja": "今日はあなたの生まれ持った直感が研ぎ澄まされ、著名な予言者に匹敵する洞察力に触れることができるかもしれません。異次元との強い繋がりを感じ、強烈で記憶に残る夢を見るかもしれません。受け取った導きを受け入れ、創造的な活動に活かしましょう。絵を描く、音楽を作曲する、詩を書くなど、どんなことでも、創作活動を通して得られるものや、そこから得られる教訓に、きっと心地よい驚きを感じるでしょう。"
    },
    "leo": {
      "date": "2026-02-17",
      "sign": "Leo",
      "horoscope": "Today, Leo, your creativity knows no bounds! You're feeling particularly drawn to the mystical and metaphysical realms, which might lead you to explore New Age bookstores. The allure of far-off destinations is strong, and you may find yourself daydreaming about adventures in India, Israel, Egypt, or Ireland. Embrace this wanderlust, but remember to keep your feet on the ground. If possible, consider planning a trip or joining a meditation group. Just go with the flow!",
      "horoscope_ja": "獅子座さん、今日はあなたの創造力が無限大です！神秘的で形而上学的な世界に特に惹かれ、ニューエイジ系の書店を巡る旅に出るかもしれません。遠く離れた場所への強い憧れに、インド、イスラエル、エジプト、アイルランドといった場所での冒険を夢想するかもしれません。この放浪心は受け入れてもいいですが、地に足のついた行動を心がけましょう。可能であれば、旅行を計画したり、瞑想グループに参加したりしてみてはいかがでしょうか。流れに身を任せましょう！"
    },
    "virgo": {
      "date": "2026-02-17",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you might receive some exciting updates related to your finances and professional life. Your innate compassion and ability to connect with others have helped you forge meaningful friendships that double as beneficial business relationships. This is truly starting to bear fruit. With your artistic flair peaking, it's an ideal time to dive into any creative endeavors you've been contemplating. Prosperity is on the horizon!",
      "horoscope_ja": "乙女座のあなたは今日、経済面と仕事面で何か嬉しい知らせを受け取るかもしれません。持ち前の思いやりと人との繋がりを築く能力が、有意義な友情を築き、それがビジネスにも有益な関係へと発展させてきました。そして、その関係がまさに実を結び始めています。芸術的才能がピークを迎えている今、これまで考えていたクリエイティブな活動に飛び込むには絶好のタイミングです。繁栄がすぐそこまで来ています！"
    },
    "libra": {
      "date": "2026-02-17",
      "sign": "Libra",
      "horoscope": "Expect a small disagreement with your significant other in the morning, but by mid-afternoon, you’ll likely find yourselves in a heartfelt embrace, filled with comforting words. As the day winds down, you might start dreaming up a romantic getaway together, even mapping out the dining spots you wish to explore! Conversations about spiritual or mystical topics could deepen your bond. Overall, it’s a day filled with ups and downs, but ultimately, it’s all about love.",
      "horoscope_ja": "午前中はパートナーとちょっとした意見の相違があるかもしれませんが、午後半ばには、きっと心から抱き合い、慰めの言葉で満ち溢れるでしょう。一日が終わりに近づくにつれ、二人でロマンチックな旅行の計画を立てたり、行きたいレストランの計画を立てたりするかもしれません。スピリチュアルや神秘的な話題で会話を交わすことで、二人の絆が深まるかもしれません。全体的に、アップダウンのある一日となるでしょうが、結局のところ、すべては愛についてです。"
    },
    "scorpio": {
      "date": "2026-02-17",
      "sign": "Scorpio",
      "horoscope": "Your keen intuition, creativity, and perceptiveness have been valuable assets in your work, and rewards are on the horizon. You may soon be presented with a raise, a commission, or an opportunity to invest in your company. This will undoubtedly enhance your self-confidence! Additionally, you might notice an increase in your intuitive abilities, leading others to admire you even more. Take a moment to acknowledge your achievements—you’ve earned it!",
      "horoscope_ja": "あなたの鋭い直感、創造性、そして洞察力は、仕事において貴重な資産となっており、その成果は間もなく現れます。昇給、コミッション、あるいは会社への投資機会が訪れるかもしれません。これは間違いなくあなたの自信を高めるでしょう！さらに、直感力が向上し、周囲の尊敬を集めるようになるかもしれません。少し時間を取って、自分の成果を認めましょう。あなたはそれを成し遂げたのですから！"
    },
    "sagittarius": {
      "date": "2026-02-17",
      "sign": "Sagittarius",
      "horoscope": "Today promises to be a wonderfully romantic day for you, Sagittarius. You're radiating warmth and sensuality, and your perspective on your partner is delightfully optimistic. Chances are, they see you in a similarly glowing light. If you've been dreaming of an intimate dinner for two, adorned with champagne, soft candlelight, and beautiful red roses, today is the perfect opportunity to make it happen. And be sure to set the mood with some lovely violin music!",
      "horoscope_ja": "射手座のあなたにとって、今日は素晴らしくロマンチックな一日になりそうです。温かさと官能的な雰囲気を漂わせ、パートナーに対する見方も素晴らしく楽観的です。きっと相手もあなたを同じように輝かしい目で見ているでしょう。シャンパン、柔らかなキャンドルライト、そして美しい赤いバラで彩られた、二人だけの親密なディナーを夢見ていたなら、今日はまさに実現の絶好の機会です。そして、素敵なバイオリンの音色でムードを盛り上げましょう！"
    },
    "capricorn": {
      "date": "2026-02-17",
      "sign": "Capricorn",
      "horoscope": "Today, you might receive a visit from someone well-versed in natural healing, bringing along fresh insights to share. Your curiosity about health matters is heightened, and you may find yourself eager to explore not just herbal remedies and nutrition, but also the realm of spiritual healing. This is an excellent opportunity for you, Capricorn, to hone your own healing skills, as your sensitivity is heightened, allowing you to connect more deeply with healing energies than usual.",
      "horoscope_ja": "今日は、自然療法に精通した人が訪ねてきて、新鮮な知見を共有してくれるかもしれません。健康への好奇心が高まり、ハーブ療法や栄養学だけでなく、スピリチュアルヒーリングの領域にも興味を持つようになるかもしれません。山羊座のあなたにとって、これは自身のヒーリングスキルを磨く絶好の機会です。感受性が高まり、普段よりも深くヒーリングエネルギーと繋がることができるようになるからです。"
    },
    "aquarius": {
      "date": "2026-02-17",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you might find yourself motivated by the stories in books and films to dive into creative pursuits. Your appreciation for beauty is heightened, and you could be tapping into inspiration from a higher source. Consider taking a leisurely walk through an art gallery or museum, allowing yourself to connect with the emotions of those who came before you. Additionally, a heartfelt message or call from a romantic partner could lift your spirits even further. Overall, this day promises to be deeply fulfilling on an emotional level.",
      "horoscope_ja": "水瓶座のあなたは、今日、本や映画の物語に刺激を受けて、創造的な活動に没頭するかもしれません。美への理解が深まり、高次の源泉からインスピレーションを得ているかもしれません。美術館や博物館をゆっくりと散策し、先人たちの感情に触れてみるのも良いでしょう。さらに、恋人からの心のこもったメッセージや電話は、あなたの気分をさらに高揚させるかもしれません。全体として、この日は感情面で深く満たされる日となるでしょう。"
    },
    "pisces": {
      "date": "2026-02-17",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you may find yourself in a generous mood, prompting you to spruce up your living space. Rather than tackling any significant repairs, your focus will likely be on enhancing the beauty of your home. Your heightened sense of aesthetics, influenced by higher energies, means that any decorating choices you make today are bound to be stunning. Dive in and let your creativity flow!",
      "horoscope_ja": "魚座のあなたは、今日は寛大な気分に浸り、住空間をきれいに整えたいと思うかもしれません。大規模な修繕に取り組むよりも、家の美しさを高めることに集中するでしょう。高次のエネルギーの影響を受けた美的感覚が高まっているので、今日あなたが選ぶどんなインテリアもきっと素晴らしいものになるでしょう。思い切って、創造力を解き放ちましょう！"
    }
  }
}