{
  "updated_at": "2026-01-23T16:36:52.245Z",
  "jst_date": "2026-01-24",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-24",
      "sign": "Aries",
      "horoscope": "A close friend or partner may be feeling the pressure of financial concerns, and they might turn to you for guidance. Additionally, a creative endeavor you’re involved in could demand more money, time, or resources than you anticipated, leaving you questioning your ability to see it through. While you may need to make some adjustments or sacrifices, Aries, you should still be able to finish the project as intended.",
      "horoscope_ja": "親しい友人やパートナーが経済的な問題でプレッシャーを感じ、あなたに相談してくるかもしれません。また、あなたが取り組んでいるクリエイティブなプロジェクトは、予想以上に資金、時間、リソースを必要とし、やり遂げられるか不安に感じるかもしれません。牡羊座のあなたは、多少の調整や犠牲を払う必要があるかもしれませんが、それでもプロジェクトを予定通りに完了できるはずです。"
    },
    "taurus": {
      "date": "2026-01-24",
      "sign": "Taurus",
      "horoscope": "Taurus, you may find yourself with guests or a romantic rendezvous on the horizon this evening. However, as the afternoon rolls in, you might feel a wave of fatigue washing over you, leading you to contemplate whether to call it off. It’s wise to take it easy today. Consider enjoying some coffee and snacks in the comfort of your home rather than venturing out—don’t forget to grab those treats from the store! Your night promises to be filled with engaging and lively discussions, and you’ll be pleased you decided to follow through with your plans.",
      "horoscope_ja": "おうし座さん、今晩はゲストが来たり、ロマンチックなデートの予定が迫っているかもしれません。しかし、午後になると疲労感が押し寄せてきて、キャンセルすべきか迷ってしまうかもしれません。今日はゆっくり過ごすのが賢明です。外出するよりも、家でくつろぎながらコーヒーと軽食を楽しむのがおすすめです。お店でちょっとしたおやつを買うのもお忘れなく！きっと、楽しく活発な会話で溢れる夜になるでしょう。きっと、計画通りに行動してよかったと思えるはずです。"
    },
    "gemini": {
      "date": "2026-01-24",
      "sign": "Gemini",
      "horoscope": "You might experience some hold-ups with deliveries you were anticipating. Today could bring surprising revelations about a neighbor or family member, and rumors may circulate quickly within your community. While this news might leave you feeling unsettled, remember that it could be blown out of proportion. You may find yourself visiting nearby friends or spending considerable time on the phone seeking clarity. Approach everything you hear today with a healthy dose of skepticism.",
      "horoscope_ja": "期待していた配達が遅れるかもしれません。今日は、近所の人や家族に関する驚くべき事実が明らかになり、噂が地域内で急速に広まるかもしれません。こうしたニュースに不安を感じるかもしれませんが、誇張されてしまう可能性もあることを覚えておいてください。近所の友人を訪ねたり、電話で状況の説明を求めて長い時間を過ごしたりするかもしれません。今日耳にするあらゆることに、適度な懐疑心を持って接してください。"
    },
    "cancer": {
      "date": "2026-01-24",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you might receive some unexpected yet positive news regarding a group you’re connected with. It could be that fundraising efforts have exceeded your expectations, or you might be on the verge of receiving some well-deserved recognition. However, be prepared to tackle a fair amount of paperwork to make the most of this opportunity, as contracts or legal documents may play a role. Later in the evening, gather with friends and enjoy a celebration!",
      "horoscope_ja": "蟹座のあなたは今日、あなたが関わっている団体から、思いがけず明るいニュースを受け取るかもしれません。募金活動が予想を上回る成果を上げたのかもしれませんし、当然の評価を受けようとしているのかもしれません。ただし、この機会を最大限に活用するには、契約書や法的文書が重要になる可能性があるため、かなりの量の書類処理に取り組む覚悟が必要です。夜遅くには、友人と集まってお祝いを楽しみましょう！"
    },
    "leo": {
      "date": "2026-01-24",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might find yourself a bit rattled by some unexpected financial news. It could be that a payment you were counting on is delayed, or perhaps there's been a mix-up with your bank account. While it may require some tedious phone calls to resolve, rest assured that this is just a minor setback. Overall, things are looking bright for you; this is merely a temporary bump in the road.",
      "horoscope_ja": "レオ座さん、今日は予期せぬ経済的なニュースに少し動揺するかもしれません。期待していた支払いが遅れているのかもしれませんし、銀行口座に何らかのトラブルがあったのかもしれません。解決には面倒な電話連絡が必要になるかもしれませんが、これはほんの小さな問題に過ぎませんのでご安心ください。全体的に見て、状況は明るい兆しを見せています。これは一時的な問題に過ぎません。"
    },
    "virgo": {
      "date": "2026-01-24",
      "sign": "Virgo",
      "horoscope": "Virgo, you may be experiencing a brief hiccup in your professional life that could leave you feeling a bit off balance. It seems that some modern technology might be at play here. Remember, this is just a passing phase, and things will soon fall back into place. Your natural determination, efficiency, and practical skills will help you navigate through this with ease. Overall, you likely maintain a positive outlook for what lies ahead, and that uplifting energy is unlikely to waver anytime soon.",
      "horoscope_ja": "おとめ座さん、仕事でちょっとしたトラブルに見舞われ、少しバランスを崩しているかもしれません。どうやら、最新テクノロジーが影響しているようです。でも、これは一時的なもので、すぐに元通りになるでしょう。持ち前の決断力、効率性、そして実践的なスキルが、この困難を楽に乗り切る力となるでしょう。全体的に見て、あなたは将来に対して前向きな見通しを維持できており、その高揚感はすぐには揺らぐことはないでしょう。"
    },
    "libra": {
      "date": "2026-01-24",
      "sign": "Libra",
      "horoscope": "Libra, brace yourself for a potentially challenging start to your day. You might encounter unexpected technical difficulties with your work equipment, and resolving these issues could take some time. Additionally, a brief distance from your romantic partner may leave you feeling disheartened. You likely have a surge of physical energy that needs an outlet. Consider taking a long walk; it will not only help you release that energy but also give you a chance to clear your mind.",
      "horoscope_ja": "天秤座の皆さん、一日の始まりは大変なものになるかもしれません。仕事で使っている機器に予期せぬ技術的なトラブルが発生し、解決に時間がかかるかもしれません。また、恋人と少し距離を置くことで、気分が落ち込むこともあるでしょう。おそらく、エネルギーが湧き上がってきて、それを発散させたいと思っているのでしょう。長い散歩に出かけてみてはいかがでしょうか。エネルギーを発散させるだけでなく、心を落ち着かせる機会にもなります。"
    },
    "scorpio": {
      "date": "2026-01-24",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, your creative energy is soaring! You might find that dreams or moments of meditation have sparked some profound spiritual insights, but they could slip away as soon as you awaken or finish meditating. This might leave you feeling a bit exasperated! To combat this, consider jotting down any fragments you can recall. Doing so can help you reconnect with those fleeting thoughts. Plus, having a written record will be valuable for you.",
      "horoscope_ja": "蠍座さん、今日はあなたの創造力が最高潮です！夢や瞑想の瞬間に深いスピリチュアルな洞察が湧き上がっても、目覚めたり瞑想を終えたりすると、すぐに消えてしまうかもしれません。少しイライラしてしまうかもしれませんね！そんな時のために、思い出せる断片的なことをメモに書き留めておいてはいかがでしょうか。そうすることで、かすかな思考に再び触れることができるでしょう。さらに、記録を残すことはあなたにとって大きな意味を持つでしょう。"
    },
    "sagittarius": {
      "date": "2026-01-24",
      "sign": "Sagittarius",
      "horoscope": "You might find yourself waiting longer than anticipated for a delivery that was supposed to arrive from a distance, leading you to question if it has gone missing. Fear not, Sagittarius; it’s simply delayed. Patience is key, as there’s little you can do but bide your time. Additionally, some of your work equipment may malfunction today, prompting the need for a repair technician. This hiccup could slow down your progress and leave you feeling restless. Consider finding an alternative task to occupy your time!",
      "horoscope_ja": "遠くから届くはずだった荷物が予想以上に長く待たされ、紛失したのではないかと心配になるかもしれません。射手座さん、心配しないでください。単に遅れているだけです。辛抱強く待つことが鍵です。できることはただ待つことだけです。さらに、今日は仕事の機材が故障し、修理業者を呼ぶ必要があるかもしれません。このトラブルで仕事の進捗が遅れ、落ち着かない気持ちになるかもしれません。時間をつぶすために別の仕事を見つけることを検討してみてください！"
    },
    "capricorn": {
      "date": "2026-01-24",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today you may find yourself brimming with passion and a strong desire for romance. If you have a date lined up, be prepared for the possibility that it might need to be rescheduled due to unforeseen circumstances. In the meantime, channel that intense energy into creative pursuits. Engaging with captivating books or films can serve as a satisfying distraction, though nothing quite compares to the thrill of real-life connections!",
      "horoscope_ja": "山羊座のあなたは、今日、情熱とロマンスへの強い欲求に溢れているかもしれません。デートの予定があるなら、予期せぬ事態で日程変更が必要になる可能性を覚悟しておきましょう。それまでは、その強いエネルギーをクリエイティブな活動に注ぎ込みましょう。魅力的な本や映画に没頭するのも良いでしょうが、現実の出会いのスリルに勝るものはありません！"
    },
    "aquarius": {
      "date": "2026-01-24",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you may find yourself welcoming a female guest who is seeking your support and understanding. She may bring along some surprising news that could catch you off guard. Additionally, a work-related crisis might require you or your partner to be away from home for a significant part of the day, which could lead to some frustration, especially if it means altering your plans. Stay strong and patient through this challenging time!",
      "horoscope_ja": "水瓶座のあなたは今日、あなたのサポートと理解を求めている女性のゲストを迎えることになるかもしれません。彼女は、あなたを驚かせるような驚くべきニュースを持ってくるかもしれません。また、仕事上の危機により、あなたやパートナーが一日の大半を家を空ける必要が生じるかもしれません。特に予定を変更しなければならない場合は、フラストレーションを感じるかもしれません。この困難な時期を乗り越え、強く、そして忍耐強くいてください！"
    },
    "pisces": {
      "date": "2026-01-24",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you may find that even the simplest tasks feel as daunting as Hercules' labors. The weight of overwork and stress could leave you feeling a bit off, so carving out some time for solitude and relaxation would be wise. If that's not possible, aim to take a more laid-back approach. Additionally, some surprising developments in your neighborhood might stir up gossip among your neighbors. Make sure to gather the facts before forming any opinions.",
      "horoscope_ja": "魚座のあなたは今日、どんなに単純な作業でもヘラクレスの重労働のように気が遠くなるような気がしてしまうかもしれません。過労とストレスの重圧で少し気分が落ち込むかもしれませんので、一人でリラックスする時間を作るのが賢明です。それが難しい場合は、もっとゆったりとした時間を過ごしてみましょう。また、近所で驚くべき出来事が起こり、近所の人たちの間で噂が広まるかもしれません。意見を述べる前に、必ず事実関係を把握するようにしてください。"
    }
  }
}