{
  "updated_at": "2026-01-02T16:31:37.290Z",
  "jst_date": "2026-01-03",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-03",
      "sign": "Aries",
      "horoscope": "Today, Aries, if you engage in writing or creative endeavors, you may feel as though the inspiration is flowing from an external source. Could this be the divine muse that others often mention? It's possible, or it might simply be your innate abilities finally taking center stage. Additionally, the stars favor your relationships today, so make sure to carve out some time for both old friends and new connections.",
      "horoscope_ja": "牡羊座のあなた、今日、もしあなたが執筆や創作活動に取り組んでいるなら、外からインスピレーションが湧き上がってくるように感じるかもしれません。これは、よく言われる神聖なミューズなのでしょうか？もしかしたら、そうかもしれません。あるいは、あなたの生まれ持った才能がようやく表舞台に出てきただけかもしれません。さらに、今日は星の導きもあなたの人間関係を後押しするので、古い友人や新しい友人と過ごす時間を作るようにしましょう。"
    },
    "taurus": {
      "date": "2026-01-03",
      "sign": "Taurus",
      "horoscope": "Taurus, it's time to step away from that book and venture outside! You've enjoyed your solitude for a while, but now is the moment to connect with others. Not only will you have a blast, but you may also stumble upon some valuable connections for the future. While group activities can be exciting, don't underestimate the joy of a meaningful one-on-one interaction.",
      "horoscope_ja": "おうし座さん、本から一歩踏み出して、外へ飛び出しましょう！しばらくは孤独を楽しんでいましたが、今こそ人とつながる時です。楽しい時間を過ごせるだけでなく、将来につながる貴重な繋がりが見つかるかもしれません。グループ活動は刺激的ですが、有意義な一対一の交流の喜びも忘れてはいけません。"
    },
    "gemini": {
      "date": "2026-01-03",
      "sign": "Gemini",
      "horoscope": "Gemini, your dedication to enhancing your life is starting to pay off! This newfound progress is the encouragement you've been seeking, especially as certain individuals may have been testing your self-esteem. Remember, don’t allow anyone to dim your vision of joy. Keep moving forward towards your aspirations, and don’t let minor challenges deter you from your path.",
      "horoscope_ja": "ふたご座さん、人生を豊かにするための努力が実を結び始めています！この新たな進歩は、あなたがずっと求めていた励みです。特に、これまで自尊心を試されてきた人たちがいたからです。誰にも喜びのビジョンを曇らせてはいけません。目標に向かって進み続け、小さな困難に阻まれてはいけません。"
    },
    "cancer": {
      "date": "2026-01-03",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, the individuals you encounter may prove to be incredibly advantageous for you down the line. Your perception is particularly sharp, so be sure to pay attention to all the intriguing things around you. The insights you gain today, along with the connections you forge, could come together in a significant way in the future. Additionally, your meticulous approach will enhance your work.",
      "horoscope_ja": "蟹座のあなた、今日出会う人々は、将来あなたにとって非常に有利なものとなるかもしれません。あなたの洞察力は特に鋭いので、周りの興味深いものすべてに注意を払ってください。今日得た洞察と築いた人脈は、将来、重要な形で結びつく可能性があります。さらに、あなたの細心の注意を払ったアプローチは、仕事の質を向上させるでしょう。"
    },
    "leo": {
      "date": "2026-01-03",
      "sign": "Leo",
      "horoscope": "Leo, you're entering a phase ripe with fresh opportunities. Whether you realize it or not, you're fully equipped to tackle new challenges ahead. It seems you've settled into a comfortable routine in your career, but you possess the potential to elevate yourself significantly. Why not seize this moment? A little determination is all it takes. Reflect on what your dream job looks like and go after it, or even better, take the initiative to craft it yourself!",
      "horoscope_ja": "レオ座さん、あなたは今、新たなチャンスに満ちた段階に入っています。気づいているかどうかは別として、あなたはこれから待ち受ける新たな挑戦に立ち向かう準備が万端です。仕事では快適なルーティンに落ち着いているように見えますが、あなた自身を大きく成長させる可能性を秘めています。この機会を逃さないでください。必要なのはほんの少しの決意だけです。夢の仕事の姿をじっくりと見つめ、それを追い求めてください。あるいは、もっと良いのは、自ら率先して夢の仕事を作り出すことです！"
    },
    "virgo": {
      "date": "2026-01-03",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, love is all around you! It's an ideal moment to put your best foot forward and ask that special person out for dinner. If you're already in a happy marriage, seize this wonderful energy to organize a romantic evening with your partner. Remember, even long-time couples deserve a little romance every now and then!",
      "horoscope_ja": "おとめ座さん、今日は愛があなたを取り囲んでいます！思い切って、大切な人をディナーに誘う絶好の機会です。すでに幸せな結婚生活を送っている方は、この素晴らしいエネルギーを掴んで、パートナーとロマンチックな夜を過ごしましょう。長年連れ添ったカップルでも、時にはロマンスを楽しむのは良いことなのです！"
    },
    "libra": {
      "date": "2026-01-03",
      "sign": "Libra",
      "horoscope": "Today, you're feeling a strong desire to elevate your style. Say goodbye to sensible shoes and practical attire, and embrace chic footwear and sumptuous fabrics instead. Your romantic spirit and passion are soaring, Libra, so why not make the most of this vibrant energy? The extra attention you give to your appearance is likely to yield fantastic rewards.",
      "horoscope_ja": "今日は、スタイルをワンランクアップさせたい強い願望を感じています。実用的な靴やシンプルな服装はもう終わりにして、シックな靴と贅沢な生地を取り入れましょう。ロマンチックな雰囲気と情熱が高まっている天秤座さん、この活気あるエネルギーを最大限に活かしてみませんか？外見に特別な注意を払うことで、素晴らしい成果が得られるでしょう。"
    },
    "scorpio": {
      "date": "2026-01-03",
      "sign": "Scorpio",
      "horoscope": "Scorpio, you too deserve your own fairy tale ending, just like the royals. The stars are aligning perfectly for you to draw a remarkable individual into your life. Forget about seeking out \"expert\" tips on finding a soulmate; it's your distinctive traits that will naturally attract the right person.",
      "horoscope_ja": "蠍座のあなた、あなたも王族のように、おとぎ話のような結末を迎えるにふさわしい人です。星々が完璧に並び、あなたの人生に素晴らしい人を引き寄せるでしょう。ソウルメイトを見つけるための「専門家」のアドバイスを求めるのはやめましょう。あなたならではの個性が、自然と理想の人を引き寄せるのです。"
    },
    "sagittarius": {
      "date": "2026-01-03",
      "sign": "Sagittarius",
      "horoscope": "Although you might be tempted to throw down the gauntlet with your family, Sagittarius, consider picking up an oven mitt instead. Engaging in cooking or tackling household tasks can serve as a great distraction from family tensions. If domestic duties aren't your thing, swap the mitt for some reading glasses and immerse yourself in your work. Remember, these familial strains are only temporary and will soon fade.",
      "horoscope_ja": "射手座のあなたは、家族と激しくぶつかりたくなるかもしれませんが、代わりにオーブンミットを使うことを検討してみてください。料理や家事に取り組むことは、家族の緊張から気を紛らわせるのに最適です。家事が苦手なら、ミットの代わりに老眼鏡を使って、仕事に没頭しましょう。こうした家族間の緊張は一時的なもので、すぐに薄れていくことを忘れないでください。"
    },
    "capricorn": {
      "date": "2026-01-03",
      "sign": "Capricorn",
      "horoscope": "Capricorn, you're feeling a strong desire to escape and travel abroad. It appears that this might be your best option to break free from the overwhelming load of work and social commitments that are stacking up. Is it realistic to think you can manage to attend every single one, or even a fraction of them? Have you thought about the possibility that you might not have to? Perhaps you could delegate someone to go in your place, or simply let others know that you won't be able to attend. Remember, it's perfectly okay to say no. You deserve some time to recharge.",
      "horoscope_ja": "山羊座のあなたは、現実逃避して海外旅行に行きたいと強く願っています。積み重なる仕事や社会的な約束の重圧から解放されるには、これが最善の選択肢かもしれません。すべての約束、あるいはほんの一部でも、きちんと出席できると思えますか？もしかしたら出席しなくて済むかもしれない、という可能性について考えてみましたか？誰かに代わりに出席してもらうか、出席できないことを他の人に伝えてみるのも良いかもしれません。でも、断るのは全く問題ないことを忘れないでください。あなたにはリフレッシュする時間が必要です。"
    },
    "aquarius": {
      "date": "2026-01-03",
      "sign": "Aquarius",
      "horoscope": "Aquarius, your hard work is finally getting the acknowledgment it deserves! However, this isn't the moment to kick back and relax. Instead, it's the perfect opportunity to put your innovative concepts into action. This time, you have the support of those in higher positions. There's no need to feel anxious; simply follow through with your original plans. If you put in the effort, you can expect significant professional and financial gains.",
      "horoscope_ja": "水瓶座さん、あなたの努力はついに正当な評価を受けています！しかし、今はのんびりくつろぐ時ではありません。むしろ、革新的なアイデアを実行に移す絶好の機会です。今回は、上司からのサポートも得られます。不安になる必要はありません。当初の計画を着実に実行に移しましょう。努力を重ねれば、仕事面でも経済面でも大きな成果が期待できます。"
    },
    "pisces": {
      "date": "2026-01-03",
      "sign": "Pisces",
      "horoscope": "As a Pisces, your nurturing spirit shines brightly, bringing immense comfort to those in your circle. While you instinctively tune into the needs of others, it's equally important to pay attention to your own well-being. Remember, you are worthy of the same kindness you offer. If you find yourself in need, don't hesitate to reach out; you may be pleasantly surprised by the support that even casual acquaintances can provide.",
      "horoscope_ja": "魚座のあなたは、育む精神が輝きを放ち、周りの人々に計り知れない安らぎをもたらします。本能的に他人のニーズに耳を傾ける一方で、自分自身の健康にも気を配ることも同様に大切です。あなたも、あなたが示すのと同じだけの優しさを受ける価値があることを忘れないでください。困っている時は、ためらわずに手を差し伸べてください。普段は知り合いでも、驚くほどの支えを得られるかもしれません。"
    }
  }
}