{
  "updated_at": "2025-12-31T16:31:32.933Z",
  "jst_date": "2026-01-01",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-01",
      "sign": "Aries",
      "horoscope": "You might find yourself juggling a lot of work and social commitments today. If you're hosting any gatherings this evening, consider enlisting some extra hands. If you can, order in some food or at least bring someone on board to assist with the cleanup. Keeping your guests satisfied is challenging enough without adding extra pressure on yourself. Remember, you don’t have to do it all alone!",
      "horoscope_ja": "今日は仕事と社交の予定が山ほどあるかもしれません。もし今晩、何か集まりを主催する予定があるなら、手伝ってくれる人を探してみてください。可能であれば、食べ物を注文したり、少なくとも片付けを手伝ってくれる人を連れてきたりしましょう。ゲストを満足させることだけでも大変なのに、自分自身にプレッシャーをかけなくても十分大変です。だから、全部一人でやらなくてもいいんです！"
    },
    "taurus": {
      "date": "2026-01-01",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you might find yourself caught between your personal cravings and the obligations of the outside world. While the comfort of your bed calls to you, the demands of life are relentless. Your phone is buzzing non-stop, and your inbox is overflowing faster than you can manage. If only you could enjoy a moment of peace! Unfortunately, that’s not in the cards. Make a pact with yourself to unwind and recharge once you return home, and let’s hope for a quiet evening without interruptions!",
      "horoscope_ja": "おうし座のあなたは今日、個人的な欲求と外の世界の義務の間で板挟みになっているかもしれません。ベッドの心地よさがあなたを呼んでいる一方で、生活の要求は容赦なく続きます。電話は鳴り止まず、受信トレイは処理しきれないほどの速さで溢れかえっています。ほんのひとときの安らぎを味わえたらいいのに！残念ながら、それは叶いません。帰宅したら、リラックスしてエネルギーを充電しようと心に誓い、誰にも邪魔されない静かな夜を過ごせるよう祈りましょう！"
    },
    "gemini": {
      "date": "2026-01-01",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you might feel the urge to spruce up your living space, and there's nothing wrong with seeking that instant satisfaction. As you venture out for some shopping, take a moment to reflect on what will genuinely enhance your home in the long term. Trends can be fleeting, and chasing after them can lead to unnecessary expenses. Instead, focus on acquiring pieces that resonate with your authentic taste. You may end up with fewer items, but those you choose will hold enduring significance.",
      "horoscope_ja": "ふたご座のあなたは、今日、住空間を華やかにしたい衝動に駆られるかもしれません。そして、その瞬間的な満足感を求めるのも悪くありません。買い物に出かける際には、少し時間を取って、長期的に見て本当に家を良くしてくれるものは何なのかをじっくり考えてみましょう。トレンドは一時的なもので、追いかけると無駄な出費につながる可能性があります。むしろ、自分の本当の好みに響くものを手に入れることに集中しましょう。最終的には持ち物は減るかもしれませんが、選んだものは永遠に残る意味を持つでしょう。"
    },
    "cancer": {
      "date": "2026-01-01",
      "sign": "Cancer",
      "horoscope": "Cancer, remember that you owe no one any proof of your abilities. You might be sensing some urgency to complete various tasks, but certain endeavors, particularly those that call for creativity, cannot be hurried. By giving yourself the space to breathe and letting your inspiration flow, you'll create something truly valuable. On the other hand, if you attempt to speed through the process, you may find your efforts wasted.",
      "horoscope_ja": "蟹座のあなたは、自分の能力を誰かに証明する義務はないということを覚えておいてください。様々なタスクを終わらせなければならないという焦りを感じているかもしれませんが、特に創造性が求められるような取り組みは、急ぐべきではありません。息抜きの余裕を持ち、インスピレーションを自由に解き放つことで、真に価値のあるものを生み出すことができるでしょう。一方で、プロセスを急ごうとすると、努力が無駄になってしまうかもしれません。"
    },
    "leo": {
      "date": "2026-01-01",
      "sign": "Leo",
      "horoscope": "Leo, your diverse talents and skills can sometimes leave you feeling overwhelmed about where to focus your energy. Today, resist the temptation to tackle everything at once. Remember, even you have your boundaries! It would be wise to take a moment to reassess your extensive \"to do\" list. Instead of mixing major projects with minor tasks, hone in on one or two key priorities.",
      "horoscope_ja": "獅子座さん、あなたは多彩な才能とスキルを持っているため、どこにエネルギーを集中させるべきか分からず、圧倒されてしまうことがあります。今日は、一度に全てに取り組みたいという誘惑に抗いましょう。あなたにも限界があることを忘れないでください！少し時間を取って、膨大な「ToDoリスト」を見直してみるのが賢明です。大きなプロジェクトと小さなタスクを混在させるのではなく、1つか2つの重要な優先事項に絞り込みましょう。"
    },
    "virgo": {
      "date": "2026-01-01",
      "sign": "Virgo",
      "horoscope": "Virgo, it appears you're on the brink of a significant transformation in your life. However, be cautious not to pursue change for its own sake. Take a moment to reflect on your true desires. You might discover that the adjustments you crave are more subtle than you initially thought. Perhaps it's time to focus on enhancing your health—consider incorporating jogging into your routine a few times a week and opting for salads over sandwiches at lunch. These small shifts could create a positive wave of wellness in your life.",
      "horoscope_ja": "おとめ座さん、あなたは人生において大きな変化の瀬戸際にいるようです。しかし、変化そのものを追い求めすぎないように注意しましょう。少し時間を取って、自分の本当の願いをじっくり考えてみましょう。あなたが切望している変化は、当初考えていたよりもさりげないものであることに気づくかもしれません。もしかしたら、健康増進に重点を置く時期かもしれません。週に数回ジョギングを習慣に取り入れたり、ランチはサンドイッチではなくサラダを選んでみたりしてみてはいかがでしょうか。こうした小さな変化が、あなたの人生に健康への良い波を起こすかもしれません。"
    },
    "libra": {
      "date": "2026-01-01",
      "sign": "Libra",
      "horoscope": "Libra, your intellect is sharp, and you have a remarkable ability to soak up knowledge. However, today might stretch your mental capacity to its breaking point. You could find yourself inundated with information at work, leaving you feeling swamped. Meanwhile, at home, a stack of unread books and magazines may be calling your name. It might be wise to give your mind a break this evening and indulge in some light entertainment instead. Sometimes, a little downtime is just what you need.",
      "horoscope_ja": "天秤座さん、あなたは知性が鋭く、知識を吸収する素晴らしい能力を持っています。しかし、今日はあなたの思考能力が限界に達するかもしれません。仕事では大量の情報に圧倒され、圧倒されてしまうかもしれません。一方、家では、未読の本や雑誌の山があなたを呼んでいるかもしれません。今晩は、心を休めて、軽い娯楽に浸るのが賢明かもしれません。時には、ほんの少しの休息こそが、まさに必要な時なのです。"
    },
    "scorpio": {
      "date": "2026-01-01",
      "sign": "Scorpio",
      "horoscope": "Scorpio, be mindful not to overextend yourself today. Your heart is in the right place and your drive is commendable, but remember that time is finite—there are only 24 hours in a day. Select your commitments wisely to ensure you can follow through on your promises. By focusing your energy on a handful of meaningful pursuits, you'll find greater effectiveness and fulfillment.",
      "horoscope_ja": "蠍座のあなた、今日は無理をしないように気をつけてください。あなたの心は正しい方向へ向かっており、その情熱は称賛に値しますが、時間は有限であることを忘れないでください。1日はたった24時間しかありません。約束を果たせるよう、何をするかは慎重に選びましょう。意味のあることにエネルギーを集中させることで、より大きな効果と充実感が得られるでしょう。"
    },
    "sagittarius": {
      "date": "2026-01-01",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, it's wise to look beyond the surface, particularly when it comes to financial matters. A friend or coworker may present you with an enticing offer that seems irresistible. However, be cautious and don't get swept away by the allure of easy money. Remember, if something appears \"too good to be true,\" it often is. Gather the details and take your time to assess them later. You'll likely uncover some inconsistencies when you approach the situation with a clear mind.",
      "horoscope_ja": "射手座の皆さん、今日は表面的なことだけでなく、もっと深く考えることが賢明です。特に金銭面に関してはなおさらです。友人や同僚から、思わず引き下がってしまうような魅力的な提案を受けるかもしれません。しかし、注意が必要です。簡単にお金が手に入るという誘惑に流されてはいけません。「良すぎる話」に思える場合は、大抵の場合そうではないことを覚えておいてください。詳細をまとめ、後でじっくりと評価してみましょう。冷静な気持ちで状況に臨めば、矛盾点が見つかるかもしれません。"
    },
    "capricorn": {
      "date": "2026-01-01",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you might feel inundated with a flood of information. By noon, your voicemail and inbox could be brimming with messages, as it seems everyone is vying for your attention. It's crucial not to stretch yourself too thin trying to meet everyone's demands; it's just not feasible. Focus on prioritizing what truly matters to you. While you may encounter some pushback from superiors, they will ultimately recognize the soundness of your judgment.",
      "horoscope_ja": "山羊座のあなたは今日、大量の情報に圧倒されているように感じるかもしれません。正午には、留守番電話や受信トレイがメッセージで溢れかえるかもしれません。まるで誰もがあなたの注意を引こうと競い合っているかのようです。全員の要求に応えようと無理をしすぎないことが重要です。それは現実的ではありません。本当に大切なことを優先することに集中してください。上司から反発を受けることもあるかもしれませんが、最終的にはあなたの判断力の正しさを認めてくれるでしょう。"
    },
    "aquarius": {
      "date": "2026-01-01",
      "sign": "Aquarius",
      "horoscope": "Aquarius, while you may have tasks to tackle today, it's wise to approach them with a laid-back attitude. You're not quite in the mood to dive into your responsibilities with your usual enthusiasm. Make it a point to nourish yourself with a wholesome breakfast and lunch, as your body might be reacting to some recent treats. A light lunch of soup and salad, paired with ample hydration, is recommended. By the time the day wraps up, you should notice a resurgence of your energy.",
      "horoscope_ja": "水瓶座さん、今日はやらなければならない仕事があるかもしれませんが、ゆったりとした態度で取り組むのが賢明です。いつものように熱心に責任に取り組める気分ではありません。最近の甘いものへの反応で体が反応しているかもしれませんので、栄養のある朝食と昼食で栄養を摂るようにしましょう。スープとサラダの軽めの昼食に、十分な水分補給がおすすめです。一日が終わる頃には、エネルギーが満ち溢れていることに気づくでしょう。"
    },
    "pisces": {
      "date": "2026-01-01",
      "sign": "Pisces",
      "horoscope": "Creativity can't be rushed, dear Pisces. Even with your strong desire to create something extraordinary right now, remember that we all rely on a creative muse to inspire us. Unfortunately, this muse can be quite elusive. You can't simply command it to appear; instead, you need to gently encourage it to reveal itself. This process requires patience, but the rewards will be well worth the wait. For the moment, take a step back, be patient, and have faith that inspiration will find its way to you.",
      "horoscope_ja": "魚座の皆さん、創造性は焦ってはいけません。今、何か素晴らしいものを作りたいという強い思いを抱いているとしても、私たちは皆、インスピレーションを与えてくれる創造のミューズに頼っていることを忘れないでください。残念ながら、このミューズはなかなか現れにくいものです。ただ命令するだけでは現れません。優しく促して、自ら姿を現すように促す必要があります。このプロセスには忍耐が必要ですが、その見返りは待つだけの価値があります。今は一歩下がって、辛抱強く、インスピレーションがあなたに訪れると信じてください。"
    }
  }
}