{
  "updated_at": "2025-11-27T16:30:15.834Z",
  "jst_date": "2025-11-28",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-28",
      "sign": "Aries",
      "horoscope": "A close friend or romantic partner might be caught up in their own thoughts today, making them less present in your company. They may not be ready to open up about what's bothering them, so it's best to avoid pushing for a deep conversation. Give them the space they need to process their feelings on their own. Sometimes, the best support is simply allowing them to navigate their challenges in solitude.",
      "horoscope_ja": "親しい友人や恋人は、今日は自分の考えに囚われていて、あなたと一緒にいることが減っているかもしれません。彼らはまだ悩みを打ち明ける準備ができていないかもしれません。ですから、深い話を無理強いするのは避けた方が良いでしょう。彼らが一人で自分の気持ちを整理するために必要な時間を与えてください。時には、彼らが一人で困難を乗り越えていくのをただ見守ることが、最高のサポートとなることもあります。"
    },
    "taurus": {
      "date": "2025-11-28",
      "sign": "Taurus",
      "horoscope": "Today, your mind and emotions might feel a bit muddled, leaving you feeling distracted. While others may engage you in conversation, you might find it hard to truly absorb their words, and your recollection may be even fuzzier. Rest assured, this is just a fleeting phase. There's no need to fret about coming off as impolite; those who truly matter understand your situation. Consider diving into some captivating novels that whisk you away from reality. The details may slip your mind, but the joy of the journey will remain!",
      "horoscope_ja": "今日は、心と感情が少し混乱していて、集中できないかもしれません。誰かと会話をしても、相手の言葉を深く理解できず、記憶も曖昧になっているかもしれません。でも、ご安心ください。これは一時的なものです。失礼な印象を与えるのではないかと心配する必要はありません。本当に大切な人はあなたの状況を理解しています。現実から一瞬にして離れられる、魅力的な小説に浸ってみてはいかがでしょうか。細かいことは忘れてしまうかもしれませんが、旅の喜びはいつまでも残ります！"
    },
    "gemini": {
      "date": "2025-11-28",
      "sign": "Gemini",
      "horoscope": "Your love life is likely flourishing at the moment, but today you might find yourself feeling a bit uncertain. Your partner may seem distant and lost in thought. Resist the urge to let your worries take over! The issues your loved one is facing are likely related to financial concerns and not a reflection of your relationship. Trust that they will open up to you when they feel ready.",
      "horoscope_ja": "恋愛は今、順調に進んでいるようですが、今日は少し不安な気持ちになっているかもしれません。パートナーがどこかよそよそしく、考え事をしているように見えるかもしれません。心配に支配されてしまう衝動を抑えましょう！愛する人が抱えている問題は、おそらく経済的な問題に関係しており、二人の関係を反映しているわけではありません。心の準備ができたら、きっと心を開いてくれると信じてください。"
    },
    "cancer": {
      "date": "2025-11-28",
      "sign": "Cancer",
      "horoscope": "You might find yourself overwhelmed with household tasks today, unsure of where to begin. Family members may not be stepping up to assist. Resist the urge to give up and let everything slide. Take a moment to survey your surroundings, identify a task that needs attention, and tackle it. Continue this way until you feel fatigued. Remember, there's no need to push yourself to the brink, even if you have guests coming over. After all, their homes can get cluttered too!",
      "horoscope_ja": "今日は家事に追われて、どこから手を付けていいのかわからないかもしれません。家族が手伝ってくれないかもしれません。諦めて何もかも放っておこうという衝動を抑えましょう。少し時間を取って周囲を見渡し、注意が必要な作業を特定し、それに取り組みましょう。疲れを感じるまでこれを続けましょう。たとえお客さんが来たとしても、無理に頑張る必要はありません。お客さんの家も散らかっているものですから！"
    },
    "leo": {
      "date": "2025-11-28",
      "sign": "Leo",
      "horoscope": "You might find yourself drawn to the mysterious and the unexplained today. Engaging with literature on these intriguing topics could be particularly appealing, making it a perfect day for some reading. While some ideas may initially seem odd, resist the urge to dismiss them outright. The key is to embrace curiosity and maintain an open mind, as the world is full of surprising revelations waiting to be uncovered.",
      "horoscope_ja": "今日は、謎めいたものや説明のつかないものに惹かれるかもしれません。こうした興味深いテーマを扱った文学作品に特に興味を惹かれ、読書に最適な日となるでしょう。最初は奇妙に思えるアイデアもあるかもしれませんが、それをすぐに否定したくなる衝動を抑えてください。重要なのは、好奇心を大切にし、心を開いておくことです。世界は、解き明かされるのを待っている驚くべき発見で満ち溢れているのですから。"
    },
    "virgo": {
      "date": "2025-11-28",
      "sign": "Virgo",
      "horoscope": "Today, the deep loyalty you have for a friend could lead you into a delicate predicament. They might request a favor that feels challenging, if not unfeasible. Take a moment to assess the situation and see if there's a way you can lend a hand. If it turns out you can't, don't worry—just remember that making amends later is sometimes the best course of action.",
      "horoscope_ja": "今日、友人への深い忠誠心が、あなたを微妙な窮地に陥らせるかもしれません。友人は、実現不可能ではないにしても、困難に思えるような頼みごとをしてくるかもしれません。少し時間を取って状況を判断し、手を貸せる方法がないか考えてみましょう。もし無理だとしても、心配しないでください。後で和解するのが最善の策である場合もあることを覚えておいてください。"
    },
    "libra": {
      "date": "2025-11-28",
      "sign": "Libra",
      "horoscope": "Today, you might find yourself in a haze of confusion, especially if you have a strong intuitive side. You could be picking up on unusual energies that feel disconcerting. It's best not to overanalyze these sensations. Your extrasensory perception might be slightly skewed, or perhaps the emotions of those around you are tangled and uncertain. It could even be a mix of both. Rest assured, clarity will return by tomorrow.",
      "horoscope_ja": "今日は、特に直感力の強い方は、混乱に陥ってしまうかもしれません。普段とは違うエネルギーを感じ取り、不安にさせられるかもしれません。こうした感覚を過度に分析しない方が良いでしょう。超感覚的な知覚が少し歪んでいるのかもしれませんし、周囲の人々の感情が複雑に絡み合っていて不安定になっているのかもしれません。あるいは、その両方かもしれません。安心してください。明日には明晰な思考が戻ってきます。"
    },
    "scorpio": {
      "date": "2025-11-28",
      "sign": "Scorpio",
      "horoscope": "Today, you may experience some unusual dreams or vivid visions. It's wise not to take them too seriously. These images may be a mix of memories from your past, recent insights, and your own anxieties about what lies ahead. By interpreting them in this light, you can uncover the messages they hold. Remember, they are not predictions of what’s to come.",
      "horoscope_ja": "今日、あなたは変わった夢や鮮明なビジョンを見るかもしれません。あまり真剣に受け止めない方が賢明です。これらのイメージは、過去の記憶、最近の洞察、そして将来への不安が混ざり合ったものかもしれません。こうした観点から解釈することで、そこに込められたメッセージを読み解くことができるでしょう。ただし、これらは未来を予言するものではないことを忘れないでください。"
    },
    "sagittarius": {
      "date": "2025-11-28",
      "sign": "Sagittarius",
      "horoscope": "News from your friends might stir up some concerns regarding your financial stability. You could feel like your aspirations are at risk, especially if the information you've received is accurate. However, it’s important to verify the details before letting anxiety take over. You may discover that there’s actually no cause for alarm.",
      "horoscope_ja": "友人からのニュースは、あなたの経済的な安定について不安を掻き立てるかもしれません。特に、受け取った情報が正確であれば、自分の夢が危うくなっているように感じるかもしれません。しかし、不安に支配される前に、詳細を確認することが重要です。実際には心配する必要がないことがわかるかもしれません。"
    },
    "capricorn": {
      "date": "2025-11-28",
      "sign": "Capricorn",
      "horoscope": "Typically, you share a deep intuitive connection with your loved ones, but today you may sense that this ability is on pause. You might receive mixed signals or perhaps feel completely disconnected. There's no need to fret; your intuition is still intact! For the time being, lean on verbal communication.",
      "horoscope_ja": "普段は愛する人々と深い直感的なつながりを共有していますが、今日はその能力が一時的に停止しているように感じるかもしれません。相手から矛盾したメッセージを受け取っていたり、完全に繋がりを失っているように感じたりするかもしれません。心配する必要はありません。あなたの直感は健在です！しばらくは、言葉によるコミュニケーションに頼りましょう。"
    },
    "aquarius": {
      "date": "2025-11-28",
      "sign": "Aquarius",
      "horoscope": "Today, you might find it challenging to concentrate on your household tasks. Your thoughts are drifting towards higher pursuits, like spiritual and intellectual explorations, leaving you feeling a bit sluggish. Remember, it's perfectly fine to take a break! You don’t need to push yourself to the limit every single day. Take some time to unwind at home—dive into a good book, enjoy your favorite shows, or whip up a meal if you feel inclined. Your chores can hold off until you regain your energy.",
      "horoscope_ja": "今日は家事に集中するのが難しいかもしれません。思考がスピリチュアルな探求や知的な探求といった高尚なことに向いてしまい、少しだるさを感じてしまうかもしれません。でも、休憩を取るのは全く問題ありません！毎日無理して自分を追い込む必要はありません。家でゆっくりする時間を取りましょう。良い本を読んだり、お気に入りの番組を楽しんだり、気が向いたら食事を用意したり。家事はエネルギーが回復するまで控えましょう。"
    },
    "pisces": {
      "date": "2025-11-28",
      "sign": "Pisces",
      "horoscope": "Today, you might find that inspiration is a bit hard to grasp. While you may feel a strong desire to engage in something artistic, your thoughts may be scattered and unsatisfactory. Instead of struggling to generate fresh concepts, consider collaborating with the creativity of others. Dive into a good book, listen to the works of a renowned composer, or replicate a masterpiece. This approach will help you maintain your creative flow without the pressure of conjuring new ideas that may not be ready to surface.",
      "horoscope_ja": "今日は、インスピレーションが湧きにくいと感じるかもしれません。何か芸術的なことに取り組みたいという強い意欲はあるものの、思考が散漫で満足感が得られないかもしれません。新しいアイデアを生み出すのに苦労する代わりに、他の人の創造性とコラボレーションすることを検討してみてください。良書に没頭したり、著名な作曲家の作品を聴いたり、傑作を再現したりしてみましょう。このアプローチは、まだ表に出てこないかもしれない新しいアイデアを思いつくプレッシャーを感じることなく、創造力を維持するのに役立ちます。"
    }
  }
}