{
  "updated_at": "2025-11-22T16:27:25.216Z",
  "jst_date": "2025-11-23",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-23",
      "sign": "Aries",
      "horoscope": "You may be overlooking a certain facet of your personality. Your desire to take the lead in relationships is strong, but consider shifting this approach. The current planetary alignment offers a perfect opportunity for growth in this area. By softening your controlling tendencies, you'll find that others are more open to your inherent charisma!",
      "horoscope_ja": "あなたは自分の性格のある側面を見落としているかもしれません。人間関係において主導権を握りたいという強い願望があるかもしれませんが、そのアプローチを変えることを検討してみてください。現在の惑星の配置は、この分野で成長するための絶好の機会です。支配的な傾向を和らげることで、周りの人はあなたの持ち前のカリスマ性にもっと心を開いてくれるでしょう。"
    },
    "taurus": {
      "date": "2025-11-23",
      "sign": "Taurus",
      "horoscope": "Today, keep your emotions in check and use them to your advantage. When you channel your feelings wisely, you'll possess the strength of ten individuals. You'll feel unstoppable, capable of achieving anything you set your mind to. By sharing this vibrant energy with those around you, you may inspire them to feel as empowered as you do—truly at the top of their game.",
      "horoscope_ja": "今日は、感情をコントロールし、それを自分の強みとして活かしましょう。感情を賢くコントロールすれば、10人分の力を持つことができます。何者にも負けない強さ、心に決めたことは何でも達成できるという自信が湧いてくるでしょう。この活力あふれるエネルギーを周りの人たちと共有することで、周りの人たちもあなたと同じように力強く、真の意味で最高のパフォーマンスを発揮できると感じられるでしょう。"
    },
    "gemini": {
      "date": "2025-11-23",
      "sign": "Gemini",
      "horoscope": "Today marks a turning point where you'll truly embrace your leadership abilities. It will feel as if you were destined for this role. You'll skillfully orchestrate the day's events, much like a conductor leading a symphony. You'll guide those around you with confidence and clarity. Relish in the joy of wielding such personal influence!",
      "horoscope_ja": "今日は、あなたのリーダーシップ能力を真に発揮できる転換点となります。まるでこの役割に運命づけられていたかのように感じるでしょう。まるで交響曲を指揮する指揮者のように、今日の出来事を巧みに演出するでしょう。自信と明晰さをもって、周囲の人々を導くでしょう。このような個人的な影響力を発揮する喜びを、存分に味わってください！"
    },
    "cancer": {
      "date": "2025-11-23",
      "sign": "Cancer",
      "horoscope": "Today is a day for authenticity, as you'll find the courage to express your genuine emotions. Even if you've kept them under wraps, they're still very much a part of you. You might have believed that revealing your feelings is a vulnerability, but today you'll demonstrate that your heart is not impenetrable, allowing yourself to be open and free.",
      "horoscope_ja": "今日は、ありのままの自分を表現する勇気を持つ日です。たとえ心の奥底に秘めていた感情であっても、それはあなたの一部です。感情をさらけ出すことは弱さを示すことだと思っていたかもしれませんが、今日は、あなたの心は誰にも打ち明けられないものではないことを示して、心を開き、自由になることができるでしょう。"
    },
    "leo": {
      "date": "2025-11-23",
      "sign": "Leo",
      "horoscope": "A positive shift in your demeanor is set to enhance your romantic experiences. You've let go of insecurities regarding your body, allowing you to fully immerse yourself in intimate moments. This newfound confidence will enable you to savor the present, free from the usual distractions of overthinking. Embrace this transformation, as you're on the brink of discovering the joys that life has to offer.",
      "horoscope_ja": "あなたの態度にポジティブな変化が訪れ、ロマンチックな体験がより充実したものになるでしょう。自分の体への不安を手放し、親密な瞬間に心ゆくまで浸ることができるようになりました。この新たな自信によって、考えすぎによるいつもの煩わしさから解放され、今この瞬間を心ゆくまで満喫できるでしょう。人生がもたらす喜びを発見する寸前、この変化を心から受け入れましょう。"
    },
    "virgo": {
      "date": "2025-11-23",
      "sign": "Virgo",
      "horoscope": "In the upcoming weeks, you'll find yourself brimming with vitality. The current planetary movements are boosting your energy levels significantly. Your passions, both in love and creativity, will flourish. It's important to maintain a sense of control in various situations. Be mindful not to let your emotions, or those of others, dictate your path.",
      "horoscope_ja": "今後数週間、あなたは活力に満ち溢れていることに気づくでしょう。現在の惑星の動きは、あなたのエネルギーレベルを著しく高めています。愛と創造力の両方において、あなたの情熱が開花するでしょう。様々な状況において、コントロール感を維持することが重要です。自分の感情や他人の感情に左右されないように、注意深く見守ってください。"
    },
    "libra": {
      "date": "2025-11-23",
      "sign": "Libra",
      "horoscope": "Your sensual nature is shining brightly today, amplifying your emotional intensity. Expect to radiate this energy, leaving those around you in awe of your magnetic presence. You possess the charm to captivate anyone you meet. However, it's wise to harness this power carefully; losing control could lead you into a scenario you may later wish to avoid.",
      "horoscope_ja": "今日はあなたの官能的な性質が明るく輝き、感情の激しさを増幅させています。このエネルギーを放ち、周囲の人々をあなたの磁力のような存在感に畏敬の念を抱かせるでしょう。あなたは出会う人すべてを魅了する魅力の持ち主です。しかし、この力は慎重に扱うべきです。制御を失うと、後々避けたい事態に陥ってしまう可能性があります。"
    },
    "scorpio": {
      "date": "2025-11-23",
      "sign": "Scorpio",
      "horoscope": "You have a natural affinity for connecting with new faces and engaging in conversation, yet you often maintain a level of emotional distance. Today, you might find yourself contemplating whether your guarded approach is preventing you from enjoying enriching experiences, or if your protective barriers are necessary for your well-being.",
      "horoscope_ja": "あなたは新しい人と繋がり、会話に積極的に参加することに自然な親和性を持っていますが、同時に、感情的な距離を保つこともしばしばです。今日は、自分の警戒心が豊かな経験を妨げているのか、それとも、その防御壁があなたの幸福に不可欠なのか、考えさせられるかもしれません。"
    },
    "sagittarius": {
      "date": "2025-11-23",
      "sign": "Sagittarius",
      "horoscope": "Today, you might find yourself feeling somewhat adrift. A significant decision looms on the horizon, one that could have a profound impact on your life. Should you follow your heart's desires and let them guide you? Or is it wiser to temper your emotions and opt for a more pragmatic approach? This is a moment for reflection.",
      "horoscope_ja": "今日は、どこか漂流感を感じているかもしれません。人生に深く影響を与える可能性のある重大な決断が迫っています。心の欲望に身を任せ、それに導かれるべきでしょうか？それとも、感情を抑えて、より現実的なアプローチを選ぶ方が賢明でしょうか？今こそ、じっくり考える時です。"
    },
    "capricorn": {
      "date": "2025-11-23",
      "sign": "Capricorn",
      "horoscope": "Today marks a shift in how you view your relationships. Previously guided by emotions, you're now inclined to adopt a more logical perspective. While this newfound approach may initially seem like it could dampen your joy, it has the potential to foster deeper, more resilient connections.",
      "horoscope_ja": "今日は、人間関係に対するあなたの見方が変わる日です。これまで感情に左右されていたあなたは、より論理的な視点を持つ傾向にあります。この新しいアプローチは、最初は喜びを削ぐように思えるかもしれませんが、より深く、より強固な絆を育む可能性を秘めています。"
    },
    "aquarius": {
      "date": "2025-11-23",
      "sign": "Aquarius",
      "horoscope": "You're ready to embrace a more liberated version of yourself. The days of strict self-control are behind you, and you're eager to explore your true desires! There's a refreshing energy around you that encourages open expression. Share your wants and needs with your partner; this honesty can strengthen your bond and enhance your relationship.",
      "horoscope_ja": "より自由な自分を受け入れる準備が整いました。厳しい自制心は終わり、真の欲望を探求したい気持ちが高まっています。あなたを取り巻く爽やかなエネルギーは、率直な表現を促します。パートナーと自分の欲求やニーズを共有しましょう。この誠実さは、二人の絆を強め、より良い関係を築くことができるでしょう。"
    },
    "pisces": {
      "date": "2025-11-23",
      "sign": "Pisces",
      "horoscope": "Current planetary influences may prompt a shift in your perspective on life. You might find yourself driven to strengthen the bonds with those you've recently encountered. There’s a chance you’ll develop feelings for one of them, but tread carefully, as they may not reciprocate your affections. Stay optimistic! Consider this: why invest your energy in someone who doesn’t appreciate you?",
      "horoscope_ja": "現在の惑星の影響により、人生観に変化が訪れるかもしれません。最近出会った人たちとの絆を深めたいという気持ちが強くなるかもしれません。誰かに好意を抱く可能性もあるでしょうが、相手があなたの愛情に応えてくれるとは限らないので、慎重に行動しましょう。楽観的な気持ちでいましょう！考えてみてください。あなたを大切に思ってくれない人に、なぜエネルギーを費やす必要があるのでしょうか？"
    }
  }
}