{
  "updated_at": "2026-02-17T21:28:11.952Z",
  "jst_date": "2026-02-18",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-18",
      "sign": "Aries",
      "horoscope": "Today, Aries, you might find that financial matters stir up some tension with a friend. It could be that they owe you money and are unable to repay it, or the other way around. If this resonates with you, consider finding a solution that works for both parties. Remember, there’s often a path to a mutually beneficial outcome, as long as you keep your cool and don’t let frustration cloud your judgment. Stay composed and attentive, and everything should turn out fine. Keep your chin up!",
      "horoscope_ja": "牡羊座のあなたは今日、金銭的な問題で友人との間に緊張が生じるかもしれません。相手があなたに借金をしていて、返済できない、あるいはその逆の場合もあるでしょう。もしあなたがこれに共感するなら、双方にとってメリットのある解決策を見つけることを検討してください。冷静さを保ち、イライラして判断を鈍らせなければ、双方にとって有益な結果につながる道が必ずあることを忘れないでください。落ち着いて注意深く接すれば、すべてうまくいくはずです。前向きに！"
    },
    "taurus": {
      "date": "2026-02-18",
      "sign": "Taurus",
      "horoscope": "Today, you might find yourself at a social gathering where you encounter someone harboring deep-seated resentment and frustration, Taurus. This interaction may not be the most enjoyable, as they may view you as a sympathetic ear for their grievances. Remember, you don’t have to feel obligated! Politely excuse yourself when the moment allows, and seek out the company of other friends who will bring you much more joy!",
      "horoscope_ja": "おうし座のあなたは、今日、社交の場で根深い恨みや不満を抱えた人に出会うかもしれません。相手はあなたを、不満を共感してくれる人だと捉えてしまうかもしれません。ですから、このやり取りはあまり楽しいものではないかもしれません。でも、無理に義務感を持つ必要はありません！状況が許せば、丁重に退席し、もっと楽しい時間を過ごしてくれる友人たちとの時間を探しましょう！"
    },
    "gemini": {
      "date": "2026-02-18",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, your work environment may feel quite chaotic as a coworker gears up for a significant business journey. Tensions might run high and patience could wear thin. It's essential to maintain your focus and complete your tasks without letting the stress overwhelm you. You might find yourself playing the role of the calm in the storm, even if you secretly wish to escape to a quiet space. When your colleague finally departs in the taxi, take a moment to express gratitude for the return of peace.",
      "horoscope_ja": "ふたご座さん、今日は同僚が重要な出張に向けて準備を進めているため、職場環境がかなり混沌としているように感じるかもしれません。緊張が高まり、忍耐が限界に達するかもしれません。ストレスに押しつぶされることなく、集中力を維持し、仕事を完遂することが重要です。静かな場所に逃げ込みたいと密かに願っていても、嵐の中の静けさのような役割を演じている自分に気づくかもしれません。同僚がタクシーでようやく出発する時、平穏が戻ってきたことに感謝の気持ちを伝えましょう。"
    },
    "cancer": {
      "date": "2026-02-18",
      "sign": "Cancer",
      "horoscope": "Today holds great potential for you, Cancer! Your creativity, intuition, and imagination are soaring, and you might find yourself brimming with inspiration for new artistic endeavors. You'll be eager to share your thoughts with anyone who is willing to listen. However, be mindful that a child, dear friend, or partner may feel a bit neglected and could throw a minor tantrum. Don't fret; they'll bounce back soon enough.",
      "horoscope_ja": "蟹座のあなたにとって、今日は大きな可能性を秘めた日です！創造性、直感、想像力が高まり、新しい芸術的試みへのインスピレーションが溢れるかもしれません。耳を傾けてくれる人には、自分の考えを積極的に共有したくなるでしょう。ただし、お子さんや親しい友人、パートナーが少し疎外感を感じ、癇癪を起こす可能性もあるので、ご安心ください。でも、心配しないでください。すぐに立ち直りますよ。"
    },
    "leo": {
      "date": "2026-02-18",
      "sign": "Leo",
      "horoscope": "Today, Leo, your home is likely to be bustling with activity. Expect a stream of visitors, which may test your patience at times. Additionally, you might need to play the peacemaker for a family member who is feeling irritable. Be cautious not to let their frustrations ignite your own temper. Maintain your composure and clarity, and you'll navigate the day successfully.",
      "horoscope_ja": "獅子座さん、今日はあなたの家が賑やかになりそうです。次々と訪問者が訪れ、時には忍耐力が試されるかもしれません。また、イライラしている家族のために仲裁役を務める必要があるかもしれません。彼らの不満に自分の感情が火に油を注がれないように注意しましょう。平静さと明晰さを保てば、一日をうまく乗り切ることができるでしょう。"
    },
    "virgo": {
      "date": "2026-02-18",
      "sign": "Virgo",
      "horoscope": "Today, a coworker may be seeking your understanding and support, Virgo. The pressures at work are weighing heavily on everyone, so it’s possible you’ll witness a colleague breaking down emotionally. Your patience might be tested more than usual. On days like this, aim to work efficiently, keep your concentration sharp, and treat yourself to a drink after hours. A pleasant stroll home will help you unwind!",
      "horoscope_ja": "おとめ座のあなた、今日は同僚があなたの理解とサポートを求めているかもしれません。職場のプレッシャーは誰にとっても重くのしかかっているので、同僚が精神的に参ってしまうのを目にするかもしれません。あなたの忍耐力がいつも以上に試されるかもしれません。こんな日は、効率的に仕事をし、集中力を高め、仕事の後は一杯飲んでリラックスしましょう。心地よい散歩で家路につくと、リラックスできるでしょう！"
    },
    "libra": {
      "date": "2026-02-18",
      "sign": "Libra",
      "horoscope": "Today, Libra, you may encounter some disappointment from children, close friends, or a romantic partner. Their desires may exceed your current financial means, leading to some frustration. It will be important for you to offer comfort and remind them that just because something isn't possible right now, it doesn't mean it will never happen. If they seem unresponsive, it's best to step back and allow them to process their feelings in their own time.",
      "horoscope_ja": "天秤座のあなたは今日、子供、親しい友人、あるいは恋人から失望を味わうかもしれません。彼らの望みはあなたの経済力を超えており、フラストレーションを感じているかもしれません。彼らを慰め、今できないからといって、永遠に実現しないわけではないと伝えてあげることが大切です。もし彼らが反応を示していないようであれば、一歩引いて、彼らが自分のペースで感情を整理できるようにしてあげるのが最善です。"
    },
    "scorpio": {
      "date": "2026-02-18",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you might find yourself preoccupied with concerns about a family member. They could be feeling stressed about their job, finances, or perhaps a recent romantic split. Offer them your comforting words, but don’t anticipate an immediate reaction. Remember, your support is not wasted; it has made an impact, even if it takes them some time to process their feelings.",
      "horoscope_ja": "蠍座のあなたは今日、家族のことで頭がいっぱいになっているかもしれません。仕事やお金、あるいは最近別れた恋人のことなどでストレスを感じているかもしれません。慰めの言葉をかけましょう。でも、すぐに反応が返ってくるとは期待しないでください。あなたのサポートは決して無駄にはなりません。たとえ相手が感情を整理するのに時間がかかったとしても、あなたのサポートは大きな影響を与えているのです。"
    },
    "sagittarius": {
      "date": "2026-02-18",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you might find yourself grappling with some unsettling emotions, even if there's no clear cause. On the surface, everything appears to be running smoothly, and your loved ones seem to be in good spirits. However, this feeling is likely not a major concern. You could simply be tuning into the worries and stresses of those around you, even strangers you encounter. Your intuitive abilities are heightened today, allowing you to pick up on various energies. Stay grounded and ride it out!",
      "horoscope_ja": "射手座のあなたは今日、明確な原因がなくても、不安な感情に悩まされるかもしれません。表面上はすべて順調に進み、大切な人たちも元気そうに見えます。しかし、この感情はそれほど大きな問題ではないかもしれません。周りの人、さらには出会った見知らぬ人の不安やストレスに、ただ気を配っているだけかもしれません。今日は直感力が高く、様々なエネルギーを感知することができます。地に足をつけて、この状況を乗り越えましょう！"
    },
    "capricorn": {
      "date": "2026-02-18",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you might find a friend—possibly a woman—feeling hurt or even angry with you. Financial matters could be at the heart of the issue. It may be challenging to soothe her feelings right now, so offer your support and then give her some space. While it seems like a big deal to her, she may be overreacting, and in time, she'll come to realize that. In the meantime, focus on managing your own stress. Stay strong!",
      "horoscope_ja": "山羊座のあなた、今日は友人（もしかしたら女性かもしれない）があなたに対して傷ついたり、怒りを感じているかもしれません。金銭問題が問題の核心かもしれません。今は彼女の気持ちを落ち着かせるのは難しいかもしれませんが、支えになり、少し距離を置いてあげてください。彼女にとっては大したことのように思えますが、過剰反応しているだけかもしれません。いずれ彼女もそれに気づくでしょう。それまでは、自分のストレス管理に集中しましょう。強くいてください！"
    },
    "aquarius": {
      "date": "2026-02-18",
      "sign": "Aquarius",
      "horoscope": "Aquarius, if your supervisor is a woman, it’s wise to tread lightly today. Her mood isn’t the best, to say the least. Put in your best effort, be extra kind to your colleagues, and lean on your natural diplomatic skills. You might encounter some pointed remarks, but by keeping your focus and sticking to your usual efficient routine, you can steer clear of any significant conflicts. Keep your cool, and let’s hope she wraps up her day early!",
      "horoscope_ja": "水瓶座さん、もしあなたの上司が女性なら、今日は慎重に行動するのが賢明です。彼女の機嫌は、控えめに言ってもあまり良くありません。全力を尽くし、同僚にはいつも以上に優しく接し、持ち前の外交スキルを発揮しましょう。辛辣な指摘を受けることもあるかもしれませんが、集中力を保ち、いつも通りの効率的なルーティンを守れば、大きな衝突は避けられるでしょう。冷静さを保ち、彼女が一日を早く切り上げてくれることを祈りましょう！"
    },
    "pisces": {
      "date": "2026-02-18",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, embarking on a journey might bring more challenges than joy. You could find yourself leaving behind essential items or feeling rushed as you prepare. Flight delays or misplaced valuables could add to the stress. To navigate these potential hiccups, consider using a packing checklist, keep your important belongings within reach, and pack plenty of books and music to help pass the time during any delays. Despite the hurdles, remember to enjoy the adventure!",
      "horoscope_ja": "魚座の皆さん、今日は旅に出るのは喜びよりも困難を伴うかもしれません。必需品を忘れてしまったり、準備を急いでいたりするかもしれません。フライトの遅延や貴重品の置き忘れもストレスを増大させる可能性があります。こうしたトラブルを乗り切るには、パッキングチェックリストを作成し、大切な持ち物は手の届くところに置いておき、遅延時に時間をつぶせるように本や音楽をたくさん用意しましょう。どんな困難があっても、冒険を楽しむことを忘れないでください！"
    }
  }
}