{
  "updated_at": "2026-01-11T16:30:32.258Z",
  "jst_date": "2026-01-12",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-12",
      "sign": "Aries",
      "horoscope": "Today, Aries, you may find yourself in the role of a sleuth. A missing item or perhaps a beloved pet has sparked your curiosity, and you'll be on a mission to uncover the truth. While your search may lead you on a bit of a chase, rest assured that what you're looking for is likely safe and sound. Just a word of advice: don't venture too far. The answer you seek is probably just a short stroll away, so keep your search local and everything should turn out just fine.",
      "horoscope_ja": "牡羊座のあなたは今日、探偵のような役割を担うかもしれません。失くしたものや愛するペットがあなたの好奇心を刺激し、真実を解き明かすための使命に身を投じるでしょう。捜索は少々手探りになるかもしれませんが、探しているものはきっと無事で安心してください。一つアドバイスを。あまり遠くまで行かないでください。探している答えはきっとすぐ近くにあるはずです。だから、捜索は地元にとどめておくと、きっとうまくいくはずです。"
    },
    "taurus": {
      "date": "2026-01-12",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find yourself fretting over financial matters, but these concerns might be unfounded. While it may seem like your monetary situation is taking a turn for the worse, the reality is likely less severe than it appears. Take a deep breath and take a moment to review your finances. With some thoughtful budgeting and a bit of restraint, you can navigate through this period. You've got this!",
      "horoscope_ja": "おうし座のあなたは、今日、お金のことで不安になっているかもしれませんが、もしかしたらその心配は杞憂かもしれません。金銭状況が悪化しているように見えるかもしれませんが、現実は見た目ほど深刻ではないかもしれません。深呼吸をして、少し時間を取って家計を見直してみましょう。綿密な予算管理と少しの節制があれば、この時期を乗り越えられるはずです。あなたなら大丈夫！"
    },
    "gemini": {
      "date": "2026-01-12",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, your logical thinking may feel clouded as a whirlwind of events unfolds around you. Many are seeking your guidance, numerous requests for help are coming your way, and those in charge are piling on new responsibilities. It's essential to keep your cool and avoid snapping at anyone. Prioritize by assisting those who need it most first, and kindly inform the others that you may not be able to attend to them right away. This approach will help you maintain your sanity. Stay strong!",
      "horoscope_ja": "ふたご座の皆さん、今日は周囲で次々と出来事が巻き起こる中、論理的な思考が鈍くなっているかもしれません。多くの人があなたの導きを求め、数多くの助けの依頼が届き、責任者たちは新たな責任を背負います。冷静さを保ち、誰かに怒鳴り散らさないようにすることが重要です。まずは最も助けを必要としている人から支援を優先し、他の人にはすぐに対応できないかもしれないことを丁寧に伝えましょう。このアプローチは、あなたの正気を保つのに役立ちます。強くいてください！"
    },
    "cancer": {
      "date": "2026-01-12",
      "sign": "Cancer",
      "horoscope": "You may receive an unusual call today, Cancer, from someone who remains anonymous and whose voice is unfamiliar. This mysterious communication might seem significant, potentially lingering on your mind for much of the afternoon. But don’t let it drive you to distraction—how can you return a call when you don’t even know who it is? Avoid stressing over it; if it truly matters, they will reach out again. Keep this in mind as you navigate your day.",
      "horoscope_ja": "蟹座のあなたは今日、身元不明で声も聞き覚えのない人から、いつもとは違う電話を受けるかもしれません。この不思議なメッセージは、何か重大なことに思え、午後の大半をあなたの心の片隅で過ごしてしまうかもしれません。しかし、それで気が散ってはいけません。誰からかさえ分からない電話に、どうやって折り返しの電話をすればいいのでしょうか？ストレスを溜め込まないでください。本当に大切なことなら、相手はまた連絡をくれるはずです。このことを心に留めて、一日を過ごしてください。"
    },
    "leo": {
      "date": "2026-01-12",
      "sign": "Leo",
      "horoscope": "Today isn't the best time for deep dives into research, Leo, be it an academic topic or figuring out a new computer setup. Your concentration may not be at its peak, making it challenging to absorb unfamiliar ideas. Don't take this as a sign of diminished intellect; it's simply one of those off days we all experience. Expect a return to your usual sharpness by tomorrow.",
      "horoscope_ja": "レオさん、今日は学術的なテーマであれ、新しいコンピューターの設定であれ、深く研究に取り組むには最適な日ではありません。集中力がピークに達していないため、馴染みのないアイデアを吸収するのが難しいかもしれません。これを知力の低下の兆候と捉えないでください。誰もが経験する、ただの調子の悪い日の一つです。明日にはいつもの鋭さを取り戻せるでしょう。"
    },
    "virgo": {
      "date": "2026-01-12",
      "sign": "Virgo",
      "horoscope": "You may find yourself taken aback today, Virgo, as a long-time friend unexpectedly utters hurtful words that catch you off guard. If these remarks are directed at you, it’s understandable to feel hurt, as they seem unwarranted. While it can be challenging to let go of such grievances, it’s worth the effort. Remember, your friend might be facing struggles that you’re unaware of. Try to empathize with their situation. Embrace the power of forgiveness and move forward.",
      "horoscope_ja": "おとめ座のあなたは、今日、長年の友人から予期せぬ言葉を浴びせられ、驚かされるかもしれません。もしその言葉があなたに向けられたものなら、不当に思えて傷つくのも無理はありません。そのような恨みを手放すのは難しいかもしれませんが、努力する価値はあります。友人は、あなたが気づいていないような苦悩を抱えているかもしれないことを忘れないでください。彼らの状況に共感するように努めてください。許しの力を受け入れ、前に進みましょう。"
    },
    "libra": {
      "date": "2026-01-12",
      "sign": "Libra",
      "horoscope": "Libra, have you recently achieved a significant milestone? If so, you might find yourself in a bit of a fog regarding your next steps. You could be exploring various possibilities, yet unsure which path truly resonates with you. It's possible that the ideal goal is still waiting for you to discover it. There's no rush to dive into something new just yet. Embrace patience and trust the process.",
      "horoscope_ja": "天秤座さん、最近何か大きな節目を迎えましたか？もしそうなら、次のステップについて少し迷っているかもしれません。様々な可能性を模索しているものの、どれが本当に自分に合っているのか分からず迷っているのかもしれません。もしかしたら、理想の目標はまだあなたが見つけるのを待っているのかもしれません。今すぐ何か新しいことに飛び込む必要はありません。忍耐強く、プロセスを信じてください。"
    },
    "scorpio": {
      "date": "2026-01-12",
      "sign": "Scorpio",
      "horoscope": "A new coworker may come into your life today, Scorpio. If you feel an unsettling vibe from them, it could be a sign to tread carefully. However, keep in mind that their defensive demeanor might stem from their own fears. Hold off on forming any judgments until you have a chance to understand them better. It's important to extend the benefit of the doubt to others whenever you can.",
      "horoscope_ja": "蠍座のあなた、今日は新しい同僚が現れるかもしれません。もし相手から不安な雰囲気を感じたら、慎重に行動すべきサインかもしれません。しかし、相手の防御的な態度は、もしかしたら彼ら自身の恐怖心から来ているかもしれないことを心に留めておきましょう。相手をより深く理解するまでは、判断を下すのは控えましょう。できる限り、相手を疑わしい場合は疑わずに受け入れることが大切です。"
    },
    "sagittarius": {
      "date": "2026-01-12",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, it might be wise to give your current partner some space. They are grappling with some heavy family and work-related stress, which could leave them feeling irritable. If you choose to meet up, you may encounter a less-than-cheerful demeanor and possibly face some harsh words. Consider whether you're ready to handle that energy, or perhaps opt for a different plan this evening.",
      "horoscope_ja": "射手座のあなたは、今日は今のパートナーに少し距離を置くのが賢明かもしれません。彼らは家庭や仕事のストレスに悩まされており、それがイライラの原因になっているかもしれません。もし会おうとすると、相手は必ずしも明るくない態度を見せ、厳しい言葉を投げかけてくるかもしれません。そのエネルギーに耐えられるか、それとも今夜は別のプランを選ぶか、じっくり考えてみてください。"
    },
    "capricorn": {
      "date": "2026-01-12",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, consider dedicating your energy to a personal project that ignites your passion. If a family member distracts you from this endeavor, take a moment to communicate how significant it is for you. You consistently put in a lot of effort, so it's only fair that you spend your free time on what truly matters to you. Just remember to approach the conversation with sensitivity—they're likely to get it!",
      "horoscope_ja": "山羊座のあなた、今日は情熱を燃やすような個人的なプロジェクトにエネルギーを注ぎ込んでみてはいかがでしょうか。もし家族のせいでその取り組みが中断されたら、少し時間を取って、それがあなたにとってどれほど大切なことなのかを伝えてみましょう。あなたは常に努力を重ねてきたので、自由な時間を本当に大切なことに費やすのは当然のことです。ただし、会話には慎重に臨むことを忘れないでください。きっと相手も理解してくれるはずです！"
    },
    "aquarius": {
      "date": "2026-01-12",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you might find yourself revisiting memories from your early years, perhaps even from childhood. It may seem a bit silly to shed tears over a fairy tale your grandmother once shared with you, but don’t be embarrassed—this emotional release is beneficial. Those lingering feelings from the past, no matter how trivial they may seem, can hold you back in your present life. Embrace this opportunity to let go and gain wisdom from the experience.",
      "horoscope_ja": "水瓶座のあなたは今日、幼い頃、もしかしたら子供時代の思い出をよみがえらせるかもしれません。おばあちゃんが話してくれたおとぎ話に涙を流すなんて、少し馬鹿げているように思えるかもしれませんが、恥ずかしがる必要はありません。こうした感情の解放は有益なのです。過去の未練は、たとえ些細なものに思えても、今のあなたの人生を阻む可能性があります。この機会を捉え、過去の経験から知恵を得てください。"
    },
    "pisces": {
      "date": "2026-01-12",
      "sign": "Pisces",
      "horoscope": "Pisces, you might find that a cherished item, possibly a family heirloom, is nowhere to be found. There's no need to stress! It's likely hiding somewhere in your home, perhaps tucked away behind something or buried under a stack of other belongings. Remember, it's still among your possessions. However, overzealous searching could make it harder to locate. Take your time and keep an eye out; chances are, it will reappear in an unexpected spot!",
      "horoscope_ja": "うお座のあなたは、大切な品、もしかしたら家宝かもしれないものが、どこにも見つからないことに気づくかもしれません。でも、心配する必要はありません！家の中のどこかに隠れているかもしれません。何かの陰に隠れていたり、他の持ち物に埋もれていたり。でも、それはあなたの持ち物の中にあることを忘れないでください。ただし、熱心に探しすぎると、かえって見つけにくくなるかもしれません。時間をかけて注意深く見守ってください。きっと、思いがけない場所で再び現れるでしょう！"
    }
  }
}