{
  "updated_at": "2026-02-05T16:56:18.976Z",
  "jst_date": "2026-02-06",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-06",
      "sign": "Aries",
      "horoscope": "Today is an excellent opportunity for you to dive into your creative side, Aries. While your passion for sports is undeniable, don't forget about your natural artistic flair. The satisfaction that comes from bringing something to life is truly priceless, and the journey of crafting a finished piece can be both fulfilling and soothing. Whether it's through crafting, baking, constructing, or gardening, engage in activities that allow you to express yourself. Embrace your favorite hobbies today!",
      "horoscope_ja": "牡羊座さん、今日はあなたのクリエイティブな側面を解き放つ絶好の機会です。スポーツへの情熱は言うまでもありませんが、持ち前の芸術的才能も忘れてはいけません。何かに命を吹き込むことで得られる満足感は、まさにかけがえのないものです。そして、完成品を作り上げていく過程は、充実感と安らぎの両方を与えてくれるでしょう。工作、お菓子作り、建築、ガーデニングなど、どんなことでも構いません。自分を表現できるアクティビティに取り組んでみましょう。今日は、あなたの好きな趣味を存分に楽しんでください！"
    },
    "taurus": {
      "date": "2026-02-06",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, consider taking the time to craft a heartfelt letter, send a cheerful greeting card, or assemble a thoughtful package for someone who lives far away. This can be a delightful activity, particularly if the recipient is caught off guard by your gesture. You might include photos, handmade crafts, delicious cookies, sweet treats, or a good book to create a memorable surprise. Even a simple card can bring a smile to someone's face. Enjoy the process!",
      "horoscope_ja": "おうし座の皆さん、今日は、心のこもった手紙を書いたり、明るいグリーティングカードを送ったり、遠くに住む人のために心のこもった小包を準備したりしてみませんか。特に、受け取る人があなたの心遣いに驚いてくれるなら、きっと楽しい思い出になるでしょう。写真、手作りの工芸品、おいしいクッキー、甘いお菓子、あるいは素敵な本などを添えて、思い出に残るサプライズを演出してみてはいかがでしょうか。シンプルなカードでも、誰かの笑顔を引き出すことができます。その過程を楽しんでください！"
    },
    "gemini": {
      "date": "2026-02-06",
      "sign": "Gemini",
      "horoscope": "Today is an excellent opportunity for you to bring your creative visions to life, Gemini. Gather your beloved craft materials and dive into a world of color and design. If you have kids, think about inviting them to join in the fun. You might be surprised by the brilliant ideas and unique perspectives they share that you hadn’t considered before. If you don’t already have a collection box for miscellaneous items like old bottles, nuts and bolts, quirky buttons, ribbons, and fabric scraps, now is the perfect time to start one!",
      "horoscope_ja": "ふたご座さん、今日はあなたのクリエイティブなビジョンを現実にする絶好の機会です。お気に入りの工作材料を集めて、色とデザインの世界に飛び込んでみましょう。お子様がいる方は、一緒に楽しんでみてはいかがでしょうか。お子様が、今まで思いもよらなかったような素晴らしいアイデアやユニークな視点を共有してくれることに、きっと驚くことでしょう。古いボトル、ナットやボルト、変わったボタン、リボン、布切れなど、様々なアイテムを集めるための収集箱をまだ持っていないなら、今こそ始める絶好の機会です！"
    },
    "cancer": {
      "date": "2026-02-06",
      "sign": "Cancer",
      "horoscope": "Cancer, today is the perfect day to turn up the music, especially if you're feeling a bit isolated. Just like a good chat, music can deeply resonate with you. It serves as a bridge to connect with your innermost feelings. Your empathetic spirit can draw solace and inspiration from melodies and beats like no other. So, dig out your favorite tracks, sing your heart out, or even let loose and dance. Make the most of your day!",
      "horoscope_ja": "蟹座さん、今日は音楽を楽しむのにぴったりの日です。特に孤独を感じているなら。楽しい会話と同じように、音楽はあなたの心に深く響きます。音楽は、あなたの心の奥底にある感情と繋がる架け橋のような存在です。あなたの共感力の高い魂は、メロディーやビートから、他に類を見ないほどの慰めとインスピレーションを得られます。お気に入りの曲を聴いて、心ゆくまで歌ったり、思いっきり踊ったり。最高の一日を！"
    },
    "leo": {
      "date": "2026-02-06",
      "sign": "Leo",
      "horoscope": "Today is an excellent opportunity for you to revisit that shopping list, Leo. Your knack for being budget-conscious and resourceful is heightened right now, so why not make the most of it? Spend a little time reviewing recent ads or collecting coupons before you hit the stores. If you feel the urge to splurge on something extravagant, remind yourself to stick to your list! Keep your financial goals in sight and make a beeline for the checkout once you've finished your shopping.",
      "horoscope_ja": "レオさん、今日は買い物リストを見直す絶好の機会です。予算管理と機転の利くあなたの才能は今、さらに高まっています。この機会を最大限に活用してみませんか？お店に行く前に、最新の広告をチェックしたり、クーポンを集めたりしてみましょう。何か贅沢なものにお金を使いたくなっても、リスト通りに買い物をするように自分に言い聞かせましょう！経済的な目標を常に意識し、買い物が終わったらレジへ直行しましょう。"
    },
    "virgo": {
      "date": "2026-02-06",
      "sign": "Virgo",
      "horoscope": "Today is likely to be a productive one for you, Virgo. The vibrant energies at play are motivating you to tackle those tasks that have been on your to-do list. While you might have other activities in mind, once you complete your responsibilities, you'll find ample opportunity for some fun as well. Embrace this wonderful day to balance both your work and leisure!",
      "horoscope_ja": "おとめ座のあなたにとって、今日は生産的な一日になりそうです。活気に満ちたエネルギーが、ToDoリストに載せていたタスクに取り組むモチベーションを高めてくれます。他の活動も考えているかもしれませんが、責任を果たした後は、楽しい時間を過ごす機会も十分に見つかるでしょう。この素晴らしい一日を大切に、仕事とプライベートのバランスを取りましょう！"
    },
    "libra": {
      "date": "2026-02-06",
      "sign": "Libra",
      "horoscope": "Libra, today is the perfect opportunity to indulge in some well-earned downtime. Remember, even the busiest among us need a break from the hustle and bustle. If there are tasks on your to-do list, don’t hesitate to schedule some fun or relaxation for later. Treat yourself to a cozy afternoon nap or enjoy a meal from your favorite restaurant. Consider taking a gentle stroll or unwinding in a soothing bath. Prioritize your well-being by balancing rest with productivity.",
      "horoscope_ja": "天秤座さん、今日はせっかくの休息に浸る絶好の機会です。どんなに忙しい人でも、喧騒から離れて休息を取る必要があることを忘れないでください。ToDoリストにタスクが残っている場合は、楽しみやリラックスの時間を後回しにすることをためらわないでください。心地よい午後の昼寝をしたり、お気に入りのレストランで食事を楽しんだりしましょう。ゆっくりと散歩したり、心地よいお風呂でリラックスしたりするのも良いでしょう。休息と生産性のバランスを取り、健康を最優先に考えましょう。"
    },
    "scorpio": {
      "date": "2026-02-06",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, you may find yourself welcoming an unexpected guest. This person is likely seeking your warmth and understanding. Even if you have a long to-do list or were hoping for a laid-back day, it's important to prioritize your friend's needs. Tasks and leisure activities can be postponed, but offering your compassion and support is often time-sensitive. If the opportunity presents itself, be ready to open both your door and your heart.",
      "horoscope_ja": "蠍座のあなたは、今日、思いがけない来客を迎えることになるかもしれません。その人はきっとあなたの温かさと理解を求めているのでしょう。やるべきことが山積みだったり、のんびり過ごしたいと思っていたとしても、友人のニーズを最優先に考えることが大切です。用事やレジャーは後回しにできますが、思いやりとサポートを示すには、時宜にかなった行動が求められます。機会があれば、ドアと心の両方を開く準備をしておきましょう。"
    },
    "sagittarius": {
      "date": "2026-02-06",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, it's a great opportunity to discuss any plans you have in mind with your housemates. If you're flying solo, your plans may not impact anyone else, but for those sharing a space, it's considerate to include others in the conversation. Someone in your home might have their own ideas or could be seeking your support. Open up the dialogue, and you'll find that everything falls into place smoothly.",
      "horoscope_ja": "射手座の皆さん、今日はハウスメイトと計画を話し合う絶好の機会です。一人暮らしなら、計画は他の人には影響しないかもしれませんが、同じ空間を共有している場合は、会話に他の人も巻き込むのが思いやりのある行動です。同居している人の中には、独自のアイデアを持っている人や、あなたのサポートを求めている人がいるかもしれません。積極的に会話を始めれば、すべてがスムーズに進むでしょう。"
    },
    "capricorn": {
      "date": "2026-02-06",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, if you're feeling weighed down by something, reach out to your mother or another trusted elder. Regardless of our life stage, we all have a need for guidance and care from those who have walked the path before us. Tap into this well of wisdom by making a visit or giving them a call. Don't forget to show your appreciation for their unwavering support.",
      "horoscope_ja": "山羊座のあなた、もし今日、何かに押しつぶされそうになったら、お母さんや信頼できる年長者に相談してみましょう。人生のどの段階であっても、私たちは皆、先人たちからの導きや思いやりを必要としています。彼らを訪ねたり、電話をかけたりして、この知恵の源泉に触れてみてください。彼らの揺るぎない支えに感謝の気持ちを表すことも忘れないでください。"
    },
    "aquarius": {
      "date": "2026-02-06",
      "sign": "Aquarius",
      "horoscope": "Aquarius, steer clear of the \"woe is me\" mindset today. When faced with repeated setbacks or unfortunate events, it's tempting to adopt a victim mentality. Remember, while we may not have control over external circumstances, we do have the power to decide how we respond. Allowing yourself to grieve is an important part of the healing process, but be mindful of not getting stuck there. Make the conscious choice to move forward and prioritize your well-being.",
      "horoscope_ja": "水瓶座の皆さん、今日は「自分は不幸だ」という考え方から抜け出しましょう。度重なる挫折や不幸な出来事に直面すると、つい被害者意識に陥りがちです。しかし、外的状況をコントロールすることはできないかもしれませんが、どう反応するかは自分で決められるということを忘れないでください。悲しみを受け入れることは、回復のプロセスにおいて重要な部分ですが、そこにとらわれすぎないように注意しましょう。意識的に前進し、自分の健康を最優先にしましょう。"
    },
    "pisces": {
      "date": "2026-02-06",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, prioritize carving out some personal time for yourself. Your essence flourishes through deep reflection, creativity, passion, and emotional exploration. If you don’t allow yourself enough solitude in a cozy environment, you might start to feel drained. Signs like irritability or a desire to retreat can signal that you need some quality alone time. Consider making arrangements for this today.",
      "horoscope_ja": "魚座の皆さん、今日は自分のための時間を確保することを優先しましょう。深い内省、創造性、情熱、そして感情の探求を通して、あなたの本質は開花します。居心地の良い環境で十分な孤独を味わえないと、疲れを感じ始めるかもしれません。イライラしたり、どこかへ逃げ込みたくなったりする兆候は、質の高い一人の時間が必要なサインかもしれません。今日、そのための準備をしてみてはいかがでしょうか。"
    }
  }
}