{
  "updated_at": "2025-11-16T16:27:12.517Z",
  "jst_date": "2025-11-17",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-17",
      "sign": "Aries",
      "horoscope": "A surprise influx of cash may stir up a delightful whirlwind at home! This could be the perfect opportunity to invest in some much-needed upgrades or new gadgets, furniture, or appliances. Share the joyful news with your friends and consider throwing a little celebration!",
      "horoscope_ja": "突然の大金が家に舞い込んで、楽しい旋風が巻き起こるかもしれません！これは、待望のアップグレードや新しいガジェット、家具、家電製品に投資する絶好の機会かもしれません。この嬉しいニュースを友達にシェアして、ちょっとしたお祝いをしてみてはいかがでしょうか？"
    },
    "taurus": {
      "date": "2025-11-17",
      "sign": "Taurus",
      "horoscope": "Today, you may come across information that opens the door to a new job, a change of scenery, or even a shift in your mindset. While the idea of change might make you feel a bit anxious, trust that you have what it takes to navigate this transition successfully. Embrace the changes that come your way and allow yourself to adapt. Remember, this is just a stepping stone on your journey of personal growth.",
      "horoscope_ja": "今日、新しい仕事、環境の変化、あるいは考え方の転換につながるような情報に出会うかもしれません。変化という概念に少し不安を感じるかもしれませんが、あなたにはこの変化をうまく乗り越える力があると信じてください。目の前に現れる変化を受け入れ、適応していくことが大切です。これは、あなたの成長の道のりにおける、ほんの一歩に過ぎないことを忘れないでください。"
    },
    "gemini": {
      "date": "2025-11-17",
      "sign": "Gemini",
      "horoscope": "Enhancing your technical abilities might open the door to a new job opportunity or boost your earnings. If you've been feeling anxious and overwhelmed recently, expect a shift towards stability. Your concentration is sharp, and you're strategically pursuing your objectives. Stay the course, and success will be yours.",
      "horoscope_ja": "技術力を高めることで、新たな仕事のチャンスが開けたり、収入が増えたりするかもしれません。最近、不安やプレッシャーを感じていた方は、これから安定に向かうでしょう。集中力は鋭く、戦略的に目標に向かって進んでいます。このまま突き進めば、成功はあなたのものになるでしょう。"
    },
    "cancer": {
      "date": "2025-11-17",
      "sign": "Cancer",
      "horoscope": "If you're currently single, get ready for a shift in your love life today! You might encounter not just one, but several intriguing individuals. A fresh face could enter your world, or an old acquaintance might catch your eye in a new light. For those in a relationship, anticipate a delightful transformation in your partner's vibe. They may radiate joy, humor, and strength, reigniting that spark and making you fall head over heels once more.",
      "horoscope_ja": "もしあなたが現在独身なら、今日、恋愛に変化が起こる準備をしましょう！魅力的な人に出会うのは一人ではなく、複数人かもしれません。新しい出会いがあったり、昔の知り合いが新たな光であなたの心を捉えたりするかもしれません。交際中の人は、パートナーの雰囲気が劇的に変化するのを期待してください。喜び、ユーモア、そして強さが溢れ、あの頃の輝きが再び燃え上がり、あなたを再び夢中にさせるかもしれません。"
    },
    "leo": {
      "date": "2025-11-17",
      "sign": "Leo",
      "horoscope": "Your visionary thoughts and captivating insights may inspire you to share your ideas with others. Consider hosting a gathering with friends to discuss these revelations. Generally, your audience will be receptive to your words. However, be mindful not to pressure those who are uncertain; they will come to their own conclusions when they are ready.",
      "horoscope_ja": "あなたの先見の明のある思考と魅力的な洞察力は、あなたのアイデアを他の人と共有するきっかけとなるかもしれません。友人たちと集まり、これらの発見について話し合う機会を設けてみてはいかがでしょうか。一般的に、聴衆はあなたの言葉に好意的に受け止めてくれるでしょう。しかし、確信が持てない人にプレッシャーをかけすぎないように注意してください。彼らは準備ができたら、自分自身で結論を出すでしょう。"
    },
    "virgo": {
      "date": "2025-11-17",
      "sign": "Virgo",
      "horoscope": "You're feeling motivated by the aspirations and ambitions of a community you're part of. You may find yourself making some personal sacrifices to help them thrive, but rest assured, these are only short-term. In the end, you'll reap the rewards of their achievements. There's also personal success on the horizon for you, though it might come with some unexpected shifts. Embrace the changes and don't let uncertainty stand in your way.",
      "horoscope_ja": "あなたが属するコミュニティの熱意と野心に刺激を受け、やる気を起こさせられています。コミュニティの発展のために、個人的な犠牲を払うこともあるかもしれませんが、ご安心ください。それは一時的なものです。最終的には、コミュニティの成果の恩恵を享受することになるでしょう。あなた自身にも個人的な成功の兆しが見えていますが、それは予期せぬ変化を伴うかもしれません。変化を受け入れ、不確実性に屈しないでください。"
    },
    "libra": {
      "date": "2025-11-17",
      "sign": "Libra",
      "horoscope": "You might find yourself experiencing a surprising surge of success that could lead to an equally surprising increase in your income. It's likely that friends have guided you to this fortunate moment, placing you exactly where you need to be. Be prepared for this shift to propel you into a whole new chapter of your life. Embrace this opportunity fully, but remember not to become complacent; if you do, your newfound achievements could vanish just as quickly as they appeared.",
      "horoscope_ja": "驚くほどの成功が訪れ、収入も驚くほど増加するかもしれません。もしかしたら、友人たちがあなたをこの幸運な瞬間へと導き、まさにあなたがいるべき場所に導いてくれたのかもしれません。この変化が、人生の新たな章へとあなたを駆り立てるでしょう。この機会を存分に楽しみましょう。しかし、現状に満足してはいけません。そうしてしまうと、新たな成果は現れたのと同じくらい早く消えてしまうかもしれません。"
    },
    "scorpio": {
      "date": "2025-11-17",
      "sign": "Scorpio",
      "horoscope": "An influx of positivity and excitement may lift your spirits, enabling you to achieve remarkable things. Your situation might undergo significant changes. A relocation or a shift in your job could be on the horizon. Instead of holding on tightly to the familiar, embrace the changes that come your way. As long as you remain open to new possibilities, success and good luck are sure to follow!",
      "horoscope_ja": "ポジティブな気持ちとワクワク感が溢れ出し、気分が高揚し、素晴らしい成果を上げられるかもしれません。状況は大きく変化するかもしれません。転勤や転職が近づいているかもしれません。慣れ親しんだものに固執するのではなく、目の前に現れる変化を受け入れましょう。新しい可能性に常にオープンでいる限り、成功と幸運は必ずややってくるでしょう！"
    },
    "sagittarius": {
      "date": "2025-11-17",
      "sign": "Sagittarius",
      "horoscope": "Today, you may experience unexpected flashes of inspiration that empower you to implement changes you've been longing for. A stroke of luck could lead to an unforeseen financial gain. Prepare for some entertaining dreams tonight; they might hold valuable insights that could assist you in achieving your goals. Embrace this day filled with positive shifts and delightful surprises.",
      "horoscope_ja": "今日は、思いがけないひらめきが訪れ、ずっと望んでいた変化を実行に移す力を与えてくれるかもしれません。幸運が訪れれば、思いがけない金銭的利益を得るかもしれません。今夜は楽しい夢を見るかもしれません。目標達成に役立つ貴重な洞察が隠されているかもしれません。ポジティブな変化と嬉しいサプライズに満ちたこの日を、心から楽しみましょう。"
    },
    "capricorn": {
      "date": "2025-11-17",
      "sign": "Capricorn",
      "horoscope": "An unexpected reunion with a long-lost friend may be on the horizon, and their accomplishments will likely astonish you. This encounter, along with the events that unfold, could serve as a pivotal moment in your life. Whether it's the friend themselves or the new connections you forge through them, you may find fresh inspiration and opportunities. Prepare for a day filled with unusual yet meaningful experiences—embrace it fully!",
      "horoscope_ja": "長い間会っていなかった友人との予期せぬ再会が近づいているかもしれません。そして、彼らの偉業にきっと驚かされるでしょう。この出会いと、そこから巻き起こる出来事は、あなたの人生における転機となるかもしれません。友人自身からであれ、彼らを通して築かれる新しい繋がりからであれ、新たなインスピレーションやチャンスが見つかるかもしれません。非日常でありながらも意義深い経験に満ちた一日を、心ゆくまでお楽しみください！"
    },
    "aquarius": {
      "date": "2025-11-17",
      "sign": "Aquarius",
      "horoscope": "Today could bring an unexpected yet positive shift in your professional life. You might find yourself receiving a promotion or being reassigned to a new role. Alternatively, a crucial piece of information might surface, paving the way for your advancement. Keep an eye on how technology and communication could influence these developments. Friends or coworkers may also play a significant part in this unfolding story. No matter how you slice it, today holds great potential for you!",
      "horoscope_ja": "今日は、あなたの仕事人生に予期せぬ、しかし前向きな変化が訪れるかもしれません。昇進や新しい役割への異動といった出来事が起こるかもしれません。あるいは、重要な情報が明らかになり、あなたの昇進への道が開かれるかもしれません。テクノロジーとコミュニケーションがこれらの展開にどのような影響を与えるか、注意深く見守ってください。友人や同僚も、この展開において重要な役割を果たすかもしれません。どんな見方をしても、今日はあなたにとって大きな可能性を秘めています！"
    },
    "pisces": {
      "date": "2025-11-17",
      "sign": "Pisces",
      "horoscope": "A spontaneous getaway could be suggested by a close friend or your significant other, and you might find yourself eager to join in. Your spirit is craving some excitement! While you've been weighing various possibilities, your friend's suggestion stands out as the most enticing. If this adventure takes you abroad, consider brushing up on the local language; you'll be amazed at how fast you pick it up!",
      "horoscope_ja": "親しい友人やパートナーから突然の小旅行を提案され、つい参加したくなるかもしれません。あなたの心は刺激を求めているのです！様々な可能性を検討した結果、友人の提案が最も魅力的に映りました。もし海外への冒険旅行なら、現地の言葉を復習してみてはいかがでしょうか。きっと驚くほど早く習得できるはずです！"
    }
  }
}