{
  "updated_at": "2025-12-20T16:29:16.685Z",
  "jst_date": "2025-12-21",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-21",
      "sign": "Aries",
      "horoscope": "Caring for someone doesn't ensure they'll always be by your side. It's essential to offer your love openly and without conditions. If you constantly seek assurances or safety from others, it may create an impression of distrust, leading them to feel the same way about you. This can create a negative loop. The key to breaking free from this cycle is to love wholeheartedly and without reservations.",
      "horoscope_ja": "誰かを大切に思っているからといって、必ずしもその人がそばにいてくれるとは限りません。愛を惜しみなく、無条件に与えることが大切です。常に他人に安心感や安全を求めていると、相手に不信感を与え、相手もあなたに対して同じような感情を抱くようになります。これは負のループを生み出す可能性があります。この悪循環から抜け出す鍵は、心から、そして惜しみなく愛することです。"
    },
    "taurus": {
      "date": "2025-12-21",
      "sign": "Taurus",
      "horoscope": "It's time to seek guidance. Embrace the opportunity to learn from an expert in a particular field, even if it means stepping back and adopting the role of a student. This shift is refreshing for you, especially since you frequently find yourself in the position of teaching others. Engaging in this kind of learning experience can be incredibly beneficial for your growth. If there's a new topic that piques your interest, now is the perfect moment to dive in and explore it.",
      "horoscope_ja": "指導を求める時です。たとえ一歩引いて生徒の立場になることになっても、特定分野の専門家から学ぶ機会を大切にしましょう。特に、あなたは他の人を教える立場にいることが多いので、この変化はあなたにとって新鮮な体験となるでしょう。このような学習体験は、あなたの成長に非常に有益です。もし興味をそそられる新しいトピックがあれば、今こそ飛び込んで探求する絶好の機会です。"
    },
    "gemini": {
      "date": "2025-12-21",
      "sign": "Gemini",
      "horoscope": "Today is perfect for reflection and introspection. It's an opportunity to check in with your inner self, something you've likely neglected recently. You're on the verge of letting go of the weight of constant obligation. Believe it or not, you'll come to understand that it's impossible to be productive every moment! So, give yourself permission to pause and recharge.",
      "horoscope_ja": "今日は内省と振り返りに最適な日です。最近はおそらくおろそかにしていた、自分の内面と向き合う機会です。あなたは、常に続く義務の重荷から解放されようとしています。信じられないかもしれませんが、毎瞬間生産的であることは不可能だと理解するようになるはずです。さあ、立ち止まってエネルギーを充電しましょう。"
    },
    "cancer": {
      "date": "2025-12-21",
      "sign": "Cancer",
      "horoscope": "Today, you may find yourself reflecting on past challenges and aspirations. Are you truly committed to pursuing a career in the arts? If you are already an artist, do you yearn for greater recognition or wealth? Be cautious of these fantasies, as they can distract you from appreciating the present moment. Focus on the here and now; cherishing what you currently possess can bring you the same fulfillment as those who are more affluent or celebrated.",
      "horoscope_ja": "今日、あなたは過去の困難や願望を振り返るかもしれません。あなたは本当に芸術の道に進むことに真剣に取り組んでいますか？すでに芸術家として活動しているなら、さらなる評価や富を切望していませんか？こうした空想には注意が必要です。今この瞬間を大切にする気持ちを邪魔してしまうからです。今この瞬間に集中しましょう。今持っているものを大切にすることで、より裕福で有名な人と同じ満足感を得ることができるのです。"
    },
    "leo": {
      "date": "2025-12-21",
      "sign": "Leo",
      "horoscope": "If your everyday routine feels chaotic, it's time to take action. Don't put it off any longer. You might feel overwhelmed by the constant demands of life pulling you in every direction. Deep down, you yearn for a serene and tranquil existence, perhaps in the countryside. Remember, making such a significant shift is within your reach. Embrace your remarkable ability to adapt!",
      "horoscope_ja": "日々のルーティンが混沌としているように感じたら、行動を起こす時です。もうこれ以上先延ばしにしないでください。あらゆる方向から引っ張ってくる生活の要求に、圧倒されているかもしれません。心の奥底では、静かで穏やかな暮らし、例えば田舎暮らしを切望しているかもしれません。しかし、そんな大きな変化は、あなたの手の届くところにあることを忘れないでください。あなたの優れた適応力を受け入れましょう！"
    },
    "virgo": {
      "date": "2025-12-21",
      "sign": "Virgo",
      "horoscope": "You thrive on freedom and dislike feeling restricted. Patience isn't your strong suit when it comes to achieving your goals. Remember, sometimes you must tackle the less enjoyable tasks before you can truly relax and have fun. Today is one of those days. Luckily, the atmosphere is serene, allowing for focused work sessions. Use this time wisely to set the stage for what lies ahead.",
      "horoscope_ja": "あなたは自由を好み、束縛されることを嫌います。目標達成において、忍耐力はあなたの得意分野ではありません。時には、心からリラックスして楽しむ前に、あまり楽しくない仕事に取り組まなければならないこともあることを覚えておいてください。今日はまさにそんな日です。幸いにも、穏やかな雰囲気の中で集中して仕事に取り組むことができます。この時間を賢く活用し、これからの準備を始めましょう。"
    },
    "libra": {
      "date": "2025-12-21",
      "sign": "Libra",
      "horoscope": "Could today be the day you encounter someone special? There's a good chance! The cosmic influences are aligning to facilitate connections. With the vibrant energy surrounding you right now, you might just draw in an intriguing individual. Embrace this fantastic day—it's designed just for you!",
      "horoscope_ja": "今日は特別な人と出会う日になるかもしれませんか？可能性は十分にあります！宇宙的な力が繋がりを促しています。今、あなたを取り巻く活気に満ちたエネルギーに導かれ、魅力的な人を引き寄せることができるかもしれません。この素晴らしい日を心から楽しみましょう。まさにあなたのために作られた日です！"
    },
    "scorpio": {
      "date": "2025-12-21",
      "sign": "Scorpio",
      "horoscope": "Today promises to be a serene and productive day for you. The endeavors you've embarked on, whether in your personal or professional sphere, are beginning to evolve in intriguing ways. Gradually, any doubts you may have will dissipate. Trust in the passage of time, as it is aligning in your favor.",
      "horoscope_ja": "今日は穏やかで生産性の高い一日になりそうです。プライベートでも仕事でも、あなたが始めた取り組みは興味深い形で進展し始めています。あなたが抱いていた疑念は徐々に消えていくでしょう。時の流れを信じてください。それはあなたに有利に進んでいます。"
    },
    "sagittarius": {
      "date": "2025-12-21",
      "sign": "Sagittarius",
      "horoscope": "Prepare for a day that carries a weighty vibe. You might sense a touch of solitude as those around you seem absorbed in their own worlds, wrapped in quiet introspection. However, as the evening approaches, you'll find a sense of fulfillment wash over you, having tackled numerous challenges and accomplished a lot. In the end, this day will turn out to be quite rewarding, leaving you with a deep sense of pride in your achievements!",
      "horoscope_ja": "重苦しい雰囲気に包まれた一日になる準備をしましょう。周りの人々がそれぞれの世界に浸り、静かに内省している様子に、少しばかりの孤独を感じるかもしれません。しかし、夜が近づくにつれ、数々の課題を乗り越え、多くのことを成し遂げたという充実感が押し寄せてきます。最終的には、この一日は実りある一日となり、自分の成果に深い誇りを感じることでしょう。"
    },
    "capricorn": {
      "date": "2025-12-21",
      "sign": "Capricorn",
      "horoscope": "You're in the midst of a transformative phase, refining and organizing your connections like never before. While there's still work ahead, the outcome will reshape your relationships in remarkable ways. For instance, today, a member of your circle will champion your ideas. Embrace this evolution; those who truly matter are rallying behind you.",
      "horoscope_ja": "あなたは今、変革の真っ只中にあり、これまでにないほど人脈を洗練し、整理しようとしています。まだ課題はありますが、その結果はあなたの人間関係を劇的に変えるでしょう。例えば今日、あなたの周りの誰かがあなたのアイデアを支持してくれるでしょう。この変化を受け入れましょう。本当に大切な人たちが、あなたを支えてくれているのです。"
    },
    "aquarius": {
      "date": "2025-12-21",
      "sign": "Aquarius",
      "horoscope": "Just as mighty rivers flow from tiny droplets, your life is currently brimming with opportunities. Now is the perfect moment to focus your efforts on both personal and professional fronts. Hard work has always been your ally, and today, you’ll find joy in embracing it. By the end of the day, you’ll bask in the rewarding feeling that comes from accomplishing your goals. Well done!",
      "horoscope_ja": "小さな水滴から大河が流れ出すように、あなたの人生は今、チャンスに溢れています。今こそ、プライベートでも仕事でも、努力を集中させる絶好の機会です。これまでずっと努力はあなたの味方でした。そして今日、あなたはそれを受け入れることに喜びを見出すでしょう。一日の終わりには、目標を達成した喜びに浸ることができるでしょう。おめでとうございます！"
    },
    "pisces": {
      "date": "2025-12-21",
      "sign": "Pisces",
      "horoscope": "How content are you with your romantic relationships? Today's planetary alignments encourage you to reflect and find ways to improve if necessary. One significant challenge might be your tendency to be possessive. Consider trying something new: allow your partner a bit more independence. It might feel daunting, but it's actually a safe move. Ease up on the control.",
      "horoscope_ja": "恋愛関係にどれくらい満足していますか？今日の惑星の配置は、あなたが過去を振り返り、必要であれば改善策を見つけるよう促しています。大きな課題の一つは、独占欲が強いことかもしれません。新しいことに挑戦してみてはいかがでしょうか。パートナーにもう少し自立心を与えてあげましょう。少し気が引けるかもしれませんが、実は安全な方法です。束縛を少し緩めてみましょう。"
    }
  }
}