{
  "updated_at": "2026-02-14T16:36:32.475Z",
  "jst_date": "2026-02-15",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-15",
      "sign": "Aries",
      "horoscope": "Today, Aries, your intuition and both your physical and mental energies are peaking. You might find yourself preferring solitude as you contemplate your ideas and strategize on how to implement them effectively. Consider jotting down your thoughts at some point, as this could help clarify your vision. Additionally, you may find yourself more attuned than usual to the emotions and thoughts of those around you.",
      "horoscope_ja": "牡羊座のあなた、今日は直感力と心身のエネルギーがピークを迎えています。アイデアを練り、それを効果的に実現する方法を戦略化する中で、孤独を好むようになるかもしれません。いつか考えを書き留めてみることを検討してみてください。ビジョンを明確にするのに役立ちます。さらに、周囲の人々の感情や考えに、いつもより敏感になっていることに気づくかもしれません。"
    },
    "taurus": {
      "date": "2026-02-15",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may find yourself brimming with vitality and enthusiasm. It's a great day to connect with friends, as their insights could prove valuable for your own endeavors. You might even find yourself strategizing on how to achieve a long-held aspiration, possibly thanks to a fortunate turn of events. Prepare for a day filled with conversation and planning!",
      "horoscope_ja": "おうし座のあなたは、今日、活力と情熱に溢れているかもしれません。友人と交流するのに最適な日です。彼らの洞察は、あなた自身の取り組みにとって貴重なものとなるかもしれません。幸運な出来事の展開によって、長年の夢を実現するための戦略を練ることになるかもしれません。会話と計画に満ちた一日を過ごす準備をしましょう！"
    },
    "gemini": {
      "date": "2026-02-15",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you may find that guests—perhaps brought in by family members—are interrupting your need for solitude and reflection. Your intellect is particularly keen, and inspiration is likely to flow freely. However, try not to let any frustration with the home environment derail your creative pursuits. If you feel the urge to retreat, consider finding a quiet space in your home where you can gather your thoughts.",
      "horoscope_ja": "ふたご座のあなたは今日、家族が招いたような来客によって、孤独と内省を求める気持ちが邪魔されるかもしれません。知性は特に鋭敏で、インスピレーションが湧き出るでしょう。しかし、家庭環境への不満が創造的な探求を妨げないよう、気をつけましょう。もし引きこもりたくなったら、家の中で静かな場所を見つけて、考えをまとめてみるのも良いでしょう。"
    },
    "cancer": {
      "date": "2026-02-15",
      "sign": "Cancer",
      "horoscope": "As a naturally intuitive individual, Cancer, today your sensitivity is heightened. You may find yourself effortlessly connecting with the thoughts and feelings of those around you, perhaps even sharing the same phrases simultaneously with someone else. Embrace these insights to deepen your empathy and comprehension of others. Additionally, you might discover that these connections spark your creativity and propel you toward your professional goals.",
      "horoscope_ja": "生まれながらに直感力に優れた蟹座のあなたは、今日、感受性が研ぎ澄まされています。周りの人の考えや感情に自然と共感し、時には誰かと同時に同じ言葉を口にすることさえあるかもしれません。こうした洞察を受け入れ、他者への共感と理解を深めましょう。さらに、こうした繋がりがあなたの創造性を刺激し、仕事上の目標達成を後押ししてくれるかもしれません。"
    },
    "leo": {
      "date": "2026-02-15",
      "sign": "Leo",
      "horoscope": "Today is one of those days when you might feel invincible, Leo! Your strength and determination are at an all-time high, propelling you to pursue your dreams with vigor. You could achieve a significant goal, see your ambitions come to fruition, or even stumble upon a fortunate opportunity. It's a perfect moment to explore new job prospects, request a salary increase, or bring a beloved project to life.",
      "horoscope_ja": "獅子座さん、今日はまさに無敵だと感じられる日です！あなたの力強さと決意はかつてないほど高まり、夢を追いかける原動力となっています。大きな目標を達成したり、野望が実現したり、あるいは幸運なチャンスに巡り合うかもしれません。新しい仕事の見通しを探したり、昇給を申請したり、愛するプロジェクトを実現させたりするのに最適な時期です。"
    },
    "virgo": {
      "date": "2026-02-15",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you might find that a partner in business or love presents you with exciting opportunities for growth. It could be a good time to consider drafting or finalizing important legal documents that will impact your future. There may also be a travel element in the mix. On the romantic front, things are looking bright! Your confidence and zest for life are radiating from you, making you more appealing to both your partner and new acquaintances. As the evening approaches, think about organizing a cozy celebration!",
      "horoscope_ja": "おとめ座のあなたは、今日、ビジネスや恋愛のパートナーがあなたに刺激的な成長の機会をもたらしてくれるかもしれません。将来に影響を与える重要な法的文書の起草や締結を検討するのに良い時期かもしれません。旅行の要素も加わるかもしれません。恋愛面では、明るい兆しが見えています！自信と人生への情熱があなたから溢れ出し、パートナーや新しい知り合いにとってより魅力的に映るでしょう。夜が近づいてきたら、アットホームなパーティーを企画してみてはいかがでしょうか！"
    },
    "libra": {
      "date": "2026-02-15",
      "sign": "Libra",
      "horoscope": "Libra, your dedication and savvy approach to your career are starting to yield results. This week, anticipate some uplifting developments at work. Today, you might find yourself brimming with energy and inspired to tackle a deep clean of your home. However, remember to pace yourself—there's no need to go it alone. Enlist the help of your household members to make the task easier!",
      "horoscope_ja": "天秤座さん、仕事への献身と賢明なアプローチが成果を上げ始めています。今週は仕事で明るい展開が期待できます。今日はエネルギーが溢れ、家の大掃除に取り組もうという気持ちになるかもしれません。ただし、ペースを守ることを忘れないでください。一人で頑張る必要はありません。家族に手伝ってもらい、作業を楽にしましょう！"
    },
    "scorpio": {
      "date": "2026-02-15",
      "sign": "Scorpio",
      "horoscope": "Scorpio, today you may find valuable insights from your past surfacing, ready to be harnessed for your benefit. Consider channeling these revelations into a creative endeavor, or simply let them enhance your interactions with those around you. Your romantic and alluring side is particularly heightened today, making it a perfect time to indulge in some retail therapy for soft, inviting fabrics. Expect your connections with partners to be intimate and filled with passion.",
      "horoscope_ja": "蠍座のあなた、今日は過去の貴重な洞察が表面化し、あなたの利益のために活用されるかもしれません。これらの気づきを創造的な活動に活かしたり、あるいは単に周りの人々との交流を深めるきっかけにしたりしてみてはいかがでしょうか。今日は特にロマンチックで魅力的な側面が高まっているので、柔らかくて魅力的な生地のショッピングセラピーを楽しむのに絶好の機会です。パートナーとの関係は親密で情熱に満ち溢れたものになるでしょう。"
    },
    "sagittarius": {
      "date": "2026-02-15",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, your living space may call for some attention. You and your family members might come together to tackle various tasks around the house. Whether it’s a deep clean or more significant repairs like plumbing or electrical work, it’s essential to know your limits. If you’re facing the latter, it’s wise to seek help from a professional, as there could be complexities that aren’t immediately obvious. Don’t hesitate to reach out for expert assistance!",
      "horoscope_ja": "射手座のあなた、今日は生活空間に少し気を配る必要があるかもしれません。家族で協力して、家中の様々な作業に取り組むかもしれません。大掃除でも、配管や電気工事といった大掛かりな修理でも、自分の限界を知っておくことが重要です。後者の場合は、すぐには気づかない複雑な問題が潜んでいる可能性があるため、専門家に助けを求めるのが賢明です。専門家のサポートをためらわずにご利用ください！"
    },
    "capricorn": {
      "date": "2026-02-15",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, anticipate a flurry of messages and calls from loved ones, be it partners, dear friends, or your kids. You might feel inspired to reach out as well. Some exciting and uplifting news may have landed in your lap, and you'll be eager to share it with those you cherish. Consider exploring your writing skills too! It's important to take note of any insights you gain today, as they could hold significant value down the line.",
      "horoscope_ja": "山羊座の皆さん、今日はパートナー、親しい友人、お子さんなど、大切な人からのメッセージや電話が殺到するでしょう。あなたも、連絡を取りたくなるかもしれません。ワクワクするような、心が温まるニュースが舞い込み、大切な人たちと分かち合いたくなるかもしれません。ライティングスキルを磨くのもお勧めです！今日得た洞察は、将来大きな価値を持つ可能性があるので、しっかりと書き留めておきましょう。"
    },
    "aquarius": {
      "date": "2026-02-15",
      "sign": "Aquarius",
      "horoscope": "Diving into your financial documents today might reveal some delightful news, Aquarius! It turns out your situation is more favorable than you realized. You may soon see some returns or unexpected perks coming your way. This could inspire you to indulge a little, whether it's treating yourself, picking up gifts for loved ones, or sprucing up your living space. Just remember to steer clear of impulsive purchases and keep your spending in check; you wouldn't want your newfound funds to vanish as swiftly as they arrived!",
      "horoscope_ja": "水瓶座さん、今日は家計簿を見直してみると、嬉しいニュースが見つかるかもしれません！ 実は、あなたの状況はあなたが思っていた以上に好調です。近々、何らかの利益や予期せぬ特典が舞い込むかもしれません。自分へのご褒美、大切な人へのプレゼント、住まいの模様替えなど、ちょっとした贅沢をしてみようという気持ちになるかもしれません。ただし、衝動買いは避け、支出を抑えることを忘れないでください。せっかく貯まったお金が、あっという間に消えてしまうのは避けたいですよね！"
    },
    "pisces": {
      "date": "2026-02-15",
      "sign": "Pisces",
      "horoscope": "Today, you may receive some enlightening information that sparks a wave of innovative ideas, Pisces. Your intuition is particularly sharp right now, making your insights potentially very beneficial. Be thorough in considering all possible outcomes. This newfound knowledge could help propel your career and financial goals forward, so take some time to jot down your thoughts and plans.",
      "horoscope_ja": "魚座のあなたは、今日、革新的なアイデアの波を起こすような啓発的な情報を得るかもしれません。あなたの直感は今特に鋭く、その洞察力は非常に有益になる可能性があります。あらゆる可能性を徹底的に検討してください。この新たな知識は、あなたのキャリアと経済的な目標を前進させるのに役立つでしょう。時間を取って、考えや計画を書き留めてください。"
    }
  }
}