{
  "updated_at": "2026-02-22T16:10:26.022Z",
  "jst_date": "2026-02-23",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-23",
      "sign": "Aries",
      "horoscope": "Aries, your natural intuition is usually spot on, but today it might feel like a fog has settled in, clouding your ability to connect with the emotions of those around you. Even your go-to sources of wisdom, like the I Ching, may seem confusing and unhelpful. While you might be tempted to rely on logic, it may not yield the clarity you seek today. Remember, this is just a temporary phase; your mental energy is simply low at the moment. Expect to regain your usual sharpness in just a few days.",
      "horoscope_ja": "牡羊座さん、あなたの生まれ持った直感は普段は的確ですが、今日は霧が立ち込めているように感じ、周りの人の感情と繋がる能力が曇ってしまうかもしれません。易経のような頼りになる知恵の源でさえ、混乱して役に立たないように感じるかもしれません。論理に頼りたくなるかもしれませんが、今日あなたが求めている明晰さは得られないかもしれません。これは一時的なもので、今は単に精神力が低下しているだけであることを忘れないでください。数日後には、いつもの鋭敏さを取り戻すでしょう。"
    },
    "taurus": {
      "date": "2026-02-23",
      "sign": "Taurus",
      "horoscope": "Taurus, you're known for your strong work ethic, whether it's tackling your job, pursuing personal projects, or handling household tasks. But today, you might find yourself in a rare state of lethargy. The urge to lounge around with a good book or binge-watch your favorite shows may be too tempting to resist. And that's perfectly fine! Everyone deserves a break to unwind and recharge. So, don’t let guilt creep in just because you’re not in the mood to be productive.",
      "horoscope_ja": "おうし座のあなたは、仕事に取り組んだり、個人的なプロジェクトに取り組んだり、家事に取り組んだりと、強い労働倫理で知られています。しかし今日は、珍しく無気力な状態に陥るかもしれません。ゆったりと読書をしたり、お気に入りの番組を一気見したりしたい衝動に抗えないかもしれません。でも、それは全く問題ありません！誰もがリラックスしてエネルギーを充電するための休息を取る権利があります。だから、生産的な気分になれないからといって、罪悪感に苛まれないでください。"
    },
    "gemini": {
      "date": "2026-02-23",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you may feel the urge to retreat from the hustle and bustle of the world. Your cozy backyard or inviting bedroom is calling your name, especially with that new paperback you've been eager to dive into. You might even prefer to enjoy your meals in solitude rather than with the family. Embrace this need for personal space; it's perfectly normal to crave some alone time, and your loved ones will likely be supportive of your desire for a little peace.",
      "horoscope_ja": "ふたご座のあなたは今日、世間の喧騒から逃れたいという衝動に駆られるかもしれません。居心地の良い裏庭や、居心地の良い寝室が、特にずっと読みたかった新しいペーパーバックのおかげで、あなたを呼んでいるかもしれません。家族と一緒に食事をするよりも、一人でゆっくりと食事を楽しみたいと思うかもしれません。この個人的な空間への欲求を受け入れましょう。一人になりたいという気持ちはごく自然なことであり、あなたの愛する人たちは、少しの静けさを求めるあなたの気持ちをきっと理解してくれるでしょう。"
    },
    "cancer": {
      "date": "2026-02-23",
      "sign": "Cancer",
      "horoscope": "A friend or family member may suggest a trip, Cancer, but today even a quick trip to the grocery store feels like too much. You might not be in the mood for conversation either, as your thoughts are likely drifting towards intellectual or spiritual pursuits. It could be one of those days where you'd prefer to stay in and delve into those topics. Let your friend know that their travel idea is appealing, but you'll need to chat about it another time. That's all you can handle for now.",
      "horoscope_ja": "蟹座さん、友人や家族から旅行を提案されるかもしれませんが、今日はちょっとしたスーパーへの買い物さえも負担に感じます。思考が知的または精神的な探求へと向かうため、会話をする気分にもなれないかもしれません。今日は家でそれらの話題をじっくりと語り合いたい日かもしれません。友人に旅行の提案は魅力的ですが、それについてはまた別の機会に話し合う必要があると伝えましょう。今はそれが精一杯です。"
    },
    "leo": {
      "date": "2026-02-23",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might find yourself feeling a bit down as you confront your financial landscape. With numerous bills to tackle, your wallet may feel lighter than you'd prefer. However, remember that this is just a passing phase, and there's a sense of relief in having those expenses settled. Consider diving into an affordable pastime, such as reading, to distract yourself and lift your spirits. Rest assured, you're managing just fine!",
      "horoscope_ja": "しし座さん、今日は家計の現状に直面し、少し落ち込んでいるかもしれません。たくさんの請求書を処理しなければならないので、財布の中身は思ったより軽く感じるかもしれません。しかし、これは一時的なもので、出費を済ませることで安堵感を得られることを忘れないでください。読書など、手頃な趣味に没頭して、気分転換をし、気分を高めてみてはいかがでしょうか。ご安心ください。あなたはうまくやっています！"
    },
    "virgo": {
      "date": "2026-02-23",
      "sign": "Virgo",
      "horoscope": "As you gaze into the mirror this morning, Virgo, you may be taken aback by your reflection. The stress and hard work you've been putting in are showing, leaving you feeling fatigued. However, it's likely that you're exaggerating how you perceive your appearance. Consider indulging in a little retail therapy and taking a refreshing stroll, followed by some well-deserved rest. By tomorrow, you’ll likely feel and look fantastic again. Keep your chin up!",
      "horoscope_ja": "おとめ座のあなた、今朝鏡に映る自分の姿にきっと驚くでしょう。これまでのストレスや努力が影を潜め、疲れを感じています。でも、もしかしたら、自分の外見を誇張しているのかもしれません。ちょっとした買い物やリフレッシュのための散歩を楽しんで、その後はゆっくり休んでみてはいかがでしょうか。明日には、きっと気分も見た目も最高の状態になっているはずです。前向きに！"
    },
    "libra": {
      "date": "2026-02-23",
      "sign": "Libra",
      "horoscope": "Today, Libra, you may encounter a situation that unexpectedly triggers a memory of a past unpleasant experience. While you might not consciously recall the event from today, the echoes of that long-ago incident could linger in your mind, casting a shadow over your mood. Take a moment to reflect on why this memory holds such power over you. Once you understand its impact, allow yourself to release it. You may find that doing so brings a sense of relief, as if a burden has been lifted from your shoulders.",
      "horoscope_ja": "天秤座のあなたは今日、予期せぬ出来事に遭遇し、過去の不快な記憶が蘇るかもしれません。意識的にその出来事を思い出すことはないかもしれませんが、遠い昔の出来事の残響が心に残り、気分に影を落とすかもしれません。なぜこの記憶がこれほどまでにあなたに影響を与えているのか、少し考えてみてください。その影響を理解したら、それを手放してみましょう。そうすることで、肩から重荷が下りたような安堵感が得られるかもしれません。"
    },
    "scorpio": {
      "date": "2026-02-23",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, it seems your friends might be unavailable, leaving you without phone chats or visits. This could lead to feelings of loneliness creeping in. You might find yourself overthinking and doubting your connections. But remember, that's not the truth! Shift your focus! Dive into a good book or catch up on some videos until the phone rings—someone will reach out!",
      "horoscope_ja": "蠍座さん、今日は友達と連絡が取れなくなり、電話で話したり会ったりすることができなくなるかもしれません。これは孤独感を募らせることにつながるかもしれません。考えすぎてしまい、人間関係を疑ってしまうかもしれません。でも、それは真実ではないことを覚えておいてください！意識を切り替えましょう！電話が鳴るまで、良い本を読んだり、動画を見たりするのも良いでしょう。きっと誰かが連絡をくれるはずです！"
    },
    "sagittarius": {
      "date": "2026-02-23",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may feel an urge to remain at home for various reasons. It could be that you're anticipating a late visitor or a delivery that hasn't arrived yet. This situation might leave you feeling a bit restless. While you enjoy the comfort of home, it's usually on your own terms. To make the most of this waiting period, dive into a creative project. Engaging in something artistic can give you a sense of control, even if the circumstances are beyond your choice.",
      "horoscope_ja": "射手座のあなたは、今日、様々な理由で家にいたいという衝動に駆られるかもしれません。例えば、遅れて来る来客や、まだ届いていない配達物など。こうした状況は、少し落ち着かない気分にさせるかもしれません。家の快適さは楽しみながらも、それはたいてい自分のペースで過ごすものです。この待機期間を最大限に活用するには、創造的なプロジェクトに没頭してみましょう。たとえ状況が自分の手に負えない状況であっても、何か芸術的なことに取り組むことで、コントロール感を得ることができるでしょう。"
    },
    "capricorn": {
      "date": "2026-02-23",
      "sign": "Capricorn",
      "horoscope": "Today, Capricorn, you may find navigating your neighborhood a bit challenging due to ongoing construction on roads or buildings. Expect traffic jams that could stretch for blocks. If you have errands to run, consider walking or tackling them early in the day. Additionally, the construction might disrupt phone lines temporarily, causing you to miss important calls. It could be a day filled with frustration, so try to keep yourself occupied at home.",
      "horoscope_ja": "山羊座のあなたは、今日、道路や建物の工事が続いているため、近所を歩き回るのが少し大変かもしれません。数ブロックに及ぶ交通渋滞が予想されます。用事がある場合は、歩くか、早い時間に済ませることを検討してください。また、工事の影響で電話回線が一時的に不通になり、重要な電話に出られない可能性もあります。フラストレーションが溜まる一日になるかもしれませんので、家で何かと気を配るようにしましょう。"
    },
    "aquarius": {
      "date": "2026-02-23",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you may experience a sense of disillusionment regarding a public figure you’ve long looked up to, leading to a personal ethical dilemma. This could prompt you to reevaluate beliefs and values that you’ve held without much scrutiny throughout your life. Remember, this introspection is a vital part of your growth. By tomorrow, you’re likely to find a sense of resolution within yourself, having matured through this experience. Stay strong!",
      "horoscope_ja": "水瓶座のあなたは今日、長年尊敬してきた著名人に対する幻滅感を抱き、個人的な倫理的なジレンマに陥るかもしれません。これは、人生を通してあまり吟味することなく抱いてきた信念や価値観を再評価するきっかけとなるかもしれません。この内省は、あなたの成長にとって不可欠な要素であることを忘れないでください。明日には、この経験を通して成熟し、自分自身の中に解決の兆しを見出すでしょう。強くいてください！"
    },
    "pisces": {
      "date": "2026-02-23",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you may find yourself feeling a bit down due to the silence from your romantic partner. It's easy to slip into the misconception that their lack of communication means they no longer have feelings for you. Resist this urge to jump to conclusions. If you take a step back and look at the situation with clarity, you'll see that this isn't the case. Most likely, your partner has simply been caught up with something and will reach out as soon as they can.",
      "horoscope_ja": "魚座のあなたは、今日、恋人からの沈黙に少し落ち込んでいるかもしれません。連絡がないからといって、相手がもうあなたに対して気持ちがないと勘違いしてしまいがちです。しかし、すぐに結論を出そうとする衝動を抑えましょう。少し立ち止まって状況を冷静に見てみると、そうではないことが分かります。おそらく、相手はただ何かに追われていて、できるだけ早く連絡してくるでしょう。"
    }
  }
}