{
  "updated_at": "2025-11-11T16:31:29.832Z",
  "jst_date": "2025-11-12",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-12",
      "sign": "Aries",
      "horoscope": "Today, love takes center stage in your life. You might find yourself having a heartfelt discussion with your partner, aimed at clarifying your emotions regarding the relationship. Other topics that matter to both of you may also arise, which is a positive sign for what lies ahead. Resist the urge to criticize your partner; instead, calmly express your own needs.",
      "horoscope_ja": "今日、あなたの人生は愛に大きく左右されます。パートナーと心から話し合い、二人の関係に対する気持ちを整理するかもしれません。二人にとって大切な話題が持ち上がることも考えられます。これは、今後の展開にとって明るい兆しです。パートナーを批判したい衝動を抑え、自分のニーズを冷静に表現しましょう。"
    },
    "taurus": {
      "date": "2025-11-12",
      "sign": "Taurus",
      "horoscope": "Today, the presence of youthful guests will inspire your best qualities. Have you whipped up some tasty treats for them? When you set your mind to it, you shine as a host, captivating your visitors and ensuring they have a wonderful time. In turn, their company will be delightful and engaging. This is a perfect opportunity for you to enjoy some social interaction, which you thrive on. Additionally, expect a pleasant delivery to arrive at some point during the day.",
      "horoscope_ja": "今日は、若いゲストの存在があなたの魅力を最大限に引き出してくれるでしょう。彼らのために美味しいおもてなしを用意しましたか？ 心を込めておもてなしすれば、あなたはホストとして輝き、ゲストを魅了し、素晴らしい時間を過ごせるようにしてくれます。そして、ゲストも楽しく、魅力的な時間を過ごせるでしょう。これは、あなたが得意とする社交を楽しむ絶好の機会です。さらに、日中に素敵な配達物が届くことも期待できます。"
    },
    "gemini": {
      "date": "2025-11-12",
      "sign": "Gemini",
      "horoscope": "A spiritual organization could be launching nearby today, and it may pique the interest of both you and your partner. Consider visiting to explore what they have to offer. You might encounter intriguing individuals, learn about captivating concepts, and even stumble upon some new reading material. Get ready for an enjoyable evening ahead!",
      "horoscope_ja": "今日、近くでスピリチュアルな団体が発足するかもしれません。あなたとパートナーの興味をそそるかもしれません。どんな内容なのか、ぜひ訪れてみてはいかがでしょうか。興味深い人々と出会ったり、魅力的な概念を学んだり、新しい読み物に出会えるかもしれません。楽しい夜を過ごす準備をしましょう！"
    },
    "cancer": {
      "date": "2025-11-12",
      "sign": "Cancer",
      "horoscope": "Today is the day to tackle your financial matters. You might discover a little extra cash in your bank account or need to adjust your budget. While it may not be a significant amount, it could provide the relief you need right now. Once you've sorted this out, unwind and enjoy a cozy evening at home. You may not be in the mood to go out, but you'll find pleasure in a quiet night in.",
      "horoscope_ja": "今日はお金の問題に取り組む日です。銀行口座に少し余裕ができた、あるいは予算を調整する必要があるかもしれません。大した金額ではないかもしれませんが、今必要な安心感を与えてくれるかもしれません。整理ができたら、家でくつろぎながら、心地よい夜を過ごしましょう。外出する気分ではないかもしれませんが、静かな夜はきっと喜びとなるでしょう。"
    },
    "leo": {
      "date": "2025-11-12",
      "sign": "Leo",
      "horoscope": "Today brings the promise of delightful news that is sure to lift your spirits and energize you. You might find yourself buzzing with excitement, making it hard to stay in one place. A brisk stroll around your neighborhood could be just what you need to channel that vibrant energy. This positive vibe may inspire a hopeful outlook on what lies ahead. Make the most of your evening!",
      "horoscope_ja": "今日は、きっとあなたの気分を明るくし、活力を与えてくれる嬉しいニュースが舞い込んでくるでしょう。興奮で胸がいっぱいになり、じっとしていられないかもしれません。そんな時は、近所を軽く散歩するのが、その活力を引き出すのにぴったりかもしれません。このポジティブな雰囲気が、これからの未来への希望を与えてくれるかもしれません。今夜は最高の夜を！"
    },
    "virgo": {
      "date": "2025-11-12",
      "sign": "Virgo",
      "horoscope": "Today, your creativity could take flight, leading you to dream up exciting new possibilities for your future. Financially, you might find some good news on the horizon, perhaps even a potential raise. Embrace your imaginative side and allow your thoughts to wander. In the coming day, consider jotting down your ideas and filtering out those that aren't feasible. Take your time before making any decisions.",
      "horoscope_ja": "今日はあなたの創造力が羽ばたき、未来への刺激的な新しい可能性を思い描くことができるかもしれません。経済面では、良い知らせが舞い込み、もしかしたら昇給の可能性もあるかもしれません。想像力豊かな面を活かし、自由に考えてみましょう。明日は、思いついたアイデアを書き留め、実現不可能なものは選別してみましょう。決断を下す前に、じっくり時間をかけてください。"
    },
    "libra": {
      "date": "2025-11-12",
      "sign": "Libra",
      "horoscope": "Today, your intellect may prove beneficial to those around you. You've been thriving lately, and thoughts of how to share your blessings are on your mind. A friend might suggest some community groups that could use your talents. However, take a moment to reflect before diving in; ensure that your heart is truly in it. You wouldn't want to take on a responsibility and risk disappointing others.",
      "horoscope_ja": "今日、あなたの知性は周囲の人々にとって有益なものとなるかもしれません。最近、あなたは順調に活動を続けており、その恵みをどう分かち合えるか考えが巡っています。友人が、あなたの才能を活かせるような地域団体を紹介してくれるかもしれません。しかし、実際に行動に移す前に、少し時間を取ってじっくり考え、本当に心からそう思っているかを確認しましょう。責任を負って他人を失望させるようなことは避けたいはずです。"
    },
    "scorpio": {
      "date": "2025-11-12",
      "sign": "Scorpio",
      "horoscope": "Your professional life seems to be on an upswing, yet you may find yourself questioning whether this is the path you truly wish to pursue. It could be a good time to explore alternative avenues, especially those you've always been curious about but never had the chance to pursue. Remember, there's no rush to make a decision right away. Take your time and ensure you're confident before taking any steps forward.",
      "horoscope_ja": "仕事は順調に進んでいるように見えますが、これが本当に自分が進みたい道なのか疑問に思うこともあるかもしれません。別の道、特にこれまで興味があったものの、なかなか踏み出せなかった道を探してみるのも良いかもしれません。すぐに決断する必要はありません。時間をかけて、自信を深めてから一歩踏み出しましょう。"
    },
    "sagittarius": {
      "date": "2025-11-12",
      "sign": "Sagittarius",
      "horoscope": "Thinking about going to a lecture or workshop? Today is an excellent day for that! Your intellect and feelings are harmonizing beautifully, paving the way for valuable insights. With your practical judgment at its peak, it's a perfect time to make sound decisions. Engaging in conversations with like-minded individuals will prove to be both rewarding and enlightening.",
      "horoscope_ja": "講演会やワークショップへの参加をお考えですか？今日はまさにうってつけの日です！知性と感情が美しく調和し、貴重な洞察へと繋がるでしょう。実践的な判断力がピークに達しているので、賢明な決断を下すには絶好の機会です。同じ志を持つ人々との会話は、きっと有意義で、啓発的な経験となるでしょう。"
    },
    "capricorn": {
      "date": "2025-11-12",
      "sign": "Capricorn",
      "horoscope": "Dreams may bring you the creative spark and clarity necessary to propel your career forward. If you've been toying with various concepts, today's revelations could ignite your motivation to take action. It's wise to outline a plan before diving in. By committing to remain focused, productive, and pragmatic, your choices made today have the potential to lead to success.",
      "horoscope_ja": "夢は、キャリアを前進させるために必要な創造的なひらめきと明確なビジョンをもたらしてくれるかもしれません。もし様々な構想を練ってきたなら、今日の啓示は行動を起こすためのモチベーションに火をつけるかもしれません。行動に移す前に、計画を立てておくのが賢明です。集中力、生産性、そして現実的な姿勢を維持することを約束することで、今日の選択は成功へとつながる可能性を秘めています。"
    },
    "aquarius": {
      "date": "2025-11-12",
      "sign": "Aquarius",
      "horoscope": "Today, your connection with your partner may transcend words, leaning more towards a psychic bond. However, when you do converse, ensure it's sincere, open, and fulfilling. You'll exchange not just emotions but also insights from your recent readings. The topic of embarking on a journey together might arise, fostering a deeper sense of togetherness and comprehension. Embrace this opportunity!",
      "horoscope_ja": "今日、パートナーとの繋がりは言葉を超え、より精神的な絆へと傾くかもしれません。しかし、会話をする際は、誠実でオープン、そして充実したものにしてください。感情だけでなく、最近のリーディングから得た洞察も交換するでしょう。一緒に旅に出ようという話が持ち上がり、より深い一体感と理解が育まれるかもしれません。この機会をぜひ楽しんでください！"
    },
    "pisces": {
      "date": "2025-11-12",
      "sign": "Pisces",
      "horoscope": "Your mind may be buzzing with a flurry of creative project ideas that have the potential to boost your income. So many thoughts might flood in that you'll need to rush to jot them down to avoid losing any gems. Conversations with friends or your partner could spark even more inspiration, rather than narrowing your options. Embrace this creative surge for the moment; you can sort through the ideas later. The key right now is to capture them on paper.",
      "horoscope_ja": "収入アップにつながる可能性のあるクリエイティブなプロジェクトのアイデアが頭の中で次々と湧き上がっているかもしれません。あまりにも多くの考えが浮かんでくるので、貴重なアイデアを逃さないように、急いで書き留める必要があるかもしれません。友人やパートナーとの会話は、選択肢を狭めるどころか、さらなるインスピレーションの源になるかもしれません。この創造的な衝動を今は大切にしましょう。アイデアの整理は後でできます。今重要なのは、それらを紙に書き留めることです。"
    }
  }
}