{
  "updated_at": "2026-01-03T16:30:08.643Z",
  "jst_date": "2026-01-04",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-04",
      "sign": "Aries",
      "horoscope": "Aries, it seems that the adventure you were looking forward to might need to be delayed, likely due to budget constraints. You may find yourself wanting to travel with someone who is currently facing financial challenges. While this might feel disheartening, keep in mind that this is merely a postponement. Your getaway will happen eventually! Feel free to begin planning your trip now; by the time you're ready to go, your companion should be in a better financial position.",
      "horoscope_ja": "牡羊座さん、楽しみにしていた冒険は、おそらく予算の都合で延期せざるを得なくなるかもしれません。経済的に困難な状況にある人と旅行したいと思うこともあるでしょう。少し気がめいるかもしれませんが、これは単なる延期に過ぎません。あなたの休暇はいつか実現します！今すぐ旅行の計画を始めてください。出発の準備が整う頃には、同行者の経済状況も良くなっているはずです。"
    },
    "taurus": {
      "date": "2026-01-04",
      "sign": "Taurus",
      "horoscope": "Taurus, today you may find yourself tapping into a surprising reservoir of self-discipline as you tackle a significant project. Your determination and tenacity could lead to remarkable achievements. However, it's essential to pause and recharge every now and then. Don't let your dedication to your work overshadow your basic needs—make sure to nourish yourself. Remember, your productivity will falter if you ignore your well-being. So, take it easy and find a healthy rhythm!",
      "horoscope_ja": "おうし座のあなたは、今日、重要なプロジェクトに取り組む中で、驚くほどの自己規律の源泉を掘り起こすかもしれません。あなたの決意と粘り強さは、素晴らしい成果につながるかもしれません。しかし、時折立ち止まってエネルギーを充電することも重要です。仕事への熱意が、あなたの基本的なニーズを覆い隠してしまうことのないように、しっかりと栄養を摂るようにしてください。健康を無視すると、生産性が低下することを忘れないでください。ですから、気楽に、健康的なリズムを見つけましょう！"
    },
    "gemini": {
      "date": "2026-01-04",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you might find that a business or romantic partner is experiencing some emotional ups and downs. As you spend time together, you may notice them swinging from excitement to melancholy, which could leave you feeling a bit perplexed about how to react. The best approach is to keep your focus on the tasks at hand and not get too caught up in their mood shifts. Fortunately, this emotional rollercoaster is likely to settle down by the end of the day.",
      "horoscope_ja": "ふたご座のあなたは、今日、仕事のパートナーや恋人が感情の浮き沈みを経験しているかもしれません。一緒に過ごすうちに、興奮から憂鬱へと感情が揺れ動くのに気づくかもしれません。どう反応したらいいのか、少し戸惑ってしまうかもしれません。最善のアプローチは、目の前の仕事に集中し、相手の気分の変化にあまり巻き込まれないことです。幸いなことに、この感情のジェットコースターは、一日の終わりには落ち着くでしょう。"
    },
    "cancer": {
      "date": "2026-01-04",
      "sign": "Cancer",
      "horoscope": "Typically, you shine with creativity in your professional life, Cancer, but today you might find that your well of inspiration has run dry. Despite your efforts, generating fresh ideas may feel impossible. It’s likely that your energy levels are low, causing your thoughts to flow more slowly than normal. Focus on completing your usual tasks today. By tomorrow, your inventive spirit should return.",
      "horoscope_ja": "蟹座のあなたは、普段は仕事で創造性を発揮するタイプですが、今日はインスピレーションの源が枯渇してしまうかもしれません。努力を重ねても、斬新なアイデアを生み出すのは不可能に思えるかもしれません。エネルギーレベルが低下し、思考が普段よりゆっくりと流れているのかもしれません。今日はいつも通りの仕事をこなすことに集中してください。明日には、あなたの発明精神が戻ってくるはずです。"
    },
    "leo": {
      "date": "2026-01-04",
      "sign": "Leo",
      "horoscope": "Today, Leo, you may find yourself facing a dilemma regarding your values. A loved one might ask for your assistance in a way that feels uncomfortable for you, placing you in a challenging position. While your instinct may be to decline, remember that your friend is counting on you. Take the time to weigh all potential outcomes before making a decision. Think about how your choice could impact both you and your friend. This thoughtful approach will help ensure that you act with fairness.",
      "horoscope_ja": "獅子座さん、今日は自分の価値観に関するジレンマに直面するかもしれません。愛する人が、あなたにとって気まずい方法で助けを求めてきて、難しい立場に立たされるかもしれません。本能的に断りたくなるかもしれませんが、友人はあなたを頼りにしていることを忘れないでください。決断を下す前に、あらゆる可能性を検討してみてください。あなたの選択があなたと友人の両方にどのような影響を与えるかを考えてみましょう。この思慮深いアプローチは、公平な行動をとるのに役立ちます。"
    },
    "virgo": {
      "date": "2026-01-04",
      "sign": "Virgo",
      "horoscope": "Virgo, you may find yourself in a bit of a funk today, and the cause might be elusive. Don't be surprised if you can't pinpoint a specific reason for your mood; it could just be a natural dip in your energy levels. To combat this, consider hitting the gym or engaging in some physical activity. Getting those endorphins flowing will likely lift your spirits by the afternoon, making you more inclined to enjoy some social time later on.",
      "horoscope_ja": "おとめ座のあなたは、今日は少し気分が落ち込んでいるかもしれません。その原因がはっきりしないかもしれません。気分の落ち込みの理由がわからなくても驚かないでください。単にエネルギーレベルが自然に低下しているだけかもしれません。この状態を解消するには、ジムに行くなど、身体を動かすことを検討してみてください。エンドルフィンが分泌されれば、午後には気分が明るくなり、その後の社交的な時間もより楽しめるでしょう。"
    },
    "libra": {
      "date": "2026-01-04",
      "sign": "Libra",
      "horoscope": "A dear friend or romantic partner you haven't connected with in some time may reach out to plan a reunion, Libra. This could lift your spirits significantly, filling your day with excitement as you anticipate the upcoming meeting. You'll have plenty of intriguing stories and insights to exchange. However, it might be wise to keep the visit a bit shorter than you desire and schedule another get-together for the future. Otherwise, you risk feeling worn out.",
      "horoscope_ja": "しばらく連絡を取っていなかった親しい友人や恋人から、再会の計画を練ろうと連絡が来るかもしれません、てんびん座さん。これはあなたの気分を大きく高め、これからの再会を心待ちにするワクワク感で一日が満たされるでしょう。興味深い話や意見交換がたくさんできるでしょう。しかし、訪問は希望よりも少し短くして、次回また会う予定を立てるのが賢明かもしれません。そうしないと、疲れ果ててしまう可能性があります。"
    },
    "scorpio": {
      "date": "2026-01-04",
      "sign": "Scorpio",
      "horoscope": "Today, Scorpio, your home may feel a bit lonely with many of your housemates out and about. Use this opportunity to tackle those personal projects you've been delaying. While they may seem dull and tedious, imagine the satisfaction you'll experience once they're completed! Later in the evening, you could have some guests over. Make the most of your day!",
      "horoscope_ja": "蠍座さん、今日はハウスメイトの多くが外出しているので、家が少し寂しく感じるかもしれません。この機会に、ずっと先延ばしにしていた個人的なプロジェクトに取り組んでみましょう。退屈で面倒に思えるかもしれませんが、完成した時の満足感を想像してみてください！夕方には、ゲストを招くのも良いでしょう。一日を最大限に活用しましょう！"
    },
    "sagittarius": {
      "date": "2026-01-04",
      "sign": "Sagittarius",
      "horoscope": "A loved one may be under the weather today, Sagittarius, prompting you to stay close and offer your support. It's commendable to be there for them, but remember that your sensitivity is heightened right now, which means you might pick up on their pain. To shield yourself from absorbing their discomfort, visualize a protective white light surrounding you.",
      "horoscope_ja": "射手座のあなた、今日は愛する人が体調を崩すかもしれません。そばにいて支えてあげてください。寄り添うことは素晴らしいことですが、今は感受性が高まっているため、相手の痛みを感じ取ってしまう可能性があることを忘れないでください。相手の不快感を吸収しないように、白い光があなたを包み込むようにイメージしてみてください。"
    },
    "capricorn": {
      "date": "2026-01-04",
      "sign": "Capricorn",
      "horoscope": "Capricorn, a long-cherished goal may feel frustratingly out of reach today, leading you to contemplate giving up. However, this doesn’t mean your aspirations are unattainable. In fact, releasing your grip on a dream can sometimes pave the way for its realization. Keep this in mind if you find yourself dwelling on past setbacks. There’s still plenty of hope ahead!",
      "horoscope_ja": "山羊座のあなたは、今日は長年抱いてきた目標が手の届かないほどに感じられ、諦めようかと考えてしまうかもしれません。しかし、これはあなたの願望が達成不可能という意味ではありません。むしろ、夢への執着を手放すことで、実現への道が開かれることもあります。過去の挫折に囚われているなら、このことを思い出してください。まだ希望はたくさんあります！"
    },
    "aquarius": {
      "date": "2026-01-04",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you might find that someone in your home is facing some challenges, prompting you to think about taking a day off work to support them. However, your professional obligations are also calling. Deciding between staying home or heading to the office could be a tough choice today, so take the time to consider all aspects before making your decision. It's likely that your housemate will reassure you that everything is fine and encourage you to stick to your work commitments.",
      "horoscope_ja": "水瓶座のあなた、今日はあなたの家族が何か問題を抱えているかもしれません。その人を支えるために、仕事を休むことを考えるかもしれません。しかし、仕事上の義務も迫っています。今日は家にいるかオフィスに行くか、難しい決断になるかもしれません。決断する前に、あらゆる側面をよく考えてみてください。同居人が大丈夫だと安心させ、仕事の約束を守るように励ましてくれるでしょう。"
    },
    "pisces": {
      "date": "2026-01-04",
      "sign": "Pisces",
      "horoscope": "Today, a significant professional matter may demand your attention and hard work, Pisces, as you strive to achieve your goals. You might find yourself grappling with uncertainties about your capabilities at some point. However, resist the urge to feel overwhelmed. Just gather your energy and concentrate on what needs to be done. Trust in your ability to achieve remarkable things today.",
      "horoscope_ja": "うお座のあなたは、今日、目標達成に向けて努力する中で、仕事上の重要な問題に気を配り、懸命な努力を強いられるかもしれません。自分の能力に不安を感じることもあるでしょう。しかし、押しつぶされそうになる衝動を抑えてください。エネルギーを蓄え、やるべきことに集中してください。今日、素晴らしい成果を成し遂げられるという自分の能力を信じてください。"
    }
  }
}