{
  "updated_at": "2026-02-12T17:03:48.864Z",
  "jst_date": "2026-02-13",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-13",
      "sign": "Aries",
      "horoscope": "Today, Aries, your efforts to reach out to friends or family in distant places might hit a snag. It seems that the usual tech tools we rely on, like phones and the Internet, could be acting up—possibly due to solar flares. There's no need to stress over what you can't control. Instead, embrace the pause and focus on something that brings you joy!",
      "horoscope_ja": "牡羊座のあなた、今日は遠く離れた友人や家族と連絡を取ろうとする努力が行き詰まるかもしれません。電話やインターネットなど、私たちが普段頼りにしているテクノロジーツールが、太陽フレアの影響で不調になるかもしれません。自分でコントロールできないことでストレスを感じる必要はありません。むしろ、少し立ち止まって、喜びをもたらしてくれる何かに集中しましょう！"
    },
    "taurus": {
      "date": "2026-02-13",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you may encounter some hiccups with machines that handle your finances, like ATMs, phone banking, or online services. This could mean reverting to traditional methods, such as visiting the bank in person or writing checks. With potential electrical storms or solar flares disrupting satellite communications, your options may be limited. Therefore, it's wise to hold off on any significant financial dealings today.",
      "horoscope_ja": "おうし座のあなたは今日、ATM、テレフォンバンキング、オンラインサービスなど、お金を扱う機械に何らかのトラブルに遭遇するかもしれません。これは、銀行に直接出向いたり、小切手を切ったりといった従来の方法に戻ることを意味するかもしれません。雷雨や太陽フレアの影響で衛星通信が妨害される可能性があるため、選択肢が限られる可能性があります。そのため、今日は重要な金融取引は控えるのが賢明です。"
    },
    "gemini": {
      "date": "2026-02-13",
      "sign": "Gemini",
      "horoscope": "Today is an ideal opportunity for you to focus on self-care, Gemini. Interactions with loved ones may not flow smoothly, as many around you could be feeling a bit unsettled and anxious. Instead, consider diving into a good book or exploring the internet, and dedicate some time to those personal projects that have been on the back burner. Remember, your friends will still be there tomorrow!",
      "horoscope_ja": "ふたご座さん、今日はセルフケアに集中する絶好の機会です。周りの多くの人が少し落ち着かず不安を感じているせいで、大切な人との交流がスムーズに進まないかもしれません。その代わりに、良い本を読んだり、インターネットを探索したり、後回しにしていた個人的なプロジェクトに時間を割いてみましょう。明日も友達はそばにいることを忘れないでくださいね！"
    },
    "cancer": {
      "date": "2026-02-13",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you may find yourself diving into the world of modern technology, possibly something computer-related, and it might feel overwhelming. Your mind could be buzzing with information, so it's wise to pace yourself! Don't forget to take regular breaks to refresh your thoughts. Trying to absorb too much at once could leave you feeling lost.",
      "horoscope_ja": "蟹座のあなたは今日、現代のテクノロジー、特にコンピューター関連の世界に飛び込んでしまい、圧倒されてしまうかもしれません。頭の中は情報でいっぱいになるかもしれませんので、ペースを守るのが賢明です！ 定期的に休憩を取り、思考をリフレッシュすることを忘れないでください。一度に多くのことを吸収しようとすると、途方に暮れてしまうかもしれません。"
    },
    "leo": {
      "date": "2026-02-13",
      "sign": "Leo",
      "horoscope": "Today, Leo, embrace the unusual! You might find yourself inundated with bizarre news or online content that raises your eyebrows. There's a good chance that much of this is misleading! It's wise to approach it with a healthy dose of skepticism, even if those around you seem to be taking it at face value. Hold onto your critical thinking, and think twice before sharing any of this information—make sure to add your own perspective first.",
      "horoscope_ja": "獅子座さん、今日は珍しいものを受け入れましょう！奇妙なニュースや、眉をひそめるようなオンラインコンテンツに溢れかえっているかもしれません。その多くは誤解を招く可能性が高いです！たとえ周りの人が額面通りに受け取っているように見えても、適度な懐疑心を持って接するのが賢明です。批判的思考力を保ち、情報を共有する前によく考えましょう。まずは自分の視点を加えるようにしてください。"
    },
    "virgo": {
      "date": "2026-02-13",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you might find yourself at the center of swirling rumors that could stir up some anxiety. Expect calls from friends and colleagues eager to chat about the situation. However, it's likely that these whispers are merely exaggerated tales, so don't let them rattle you. Someone may have their own agenda and is prone to amplifying the truth. Resist the urge to dive into the gossip. Maintain your composure and communicate to your callers that your best approach is to hold off until things become more transparent. This strategy will help you navigate through the day.",
      "horoscope_ja": "乙女座のあなたは今日、渦巻く噂話の中心にいることに気づき、不安をかき立てられるかもしれません。友人や同僚から、状況について話したくて電話がかかってくるかもしれません。しかし、これらの噂話は大げさに誇張された話である可能性が高いので、動揺しないでください。誰かが自分の思惑を持っていて、真実を誇張する傾向があるかもしれません。噂話に飛びつきたい衝動を抑えましょう。平静を保ち、電話をかけてきた相手には、事態がより明確になるまで待つのが最善策だと伝えましょう。この戦略は、今日を乗り切るのに役立つでしょう。"
    },
    "libra": {
      "date": "2026-02-13",
      "sign": "Libra",
      "horoscope": "Unexpected news from distant sources, perhaps through email or online channels, may be creating quite a buzz among your circle, Libra. While it might be tempting to dive into the excitement, exercise caution, as this information is likely to be distorted and misleading. Find it intriguing, ponder its implications, but hold off on taking it to heart until you can verify it through trustworthy sources.",
      "horoscope_ja": "天秤座さん、遠く離れた情報源から、メールやオンラインチャネルなどを通じて予期せぬニュースが届き、あなたの周囲で大きな話題になっているかもしれません。その興奮に飛びつきたくなるかもしれませんが、情報は歪曲されたり誤解を招く可能性があるので注意が必要です。興味をそそられ、その意味をじっくり考えてみてください。しかし、信頼できる情報源から確認できるまでは、真に受けるのは控えましょう。"
    },
    "scorpio": {
      "date": "2026-02-13",
      "sign": "Scorpio",
      "horoscope": "You might come across some unsettling news regarding global economic trends, causing concern for both you and those in your circle about financial stability. But hold on tight, Scorpio! Much of what you're hearing could be misleading. The reality ahead is likely to be much brighter than what the headlines suggest. In fact, you may discover that your own financial situation is on the verge of a positive transformation.",
      "horoscope_ja": "世界経済の動向に関する不安なニュースに遭遇し、あなた自身だけでなく周囲の人々の経済的な安定に不安を感じるかもしれません。でも、蠍座さん、しっかり耐えてください！耳にする情報の多くは誤解を招く可能性があります。現実は、ニュースの見出しが示唆するよりもはるかに明るいものになるでしょう。実際、あなた自身の経済状況が好転しつつあることに気づくかもしれません。"
    },
    "sagittarius": {
      "date": "2026-02-13",
      "sign": "Sagittarius",
      "horoscope": "Today’s gatherings with friends might feel a bit off, Sagittarius, as someone may share a surprising opinion or idea that catches you off guard. Keep in mind, this perspective is probably rooted in hearsay and speculation. It would be wise to encourage a deeper discussion to uncover the truth behind these claims. You may find that the reality is much more uplifting than what’s being suggested.",
      "horoscope_ja": "射手座の皆さん、今日の友人との集まりは少しぎこちない感じがするかもしれません。誰かが意外な意見やアイデアを出してきて、あなたを驚かせるかもしれません。しかし、こうした見方はおそらく噂や憶測に基づいているということを覚えておいてください。これらの主張の背後にある真実を明らかにするために、より深い議論を促すのが賢明でしょう。現実は、示唆されているよりもはるかに明るいものになるかもしれません。"
    },
    "capricorn": {
      "date": "2026-02-13",
      "sign": "Capricorn",
      "horoscope": "A close friend may start experiencing unusual symptoms that could lead to some anxiety. While it's always wise to seek medical advice, it's likely that a visit to the doctor will reveal that these issues stem from stress, excessive workload, or perhaps a bit too much indulgence in food or drink. So, there's no need for you to worry as well! You might find yourself making calls or running errands to help your friend take a breather.",
      "horoscope_ja": "親しい友人が、不安につながるようないつもと違う症状に悩まされるかもしれません。医師の診察を受けることは常に賢明ですが、医師の診察を受けることで、ストレス、過重労働、あるいは食べ過ぎや飲み過ぎなどが原因であることが判明する可能性が高いでしょう。ですから、あなたも心配する必要はありません！友人が息抜きできるように、電話をかけたり、用事を済ませたりしてあげてみてはいかがでしょうか。"
    },
    "aquarius": {
      "date": "2026-02-13",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, you may find that participating in group activities feels a bit uncomfortable. What starts as lively conversations could quickly escalate into heated disputes, clashing with your need for peace. Be cautious, as there may be a lot of mixed messages floating around, leading to misunderstandings and frayed tempers. If possible, consider staying in; however, if you do venture out, don’t hesitate to exit at the first hint of conflict. Continuing in such an environment is unlikely to yield any positive outcomes.",
      "horoscope_ja": "水瓶座のあなたは、今日、グループ活動に参加するのが少し居心地が悪いと感じるかもしれません。最初は活発な会話だったものが、あっという間に激しい口論に発展し、あなたの平和への欲求と衝突してしまう可能性があります。混乱したメッセージが飛び交い、誤解や感情の衝突を招く可能性があるため、注意が必要です。可能であれば、グループに留まることを検討してください。しかし、もしグループから抜け出す場合は、少しでも争いの兆候を感じたら、ためらわずに退出してください。そのような環境に留まっても、良い結果は得られないでしょう。"
    },
    "pisces": {
      "date": "2026-02-13",
      "sign": "Pisces",
      "horoscope": "Today, a member of your home may be feeling quite off, Pisces. They've come across some puzzling news that is likely misleading, leaving them uncertain about its implications. If they bring it up with you, your best course of action is to encourage them to stay calm until you can verify the details. The reality is likely to be far removed from the rumors you've all encountered.",
      "horoscope_ja": "うお座のあなた、今日はあなたの家族がかなり気分が落ち込んでいるかもしれません。彼らは、おそらく誤解を招くような不可解なニュースに遭遇し、その意味が分からなくなっているのです。もし彼らがあなたにそのことを話してきたら、詳細が確認できるまで落ち着くように促すのが最善の策です。現実は、あなたが耳にした噂とは大きく異なる可能性が高いでしょう。"
    }
  }
}