{
  "updated_at": "2025-12-16T16:35:39.370Z",
  "jst_date": "2025-12-17",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-17",
      "sign": "Aries",
      "horoscope": "Today, you may feel a surge of assertiveness, and this energy can actually work in your favor. A practical influence is guiding you to remain level-headed and realistic about various matters. Be cautious not to make commitments that you can't fulfill. Avoid being the overzealous salesperson who makes grand promises but ends up delivering nothing.",
      "horoscope_ja": "今日、あなたは自己主張の高まりを感じるかもしれません。そして、このエネルギーはむしろあなたの味方となるかもしれません。現実的な力が、様々な事柄において冷静で現実的な見方を保つよう導いています。果たせない約束はしないよう注意しましょう。壮大な約束をして結局何も実現しない、熱心すぎるセールスマンにはならないようにしましょう。"
    },
    "taurus": {
      "date": "2025-12-17",
      "sign": "Taurus",
      "horoscope": "Today brings a surge of emotional intensity. You might find yourself leading the charge, pushing boundaries and exploring new heights. Keep a guide close by, or you might find yourself lost in unfamiliar territory. Those around you will appreciate a practical perspective, as they seek a reliable foundation to support them during this period.",
      "horoscope_ja": "今日は感情の高まりが訪れます。あなたは先頭に立って行動し、限界を押し広げ、新たな高みを探求するかもしれません。身近に導き手を置いておかないと、未知の領域で迷子になってしまうかもしれません。周りの人々は、この時期を支えてくれる信頼できる基盤を求めているため、現実的な視点を高く評価するでしょう。"
    },
    "gemini": {
      "date": "2025-12-17",
      "sign": "Gemini",
      "horoscope": "Today is not the day to play it safe. You possess the skills and intuition needed to tackle nearly any challenge that comes your way. Trust your instincts to advance your projects, identify what needs attention, and assemble the necessary resources to kick things off. There's a bold energy within you, pushing you toward a significant achievement that will lead to a joyful celebration filled with feasting and merriment.",
      "horoscope_ja": "今日は安全策を取るべき日ではありません。あなたは、どんな困難にも立ち向かうために必要なスキルと直感を備えています。直感を信じてプロジェクトを進め、注意すべき点を見極め、必要なリソースを調達して、物事を軌道に乗せましょう。あなたの中には大胆なエネルギーが宿っており、大きな成果へと突き動かし、祝宴と歓喜に満ちた喜びに満ちた祝賀会へと導きます。"
    },
    "cancer": {
      "date": "2025-12-17",
      "sign": "Cancer",
      "horoscope": "Today, it's wise to practice restraint in your speech. While you may feel confident in your insights, remember that there could be aspects of the situation you haven't fully considered. The emotional intensity in the air could impact you and those around you significantly. Embrace the role of a listener rather than a speaker.",
      "horoscope_ja": "今日は、発言を控えるのが賢明です。自分の洞察力に自信があるかもしれませんが、状況を十分に考慮していない側面があるかもしれないことを忘れないでください。空気中の感情の激しさは、あなた自身だけでなく周囲の人々にも大きな影響を与える可能性があります。話すのではなく、聞く立場を大切にしましょう。"
    },
    "leo": {
      "date": "2025-12-17",
      "sign": "Leo",
      "horoscope": "Today, you might sense a nudge pushing you to take action, as a dynamic energy is in the air, prompting everyone to step up. Consider how your talents and keen insights can be harnessed to accomplish tasks with both efficiency and effectiveness.",
      "horoscope_ja": "今日は、ダイナミックなエネルギーがみなぎっており、誰もが一歩踏み出すよう促すような、行動を起こすための衝動を感じるかもしれません。あなたの才能と鋭い洞察力をどのように活かし、効率的かつ効果的にタスクを遂行できるかを考えてみましょう。"
    },
    "virgo": {
      "date": "2025-12-17",
      "sign": "Virgo",
      "horoscope": "Take a moment to center yourself and identify what truly resonates with your heart. Today, a strong energy is vying for your emotions, and without a clear understanding of your desires and feelings, you may find yourself swayed off course. Keep your feet on the ground, and you should navigate through the day just fine.",
      "horoscope_ja": "少し時間を取って、心を落ち着かせ、本当に心に響くものを見つけてください。今日は強いエネルギーがあなたの感情を奪い取ろうとしています。自分の願望や感情をしっかりと理解していないと、道から外れてしまうかもしれません。地に足をつけて、一日をうまく乗り越えていきましょう。"
    },
    "libra": {
      "date": "2025-12-17",
      "sign": "Libra",
      "horoscope": "Channel your assertiveness wisely today. This should come easily to you, as you have a clear grasp of what it takes to achieve success and complete tasks effectively. You're eager to kick off some projects, and you've laid the groundwork and done the necessary planning. Have confidence in your ability to move forward with clarity.",
      "horoscope_ja": "今日は、あなたの積極性を賢く発揮しましょう。成功を収め、効果的にタスクを完了するために必要なことをしっかりと理解しているので、これはあなたにとって容易なこととなるでしょう。いくつかのプロジェクトを始動させたい気持ちが強く、準備を整え、必要な計画を立ててきました。明確なビジョンを持って前進する能力に自信を持ってください。"
    },
    "scorpio": {
      "date": "2025-12-17",
      "sign": "Scorpio",
      "horoscope": "Today is not the time for idleness. You have a significant task at hand that requires your attention before you can indulge in any leisurely pursuits. Once you've tackled your responsibilities, the evening promises to be enjoyable and fulfilling, allowing you to unwind without any lingering worries.",
      "horoscope_ja": "今日は怠けてばかりいる暇はありません。気ままなことにふける前に、まずは集中しなければならない重要な仕事があります。責任を果たしたら、今夜はきっと楽しく充実した夜になり、余計な心配事に煩わされることなく、リラックスできるでしょう。"
    },
    "sagittarius": {
      "date": "2025-12-17",
      "sign": "Sagittarius",
      "horoscope": "Today, it's wise to manage your emotions carefully. You might find yourself feeling intense anger, which could lead to hurtful actions towards yourself and those nearby. Remember to embody humility and modesty throughout the day. By doing so, you'll cultivate a strong character that garners respect from others, including those in higher positions.",
      "horoscope_ja": "今日は感情を慎重にコントロールすることが賢明です。激しい怒りを感じ、自分自身や周りの人を傷つける行動につながる可能性があります。一日を通して謙虚さと慎み深さを体現することを忘れないでください。そうすることで、上司を含む周囲の人々から尊敬される強い人格を育むことができるでしょう。"
    },
    "capricorn": {
      "date": "2025-12-17",
      "sign": "Capricorn",
      "horoscope": "You might sense that someone is attempting to dampen your spirits today. Remember to stay true to yourself and your identity. If you encounter a negative influence from a person or situation, it's wise to distance yourself. Your happiness isn't dependent on pleasing everyone around you. Avoid sacrificing your own well-being in an effort to uplift others.",
      "horoscope_ja": "今日は誰かがあなたの気分を害そうとしていると感じるかもしれません。自分自身と自分のアイデンティティに忠実であり続けることを忘れないでください。もし誰かや状況からネガティブな影響を受けたら、距離を置くのが賢明です。あなたの幸せは、周りの人全員を喜ばせることに依存しているわけではありません。他人を元気づけようとして、自分の幸福を犠牲にしてはいけません。"
    },
    "aquarius": {
      "date": "2025-12-17",
      "sign": "Aquarius",
      "horoscope": "Today shines brightly for you! You'll find yourself achieving a great deal throughout the day, paving the way for a lively evening with friends. After you handle your responsibilities, don’t hesitate to indulge in some well-deserved fun. You’ve certainly earned the chance to let loose and celebrate. With a boost of confidence in your stride, go ahead and show the world what you’ve got!",
      "horoscope_ja": "今日はあなたにとって輝かしい一日になります！一日を通して多くのことを達成し、友人たちと賑やかな夜を過ごす準備が整うでしょう。責任を果たした後は、ためらわずに楽しい時間を満喫してください。きっと、思いっきり羽を伸ばして祝うチャンスがあなたにはあります。自信に満ちた歩みで、あなたの実力を世界に見せつけましょう！"
    },
    "pisces": {
      "date": "2025-12-17",
      "sign": "Pisces",
      "horoscope": "Today is all about finding your equilibrium and fostering a sense of peace. Before diving into the complexities of others' lives, take some time to release any pent-up energy. Create a comforting space for yourself where you can express your feelings—whether that means hitting a pillow, going for a brisk jog, or simply letting it all out. Once you've cleared your mind, you'll be ready to embrace the day's adventures with a revitalized perspective.",
      "horoscope_ja": "今日は、心の平静を取り戻し、心の平穏を育むことがすべてです。他人の人生の複雑な部分に飛び込む前に、少し時間を取って、溜まったエネルギーを解放しましょう。枕を叩いたり、軽めのジョギングに出かけたり、ただすべてを吐き出したりと、自分の気持ちを表現できる心地よい空間を作りましょう。心を落ち着かせれば、活力に満ちた視点で、その日の冒険を受け入れる準備が整います。"
    }
  }
}