{
  "updated_at": "2026-01-30T16:46:17.986Z",
  "jst_date": "2026-01-31",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-31",
      "sign": "Aries",
      "horoscope": "Although the broader patterns in your life may not align perfectly with your desires, Aries, today offers you a wealth of immediate joys to savor. Don't hesitate to treat yourself to experiences you might usually pass up. This is a prime moment to cultivate a deep and meaningful relationship with someone special. Dive into your passions and let them guide you to this enriching connection.",
      "horoscope_ja": "牡羊座さん、人生の大まかな流れがあなたの願望と完全に一致しないかもしれませんが、今日はすぐに味わえる喜びをたくさん味わえる日です。普段なら見逃してしまうような体験を、ためらわずに自分にご褒美として与えましょう。特別な人と深く意味のある関係を育む絶好の機会です。情熱に身を委ね、その導きに身を委ねて、豊かな繋がりを育んでください。"
    },
    "taurus": {
      "date": "2026-01-31",
      "sign": "Taurus",
      "horoscope": "Taurus, you might feel a strong urge to categorize aspects of your life today. However, when it comes to love and romance, this could prove challenging, particularly on a day like today. Embrace your adventurous side and explore new possibilities instead of sticking to your initial expectations. There could be something greater and more fulfilling just around the corner, but you’ll need to be open to experiences that break the mold.",
      "horoscope_ja": "おうし座のあなたは、今日は人生の様々な側面を分類したいという強い衝動に駆られるかもしれません。しかし、愛やロマンスに関しては、特に今日のような日は、それが難しいかもしれません。最初の期待に固執するのではなく、冒険心を受け入れ、新たな可能性を探求しましょう。もっと素晴らしい、もっと充実した何かがすぐそこに待っているかもしれません。しかし、型破りな経験を受け入れる心構えが必要です。"
    },
    "gemini": {
      "date": "2026-01-31",
      "sign": "Gemini",
      "horoscope": "Gemini, you might find yourself reminiscing about your junior high days, where the excitement of crushes and lively chats about relationships filled the air. Embrace this playful spirit by reaching out to your close friends who will delight in your youthful energy. Consider donning something red today as a symbol of the warmth and vibrancy of your affectionate heart.",
      "horoscope_ja": "ふたご座のあなたは、中学時代を懐かしむかもしれません。恋の興奮や、恋愛に関する活発な会話で溢れていたあの頃を。そんな遊び心を大切に、あなたの若々しいエネルギーを喜んでくれる親しい友人たちと交流してみましょう。今日は、あなたの愛情深い心の温かさと活力の象徴として、赤いものを身につけてみてはいかがでしょうか。"
    },
    "cancer": {
      "date": "2026-01-31",
      "sign": "Cancer",
      "horoscope": "Cancer, tread lightly when it comes to your social circle today. It's important to steer clear of those who are unreliable or changeable, particularly in romantic matters. Your heart is delicate and deserves better than the insensitivity and harshness that can come from the wrong company. Avoid pouring your emotions into people or situations that don't feel right.",
      "horoscope_ja": "蟹座のあなたは、今日は社交界では慎重に行動しましょう。特に恋愛においては、信頼できない人や変わりやすい人には近づかないようにすることが大切です。あなたの心は繊細なので、間違った付き合いからくる無神経さや冷酷さよりも、もっと良い関係を築くべきです。しっくりこない人や状況に感情をぶつけるのは避けましょう。"
    },
    "leo": {
      "date": "2026-01-31",
      "sign": "Leo",
      "horoscope": "A wave of good fortune is sweeping in for you, Leo, especially in the realm of love and romance! Today, you have every reason to feel elated about your heart's desires. If you're not feeling that joy, take a moment to reflect on who you’re sharing that happiness with. It might be time to reassess your connections. Embrace this day as an opportunity for joy!",
      "horoscope_ja": "獅子座のあなたに、特に愛とロマンスの面で幸運の波が押し寄せています！今日は、心の望みを叶え、高揚感を味わう絶好の機会です。もしその喜びを感じられないなら、その幸せを誰と分かち合っているのか、少し考えてみてください。もしかしたら、人間関係を見直す時期かもしれません。この日を喜びのチャンスとして捉えましょう！"
    },
    "virgo": {
      "date": "2026-01-31",
      "sign": "Virgo",
      "horoscope": "Love is blossoming around you, Virgo, and you can't help but notice couples strolling together, sharing affectionate looks. This might prompt you to reflect on your own romantic life. If you're considering reaching out to someone special, go for it! However, try not to set your expectations too high. Keeping your hopes in check will help you avoid any potential disappointments. Just relax and enjoy the moment.",
      "horoscope_ja": "おとめ座のあなた、周りには愛が芽生えています。カップルが一緒に散歩したり、愛情のこもった視線を交わしたりしているのを目にするでしょう。これは、あなた自身の恋愛生活を振り返るきっかけになるかもしれません。もし大切な人にアプローチしたいと考えているなら、ぜひ思い切って！ただし、期待しすぎないようにしましょう。期待をコントロールすることで、失望を避けられます。ただリラックスして、今この瞬間を楽しんでください。"
    },
    "libra": {
      "date": "2026-01-31",
      "sign": "Libra",
      "horoscope": "Your vibrant and energetic personality is what draws others to you, Libra. Expect to capture attention today as your social circle begins to recognize your remarkable abilities. Emphasize your strengths and let them shine in all your endeavors. Those around you will find you utterly charming. Tonight, you have a clear path for love and romance.",
      "horoscope_ja": "てんびん座さん、あなたの明るくエネルギッシュな性格は、周りの人を惹きつける魅力です。今日は、あなたの素晴らしい能力が周囲の人々に認められ始め、注目を集める日になるでしょう。自分の強みを強調し、あらゆる活動において輝かせましょう。周りの人々は、あなたを心から魅力的だと感じるでしょう。今夜、あなたは愛とロマンスへの明確な道を歩んでいます。"
    },
    "scorpio": {
      "date": "2026-01-31",
      "sign": "Scorpio",
      "horoscope": "Today might feel a bit sluggish and heavy for you, Scorpio. Despite a strong desire to be active, it may seem like an invisible burden is holding you back. While others are bustling about, take this time to observe and learn from their missteps. This way, when you’re ready to rise and shine, you’ll have the insights you need to navigate your own path. Rest assured, this feeling won’t last forever.",
      "horoscope_ja": "蠍座のあなたにとって、今日は少し重苦しく、気持ちが重く感じられるかもしれません。活動的になりたいという強い願望があるにもかかわらず、目に見えない重荷があなたを阻んでいるように感じるかもしれません。周りの人が忙しく動き回っている間、この時間を使って彼らの失敗を観察し、そこから学びましょう。そうすれば、あなたが目覚めて輝く準備ができた時に、自分の道を切り開くために必要な洞察を得ることができるでしょう。安心してください。この気持ちは永遠に続くわけではありません。"
    },
    "sagittarius": {
      "date": "2026-01-31",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you may find your heart racing with excitement. Romance is all around you—in the atmosphere, among the trees, and in the faces of those nearby. Be sure to dedicate your evening to someone dear to you. The potential for love is vast and vibrant today; even the tiniest gesture can flourish into something beautiful before your very eyes. Embrace the overwhelming feeling of being enveloped in love and connection with the world around you.",
      "horoscope_ja": "射手座のあなたは、今日、胸が高鳴るかもしれません。ロマンスはあなたの周りに満ち溢れています。空気の中に、木々の間から、そして近くにいる人々の表情の中に。大切な人に、この夜を捧げましょう。今日は愛の可能性が無限に広がり、活気に満ちています。ほんの些細な行為でさえ、あなたの目の前で美しいものへと花開くかもしれません。愛に包まれ、周りの世界と繋がっている圧倒的な感覚を味わいましょう。"
    },
    "capricorn": {
      "date": "2026-01-31",
      "sign": "Capricorn",
      "horoscope": "Capricorn, you may have experienced moments in your life where you felt like the odd one out, perhaps linked to your appearance or weight. Regardless of whether these feelings were rooted in reality or simply your own perceptions, it's time to let go of those negative thoughts. Embrace today as a celebration of self-love. Take pride in every aspect of who you are, both inside and out.",
      "horoscope_ja": "山羊座のあなたは、人生の中で、外見や体重のせいで、自分が浮いているように感じたことがあるかもしれません。それが現実に根ざしたものか、それとも単なる自分の思い込みだったかに関わらず、ネガティブな考えは手放すべき時です。今日を自己愛の祝福として受け止めましょう。内面も外面も、ありのままの自分のあらゆる側面に誇りを持ってください。"
    },
    "aquarius": {
      "date": "2026-01-31",
      "sign": "Aquarius",
      "horoscope": "Aquarius, prepare for a pivotal moment in your romantic encounters, as tensions may reach a boiling point. The individual you're up against possesses considerable passion and determination. Your strongest tools are your communication skills and your knack for understanding different perspectives. Remember, the trick is to maintain emotional distance, even if that proves to be a challenge.",
      "horoscope_ja": "水瓶座のあなたは、恋愛において重要な瞬間を迎える準備をしておきましょう。緊張が頂点に達するかもしれません。相手は並外れた情熱と決意の持ち主です。あなたの最大の武器は、コミュニケーション能力と、異なる視点を理解する才能です。たとえ困難に思えても、大切なのは感情的な距離を保つことです。"
    },
    "pisces": {
      "date": "2026-01-31",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, your intense feelings might be a bit overwhelming for those around you, particularly in your close relationships. If your goal isn't to make everyone think you've lost your mind, it might be wise to take a step back. Allow someone else to take charge today, and you could find yourself pleasantly surprised by the direction things take with that special someone.",
      "horoscope_ja": "魚座のあなた、今日はあなたの激しい感情が周りの人、特に親しい人たちを少し圧倒してしまうかもしれません。もしあなたが皆に正気を失ったと思わせるのが目的でなければ、少し距離を置くのが賢明かもしれません。今日は誰かに主導権を握らせてみれば、その大切な人との関係がどんな方向へ進むのか、嬉しい驚きを感じるかもしれません。"
    }
  }
}