{
  "updated_at": "2025-11-19T16:32:30.823Z",
  "jst_date": "2025-11-20",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-20",
      "sign": "Aries",
      "horoscope": "Romance is smiling upon you, but some obstacles might hinder you from fully embracing it. You may be overly selective in your search for the perfect partner. Remember, love isn't just about checking off boxes on a list. It's unrealistic to try to script how everything will unfold. Allow the journey to flow organically.",
      "horoscope_ja": "ロマンスはあなたに微笑みかけていますが、いくつかの障害がそれを完全に受け入れることを阻んでいるかもしれません。完璧なパートナーを探すのに、あまりにも選り好みしすぎているのかもしれません。愛とは、ただリストにチェックを入れていくことではないことを忘れないでください。すべてがどのように展開していくかを脚本化しようとするのは非現実的です。旅が自然に流れるように任せましょう。"
    },
    "taurus": {
      "date": "2025-11-20",
      "sign": "Taurus",
      "horoscope": "When you notice shifts or changes in your love life, your instinct might be to react strongly. However, this could lead you astray. Rather than rushing to conclusions, take a moment to breathe and allow events to develop at their own pace. It's best to hold off on taking any action today, even if your feelings are running high.",
      "horoscope_ja": "恋愛生活に変化や変化を感じた時、ついつい強く反応したくなるかもしれません。しかし、それが誤った判断につながる可能性もあります。結論を急ぐのではなく、少し息を整えて、物事が自然と進んでいくのを待ちましょう。たとえ感情が高ぶっていても、今日は行動を起こすのは控えた方が良いでしょう。"
    },
    "gemini": {
      "date": "2025-11-20",
      "sign": "Gemini",
      "horoscope": "In matters of love and romance, your emotions are being influenced by the chatter and judgments of those around you. What you wish to keep under wraps is being exposed by incessant gossip. Instead of getting tangled in the complexities of others' opinions, embrace the more sensual side of love and allow yourself to enjoy the moment.",
      "horoscope_ja": "恋愛においては、周囲のおしゃべりや批判に感情が左右されています。隠したいと思っていたことが、絶え間ない噂話によって露呈してしまいます。他人の複雑な意見に巻き込まれるのではなく、愛のより官能的な側面を受け入れ、今この瞬間を心から楽しみましょう。"
    },
    "cancer": {
      "date": "2025-11-20",
      "sign": "Cancer",
      "horoscope": "You may find that some aspects of your life are growing at a swift pace, leading you to neglect the more affectionate side of things. As you strive for success in one area, you might feel a sense of loss in another. It could be beneficial to reassess where you direct your efforts. Now is the moment to concentrate on the areas that are thriving, rather than fixating on those that seem stagnant.",
      "horoscope_ja": "人生のある側面が急速に成長し、より愛情深い側面をないがしろにしていることに気づくかもしれません。ある分野で成功を目指すあまり、別の分野で喪失感を感じることもあるかもしれません。努力の方向性を見直すのも良いかもしれません。今こそ、停滞しているように見える分野に固執するのではなく、成長している分野に集中すべき時です。"
    },
    "leo": {
      "date": "2025-11-20",
      "sign": "Leo",
      "horoscope": "It's your moment to step into the spotlight when it comes to love and romance. Typically, you prefer to let others steer the ship in this area, but now a fresh chapter is unfolding in your romantic journey. Consider branching out and exploring new connections and experiences. Embrace this opportunity to take the reins and shape your love life as you desire.",
      "horoscope_ja": "愛とロマンスにおいて、今こそあなたがスポットライトを浴びる時です。普段は、この分野では他人に舵取りを任せがちですが、今、あなたの恋愛の旅に新たな章が幕を開けます。新しい出会いや経験を探求し、視野を広げてみましょう。この機会を捉えて、自ら舵を取り、思い通りの恋愛を実現しましょう。"
    },
    "virgo": {
      "date": "2025-11-20",
      "sign": "Virgo",
      "horoscope": "When it comes to matters of the heart, you might find yourself in a more passive role. This isn't a negative stance at all; in fact, it can be quite beneficial. By allowing things to unfold naturally and letting someone else take the initiative, you can focus more on your own needs and desires rather than expending your energy on others.",
      "horoscope_ja": "恋愛関係になると、あなたはより受動的な立場に陥るかもしれません。これは決してネガティブな姿勢ではなく、むしろ有益な場合があります。物事が自然に展開していくのを待ち、誰かに主導権を握らせることで、他人にエネルギーを費やすのではなく、自分のニーズや欲求にもっと集中できるようになります。"
    },
    "libra": {
      "date": "2025-11-20",
      "sign": "Libra",
      "horoscope": "Romance is likely to take on a more passionate tone today. Think about creative ways to indulge your beloved and make them feel cherished. While you might encounter some chatter about your relationship that initially puts you off, don’t allow it to hinder your ability to share your genuine emotions. The most meaningful exchanges in your partnership will happen beyond words.",
      "horoscope_ja": "今日はロマンスがより情熱的な雰囲気になりそうです。愛する人を甘やかし、大切にされていると感じさせる創造的な方法を考えてみましょう。二人の関係についてのおしゃべりに最初はうんざりするかもしれませんが、それを理由に心からの気持ちを伝えるのを諦めないでください。二人のパートナーシップにおいて最も意味のある交流は、言葉を超えたものになるでしょう。"
    },
    "scorpio": {
      "date": "2025-11-20",
      "sign": "Scorpio",
      "horoscope": "Your thoughts are likely soaring to new heights today, and you may find that various aspects of your life are aligning in your favor. Your knack for multitasking and adaptability will make handling responsibilities feel effortless. However, when it comes to matters of the heart, things might not flow as smoothly. You may struggle to connect with a significant other on a deeper level, while conversing with unfamiliar faces could feel surprisingly easier!",
      "horoscope_ja": "今日は思考が新たな高みへと舞い上がり、人生の様々な側面があなたに有利に働いていることに気づくかもしれません。マルチタスク能力と適応力に長けているため、責任ある仕事も苦もなくこなせるでしょう。しかし、恋愛となると、物事がスムーズに進まないかもしれません。大切な人と深いレベルで繋がるのに苦労する一方で、見知らぬ人との会話は驚くほどスムーズに感じられるかもしれません。"
    },
    "sagittarius": {
      "date": "2025-11-20",
      "sign": "Sagittarius",
      "horoscope": "Keep your hopes alive in your quest for the ideal romantic partner, as the universe is presenting you with a golden opportunity. Conversations are encouraging you to make a move. However, be prepared for some initial tension that might hold you back from diving in completely. Stay patient. Once you dig deeper, you'll discover that this individual has layers that go far beyond first impressions.",
      "horoscope_ja": "理想の恋人探しの旅に希望を持ち続けましょう。宇宙があなたに絶好の機会を与えています。会話はあなたに行動を促しています。しかし、最初は緊張し、完全に飛び込むのをためらってしまうかもしれません。辛抱強く待ってください。深く掘り下げていくと、この人には第一印象をはるかに超える奥深さがあることに気づくでしょう。"
    },
    "capricorn": {
      "date": "2025-11-20",
      "sign": "Capricorn",
      "horoscope": "Exercise caution before professing your feelings for someone, especially if you haven't invested sufficient time getting to know them. Your urge to express love might stem from fleeting interactions and short chats. Without a solid foundation of shared experiences or meaningful conversations, you might not truly understand if this person is as perfect for you as you believe. Remember, appearances and smooth talk can be deceiving.",
      "horoscope_ja": "誰かに自分の気持ちを伝える前に、特に十分な時間をかけて相手を知り合っていない場合は、慎重に行動しましょう。愛情表現への衝動は、束の間のやり取りや短い会話から生まれるかもしれません。共有した経験や有意義な会話という確固たる基盤がなければ、その人が本当に自分にぴったりの人なのか、本当に理解できないかもしれません。外見や巧みな言葉遣いは人を欺くことがあるということを忘れないでください。"
    },
    "aquarius": {
      "date": "2025-11-20",
      "sign": "Aquarius",
      "horoscope": "Romantic matters could reach a peak today, signaling a pivotal moment in your relationship journey. You might experience an unexpected lapse in communication, or perhaps you'll come to the realization that your emotional dependence on this person is greater than you initially believed. If you're currently single, take this time to appreciate your independence—it’s a favorable phase for self-reflection.",
      "horoscope_ja": "今日は恋愛がピークに達し、交際の重要な局面を迎える可能性があります。予期せぬ連絡の途絶を経験したり、相手への感情的な依存度が当初考えていた以上に高いことに気づいたりするかもしれません。もし現在独身なら、この機会に自分の自立を感謝しましょう。自己を振り返るのに絶好のタイミングです。"
    },
    "pisces": {
      "date": "2025-11-20",
      "sign": "Pisces",
      "horoscope": "You might find yourself attracted to someone who shares your interests in art, music, and candlelit dinners. However, be cautious, as this individual may not be the ideal long-term partner. They might hesitate to take initiative or struggle with making key decisions. If you're currently single, seek out someone who can match your sharp intellect and isn't shy about taking the lead.",
      "horoscope_ja": "芸術、音楽、キャンドルライトディナーなど、共通の趣味を持つ人に惹かれるかもしれません。しかし、そのような人は長期的なパートナーとして理想的ではないかもしれないので、注意が必要です。率先して行動することをためらったり、重要な決断を下すのに苦労したりするかもしれません。もしあなたが現在独身なら、鋭い知性を持ち、率先して行動することをためらわない人を探しましょう。"
    }
  }
}