{
  "updated_at": "2026-02-10T02:00:13.025Z",
  "jst_date": "2026-02-10",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-10",
      "sign": "Aries",
      "horoscope": "Today, Aries, you may find that success and positive vibes are on the horizon. Whatever unfolds is likely to fill you with joy and a sense of achievement. You might feel the urge to share your good news with everyone, but be aware that some of your loved ones may be out of reach. It’s best to wait until you can connect with those nearest to you before sharing your triumphs, as their support will be invaluable.",
      "horoscope_ja": "牡羊座のあなたは、今日、成功とポジティブな兆しが目の前に迫っていることに気づくかもしれません。どんな出来事が起ころうとも、あなたは喜びと達成感に満たされるでしょう。良い知らせをみんなに伝えたくなるかもしれませんが、大切な人の中には、連絡が取れない人がいるかもしれないので、その点に注意してください。成功を分かち合うのは、最も身近な人たちと繋がれるまで待つのが賢明です。彼らの支えは、かけがえのない支えとなるでしょう。"
    },
    "taurus": {
      "date": "2026-02-10",
      "sign": "Taurus",
      "horoscope": "Taurus, you've been riding a wave of success lately, and while that's fantastic, be cautious of going overboard with celebrations and indulgences today. You might find yourself feeling a bit off physically as a result. However, your spirits remain high, and your drive to pursue your recent achievements is still strong. Embrace your creativity and keep pushing forward!",
      "horoscope_ja": "おうし座さん、最近は成功の波に乗っていますね。素晴らしいことですが、今日はお祝い事や贅沢のしすぎにはご注意ください。体調が少し悪くなるかもしれません。しかし、気持ちは高揚しており、最近の成果を追い求める意欲は依然として強いです。創造性を活かして、前進し続けてください！"
    },
    "gemini": {
      "date": "2026-02-10",
      "sign": "Gemini",
      "horoscope": "You may find yourself facing some turbulence within a group you’re part of, possibly in your work life, Gemini. This might prompt you to adjust your aspirations a bit. While the circumstances may feel unsettling at first, they could ultimately lead to beneficial changes. Embrace this as a chance to explore fresh ambitions and dreams that you hadn’t thought of before. Take the time to strategize, and then aim high!",
      "horoscope_ja": "ふたご座のあなたは、所属するグループ、おそらく仕事関係で、何らかの混乱に直面するかもしれません。これは、あなたの願望を少し調整するきっかけになるかもしれません。最初は不安に感じる状況かもしれませんが、最終的には有益な変化につながる可能性があります。これを、これまで考えたことのない新たな野心や夢を探求するチャンスと捉えましょう。時間をかけて戦略を練り、高い目標を目指しましょう！"
    },
    "cancer": {
      "date": "2026-02-10",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you may encounter a variety of individuals from intriguing professions like law, education, or the literary world. Whether through your work or at a social gathering you host, these connections could bring forth captivating insights that inspire a shift in your perspective. Embrace this opportunity to learn and grow—make the most of it and enjoy the experience!",
      "horoscope_ja": "蟹座のあなたは今日、法律、教育、文学など、興味深い職業の様々な人々と出会うかもしれません。仕事を通してでも、あなたが主催する社交の場でも、こうした繋がりは、あなたの視点を変えるような魅力的な洞察をもたらすかもしれません。学びと成長の機会を大切に、最大限に活用し、この経験を楽しんでください！"
    },
    "leo": {
      "date": "2026-02-10",
      "sign": "Leo",
      "horoscope": "Today, Leo, you might find an unexpected opportunity to embark on a lengthy journey, possibly to a far-off state or even a foreign land. This adventure is likely to hold more weight than just a leisurely getaway; it could be tied to your career, offer a chance for educational growth, or even touch upon a personal relationship. No matter the reason, it seems you're destined to take this trip, and it’s likely to bring about transformative changes in your life, even if they are subtle.",
      "horoscope_ja": "獅子座さん、今日は思いがけず長旅に出る機会に恵まれるかもしれません。もしかしたら、遠く離れた州や外国へ旅立つかもしれません。この冒険は、単なる気楽な小旅行以上の意味を持つでしょう。キャリアに繋がったり、教育面での成長の機会になったり、あるいは個人的な人間関係に変化をもたらしたりするかもしれません。理由は何であれ、あなたはこの旅に出ることを運命づけられているようです。そして、たとえそれがささやかなものであっても、人生に劇的な変化をもたらすでしょう。"
    },
    "virgo": {
      "date": "2026-02-10",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you may find that some old traumas, fears, or emotional baggage that have been holding you back rise to the forefront of your mind. Pay close attention to your dreams, as they could offer valuable insights. This process of revelation might be so intense that you’ll need some solitude, possibly stepping away from your usual surroundings, to fully process everything. By day’s end, you should feel a sense of joy and clarity, as you’ll have a clearer path to overcoming some of your challenges.",
      "horoscope_ja": "乙女座のあなたは今日、あなたを阻んできた過去のトラウマ、恐怖、あるいは感情的な重荷が、心の奥底に浮かび上がってくるかもしれません。夢に注意深く耳を傾けてください。貴重な洞察を与えてくれるかもしれません。この啓示のプロセスは非常に強烈なので、すべてを完全に理解するためには、少しの孤独、場合によってはいつもの環境から離れることが必要になるかもしれません。一日の終わりには、喜びと明晰さを感じるでしょう。いくつかの課題を克服するためのより明確な道筋が見えてくるでしょう。"
    },
    "libra": {
      "date": "2026-02-10",
      "sign": "Libra",
      "horoscope": "You may find yourself inspired by the passion and allure of romantic stories and films today, Libra. There's a strong desire to carve out some intimate time with your partner. However, prior social commitments, possibly tied to work, could interfere with your plans. These obligations may have been arranged quite some time ago, and it might take longer than you anticipated to reconnect with your loved one. Remember, even if it's delayed, the reunion will still be worthwhile!",
      "horoscope_ja": "天秤座のあなたは、今日、ロマンチックな物語や映画の情熱と魅力に心を奪われるかもしれません。パートナーと親密な時間を過ごしたいという強い願望があります。しかし、仕事など、すでに予定が決まっている社交上の約束が、あなたの計画を邪魔するかもしれません。これらの約束は、かなり前に取り決められていた場合もあり、愛する人との再会には予想以上に時間がかかるかもしれません。たとえ遅れても、再会は必ず価値のあるものになることを覚えておいてください！"
    },
    "scorpio": {
      "date": "2026-02-10",
      "sign": "Scorpio",
      "horoscope": "Scorpio, if you've been feeling a bit off lately, today marks a refreshing turn for you. You'll likely experience a surge of vitality, both physically and mentally, leaving you ready to tackle whatever comes your way. With your energy at a peak, now is the perfect time to dive into both your short-term and long-term aspirations. Don’t hesitate—start making progress today! This burst of enthusiasm is set to last, so seize the moment!",
      "horoscope_ja": "蠍座のあなた、もし最近少し調子が悪かったなら、今日はあなたにとって新たな転機となるでしょう。心身ともに活力が湧き上がり、どんな困難にも立ち向かう準備が整うでしょう。エネルギーがピークに達している今こそ、短期的な目標と長期的な目標の両方に取り組む絶好の機会です。ためらわずに、今日から一歩踏み出しましょう！この情熱の爆発は長く続くでしょう。この瞬間を逃さず掴みましょう！"
    },
    "sagittarius": {
      "date": "2026-02-10",
      "sign": "Sagittarius",
      "horoscope": "Sagittarius, today you may find yourself craving a pause from your usual routine, yearning for a cozy evening with your significant other. Your senses are heightened, and passion is in the air, but you also have exciting news about fresh opportunities that have emerged. If you take action on these prospects, they could significantly transform your life. It's important to involve your partner in this discussion, as it affects them too. Be thoughtful with your words and ignite that enthusiasm!",
      "horoscope_ja": "射手座のあなたは、今日、いつものルーティンから少し離れて、大切な人と過ごす心地よい夜を切望しているかもしれません。感覚が研ぎ澄まされ、情熱が溢れていますが、同時に、新たなチャンスが舞い込むというワクワクするニュースも届いています。これらの可能性に行動を起こせば、あなたの人生は大きく変わるかもしれません。この話し合いはパートナーにも影響を与えるので、パートナーを巻き込むことが重要です。言葉選びに気を配り、情熱を燃え上がらせましょう！"
    },
    "capricorn": {
      "date": "2026-02-10",
      "sign": "Capricorn",
      "horoscope": "Today, you might find yourself hosting some unexpected guests from afar, bringing a whirlwind of activity to your home. While their arrival may stir up a bit of disorder, Capricorn, their exciting news and intriguing stories will surely brighten your day. You'll feel inspired to connect them with friends who share your passions, which could lead to a delightful, albeit chaotic, atmosphere. Embrace the mess and enjoy a lively evening filled with social interactions!",
      "horoscope_ja": "今日は、遠くから予期せぬ来客がやって来て、家の中が大騒ぎになるかもしれません。山羊座のあなた、来客は少し混乱を招くかもしれませんが、彼らのワクワクするニュースや興味深い話はきっとあなたの一日を明るくしてくれるでしょう。彼らと、同じ情熱を持つ友人たちを繋ぎたくなるでしょう。それは、混沌としながらも楽しい雰囲気につながるかもしれません。その混乱を受け入れ、交流に満ちた活気あふれる夜を楽しみましょう！"
    },
    "aquarius": {
      "date": "2026-02-10",
      "sign": "Aquarius",
      "horoscope": "You might stumble upon some intriguing news today, possibly from local publications, regarding upcoming renovations in your neighborhood. These developments could stir up quite a bit of debate, Aquarius, so brace yourself for a flurry of chatter and mixed opinions surrounding the issue. It would be wise to investigate the details further before settling on your own viewpoint. This exploration could lead to some valuable insights!",
      "horoscope_ja": "今日は、おそらく地元の新聞などで、ご近所の改修工事に関する興味深いニュースを目にするかもしれません。水瓶座の皆さん、こうした動きは大きな議論を巻き起こす可能性があります。この問題をめぐっては、激しい議論や様々な意見が飛び交うことを覚悟しておきましょう。ご自身の見解を固める前に、詳細をさらに調べておくのが賢明です。この調査によって、貴重な洞察が得られるかもしれません。"
    },
    "pisces": {
      "date": "2026-02-10",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, if you've been working hard to make your mark in writing, speaking, or publishing, a significant breakthrough could be on the horizon. You might encounter a lucrative opportunity or a substantial financial gain in these areas, and it's essential to seize it. Be prepared for potential legal documents, like contracts, to be part of the process. This development will surely elevate your spirits, enhance your confidence, and ignite your drive.",
      "horoscope_ja": "魚座のあなた、もしあなたが今日、執筆、講演、出版などで成功を収めようと努力してきたなら、大きな飛躍が間近に迫っているかもしれません。これらの分野で、大きな利益を得られるチャンスや、多額の金銭的利益に出会うかもしれません。それを逃さず掴み取ることが重要です。契約書などの法的文書の作成が必要になる可能性もあるので、覚悟しておきましょう。この進展は、きっとあなたの気分を高め、自信を高め、意欲を掻き立てるでしょう。"
    }
  }
}