{
  "updated_at": "2026-02-20T16:16:02.687Z",
  "jst_date": "2026-02-21",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-02-21",
      "sign": "Aries",
      "horoscope": "Aries, you're on the brink of financial abundance, thanks to the savvy money-management skills you've recently developed. A financial boost is on the horizon, though it might not feel like a surprise since you've been anticipating this influx for quite some time. Put your newfound expertise to good use by making smart investments. The outcomes you see in the long run are sure to bring you satisfaction.",
      "horoscope_ja": "牡羊座のあなたは、最近身につけた賢いお金の管理スキルのおかげで、経済的に豊かになろうとしています。経済的な豊かさは間近に迫っていますが、この流れをずっと待ち望んでいたため、驚きではないかもしれません。新たに身につけた知識を賢く活用し、賢い投資を行いましょう。長期的には、必ず満足感をもたらす結果が得られるでしょう。"
    },
    "taurus": {
      "date": "2026-02-21",
      "sign": "Taurus",
      "horoscope": "Your partner is in need of your understanding rather than a stern talk today, Taurus. Show them that you’re there to listen and offer assistance, but be careful not to overwhelm them with your affection. They will reach out when they feel prepared. Meanwhile, focus on your own well-being. If you feel the urge to move, consider extending your jogging distance or adding some extra time at the gym. Remember, sometimes a little space can deepen your connection.",
      "horoscope_ja": "おうし座さん、今日、パートナーは厳しい言葉よりも理解を求めています。耳を傾け、支える気持ちを示しましょう。ただし、愛情表現で相手を圧倒しないように注意してください。相手も心の準備ができたら、手を差し伸べてくれるでしょう。その間、あなた自身の健康にも気を配りましょう。体を動かしたい衝動に駆られたら、ジョギングの距離を延ばしたり、ジムでの時間を少し増やしたりしてみましょう。少し距離を置くことで、二人の絆が深まることもあることを忘れないでください。"
    },
    "gemini": {
      "date": "2026-02-21",
      "sign": "Gemini",
      "horoscope": "Gemini, today marks the crucial moment to wrap up a major project that you've been dedicated to for quite a while. While your name may not appear on the title page or the business plan, take pride in the vital part you've contributed to its success. Remember to fuel your body with a healthy breakfast and lunch, as you might find yourself so engrossed in your work that you skip dinner altogether.",
      "horoscope_ja": "ふたご座のあなた、今日は長年取り組んできた大規模プロジェクトを締めくくる正念場です。タイトルページや事業計画書にあなたの名前は載らないかもしれませんが、成功に大きく貢献したことを誇りに思ってください。仕事に夢中になりすぎて夕食を抜いてしまうこともあるので、健康的な朝食と昼食で体力をしっかり蓄えましょう。"
    },
    "cancer": {
      "date": "2026-02-21",
      "sign": "Cancer",
      "horoscope": "An enjoyable outing may face a setback or even be called off due to circumstances beyond your influence. Instead of getting upset, Cancer, why not embrace the moment with your friends and embark on an unexpected adventure? Consider catching a matinee of the most thrilling horror film in town or finally sampling that Ethiopian restaurant you've been curious about. Today is an ideal chance to turn a setback into something exciting!",
      "horoscope_ja": "楽しい外出が、あなたの力ではどうしようもない事情で頓挫したり、中止になったりするかもしれません。蟹座さん、落ち込むのではなく、友達とこの瞬間を楽しみ、思いがけない冒険に出かけてみませんか？街で一番スリリングなホラー映画の昼公演を観たり、ずっと気になっていたエチオピア料理のレストランについに足を運んでみたり。今日は、この挫折を刺激的なものに変える絶好のチャンスです！"
    },
    "leo": {
      "date": "2026-02-21",
      "sign": "Leo",
      "horoscope": "Leo, it's clear that you've been putting in a tremendous amount of effort lately. With a deadline on the horizon, you might catch yourself tossing and turning at night, calculating figures and reworking your project plans in your mind. It can be draining, no doubt, but remember that the outcome will justify all the stress and hard work you've invested.",
      "horoscope_ja": "レオ、最近はものすごく頑張っているみたいですね。締め切りが迫っているので、夜中に寝返りを打ちながら数字を計算したり、頭の中でプロジェクト計画を練り直したりしているかもしれませんね。確かに疲れるかもしれませんが、そのストレスと努力は必ず報われることを忘れないでください。"
    },
    "virgo": {
      "date": "2026-02-21",
      "sign": "Virgo",
      "horoscope": "This evening, Virgo, is all about love and warm closeness. You're going all out to create a magical night with your beloved. With fragrant candles, your favorite fragrance, and your most alluring outfit, you're sure to captivate the heart of someone who is already smitten with you. Your connection is thriving beautifully at the moment. Why not take a moment to celebrate this wonderful bond in a unique way?",
      "horoscope_ja": "乙女座さん、今夜は愛と温かい親密さが溢れる夜です。愛する人と魔法のような夜を過ごすために、全力を尽くしましょう。香りの良いキャンドル、お気に入りのフレグランス、そして最高に魅力的な装いで、すでにあなたに夢中になっている人の心を掴むことは間違いありません。二人の絆は今、美しく成長しています。この素晴らしい絆を、少し特別な方法で祝ってみませんか？"
    },
    "libra": {
      "date": "2026-02-21",
      "sign": "Libra",
      "horoscope": "Libra, you may soon encounter some intriguing chances to boost your income, whether today or in the days ahead. It seems like the perfect moment to consider a new job that offers quicker advancement and greater financial security. As you mature, the allure of commission-based work tends to fade. You're now in search of consistent growth in your financial portfolio. It might be wise to consult a financial advisor to explore actionable steps you can take right now to enhance your financial situation.",
      "horoscope_ja": "天秤座のあなたは、今日か将来、収入を増やす魅力的なチャンスに出会うかもしれません。より早く昇進し、より安定した経済的な安定が得られる新しい仕事を検討するには絶好の機会と言えるでしょう。年齢を重ねるにつれて、歩合制の仕事の魅力は薄れていくものです。あなたは今、資産ポートフォリオの着実な成長を求めています。ファイナンシャルアドバイザーに相談し、今すぐ実行できる具体的な対策を検討してみるのも良いでしょう。"
    },
    "scorpio": {
      "date": "2026-02-21",
      "sign": "Scorpio",
      "horoscope": "Today may present a hefty to-do list that could leave you feeling a bit intimidated at the outset. By noon, you might find the weight of it all quite overwhelming. It's essential to pause, Scorpio. If the weather allows, treat yourself to a leisurely lunch on a terrace. Take deep breaths to help ease the tension. Focus on completing just one or two small tasks today, and consider postponing the rest for another day. Keep in mind that excessive stress can impact your well-being!",
      "horoscope_ja": "今日はやるべきことが山積みで、最初は少し気が重くなるかもしれません。正午頃には、その重圧に押しつぶされそうになるかもしれません。蠍座のあなた、少し立ち止まってみてください。天気が良ければ、テラスでゆったりとランチを楽しんでください。深呼吸をして、緊張を和らげましょう。今日は小さなタスクを1つか2つ終わらせることに集中し、残りは別の日に延期することを検討しましょう。過度のストレスは健康に影響を与えることを覚えておきましょう！"
    },
    "sagittarius": {
      "date": "2026-02-21",
      "sign": "Sagittarius",
      "horoscope": "As soon as you arrive at work this morning, Sagittarius, you'll find yourself bombarded with a flurry of challenges and issues. It's not the warm welcome you were hoping for. A comforting cup of coffee and friendly smiles from your colleagues would certainly make for a better start. However, keep your cool. You possess the intellect and resilience needed to tackle everything that comes your way today.",
      "horoscope_ja": "射手座のあなたは、今朝職場に着いた途端、次々と課題や問題に直面するでしょう。期待していたような温かい歓迎ではありません。心地よい一杯のコーヒーと同僚の温かな笑顔があれば、きっと良いスタートを切れるでしょう。しかし、冷静さを保ってください。あなたは今日直面するあらゆる困難に立ち向かうために必要な知性と粘り強さを備えています。"
    },
    "capricorn": {
      "date": "2026-02-21",
      "sign": "Capricorn",
      "horoscope": "Today promises a delightful blend of balance and fervor, Capricorn. Seize the opportunity! With work flowing effortlessly, consider wrapping up early to set the stage for a memorable night with your significant other. Go all out this evening—think aromatic candles, a sumptuous dinner, and a stunning outfit. And don’t forget a decadent dessert, even if it might end up untouched!",
      "horoscope_ja": "山羊座さん、今日はバランスと情熱が絶妙に融合した素晴らしい日です。チャンスを掴みましょう！仕事はスムーズに進むので、早めに切り上げて、大切な人との思い出に残る夜を準備してみてはいかがでしょうか。今夜は思いっきり楽しみましょう。アロマキャンドル、豪華なディナー、そして素敵な装い。そして、たとえ食べられなくても、贅沢なデザートもお忘れなく！"
    },
    "aquarius": {
      "date": "2026-02-21",
      "sign": "Aquarius",
      "horoscope": "Aquarius, your hard work at home has truly borne fruit! Your space is looking fantastic, and everyone who walks through your door can't help but notice. Be prepared for some surprise guests who might pop in for a brief visit but end up lingering for dinner. With your innate hospitality and culinary skills, it's no wonder they want to stick around!",
      "horoscope_ja": "水瓶座さん、家事の頑張りが実を結びました！お部屋は素晴らしく、訪れる人すべてがその魅力に気付かされるでしょう。ちょっとしたお出かけに訪れたものの、結局夕食まで長居してしまうような、予期せぬ来客が現れるかもしれません。持ち前のおもてなしの心と料理の腕前なら、きっと長居したくなるはずです！"
    },
    "pisces": {
      "date": "2026-02-21",
      "sign": "Pisces",
      "horoscope": "Pisces, your local environment is undergoing a delightful transformation, and it's all positive! You might find that charming new neighbors have settled in, or a delightful gourmet take-out spot has just opened its doors. These changes enhance the cozy, community spirit of your area. Expect to spend a significant portion of your day mingling with your neighbors, bumping into them as you go about your errands around town.",
      "horoscope_ja": "魚座さん、あなたの住む地域は素晴らしい変化を遂げつつあり、それはすべて良い方向へ向かっています！魅力的な新しい隣人が引っ越してきたり、美味しいテイクアウトのお店がオープンしたりするかもしれません。こうした変化は、あなたの地域の居心地の良いコミュニティ精神をさらに高めてくれるでしょう。街中で用事を済ませる際に、ご近所の方々と偶然出会うなど、一日の大半を交流しながら過ごすことになるでしょう。"
    }
  }
}