{
  "updated_at": "2025-12-12T16:31:42.282Z",
  "jst_date": "2025-12-13",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-13",
      "sign": "Aries",
      "horoscope": "You may find yourself overwhelmed by a flurry of messages related to a project or family matters, leaving you feeling a bit disoriented. With so many pressing issues converging at once, it’s easy to feel confused. Remember to tackle each concern individually rather than trying to juggle them all at once. Today, your mind is sharp and methodical. Embrace the rhythm of the day, and everything will fall into place.",
      "horoscope_ja": "プロジェクトや家族のことに関する大量のメッセージに圧倒され、少し混乱してしまうかもしれません。差し迫った問題が一度に山積みになると、混乱してしまいがちです。一度に全てを処理しようとせず、一つ一つの問題に個別に対処しましょう。今日は頭が冴え、計画的に行動できます。一日のリズムを受け入れれば、すべてがうまくいくでしょう。"
    },
    "taurus": {
      "date": "2025-12-13",
      "sign": "Taurus",
      "horoscope": "Exciting financial news may spark a flurry of ideas on how to invest in your living space. Whether it's upgrading your furniture or refreshing your walls with a new coat of paint, now is an excellent opportunity to make those changes. Just remember to stay grounded and avoid letting your enthusiasm lead to hasty decisions. You wouldn't want to end up repainting or returning items that don't fit your vision.",
      "horoscope_ja": "刺激的な経済ニュースは、住空間への投資について様々なアイデアを刺激するかもしれません。家具のアップグレードでも、壁の塗り替えでも、今こそ変化を起こす絶好の機会です。ただし、冷静な判断を心がけ、熱意に駆られて性急な決断をしないようにしましょう。塗り直したり、イメージに合わないものを返品したりする羽目になるのは避けたいものです。"
    },
    "gemini": {
      "date": "2025-12-13",
      "sign": "Gemini",
      "horoscope": "Your intellect is keen and poised to tackle any challenges that arise. Those close to you, whether family or friends, may sense your readiness and seek your guidance. Expect to offer plenty of support today, so gear up for that. You might find paperwork to be a bit daunting, but remember to approach it gradually, and you'll manage to complete everything.",
      "horoscope_ja": "あなたの知性は鋭敏で、どんな困難にも立ち向かう準備ができています。家族や友人など、身近な人たちはあなたの準備の準備ができていることを察知し、導きを求めるかもしれません。今日は多くのサポートが期待できるので、そのための準備を整えておきましょう。書類作成は少し大変に感じるかもしれませんが、徐々に進めていけば、すべて完了できるでしょう。"
    },
    "cancer": {
      "date": "2025-12-13",
      "sign": "Cancer",
      "horoscope": "Today, you may find yourself deeply engrossed in literature related to the psychic, spiritual, or metaphysical realms. The temptation to abandon your daily responsibilities in favor of diving into these intriguing reads and sharing your newfound insights with friends might be strong. However, it's wise to hold off on those calls until later in the evening. Your sense of duty is strong, and you wouldn't want to neglect your work, as it would leave you feeling unfulfilled.",
      "horoscope_ja": "今日は、超自然的、霊的、あるいは形而上学的な領域に関する書物に深く没頭しているかもしれません。日々の責任を放棄して、これらの興味深い書物に没頭し、そこで得た新たな洞察を友人と共有したいという誘惑に駆られるかもしれません。しかし、そのような電話は夜遅くまで控えるのが賢明です。あなたは強い義務感を持っており、仕事の怠慢は避けたいでしょう。そうすると、満たされない気持ちになってしまうからです。"
    },
    "leo": {
      "date": "2025-12-13",
      "sign": "Leo",
      "horoscope": "A goal you've recently established may feel a bit daunting, leaving you questioning your ability to achieve it. While distractions may tempt you, it's important to harness your focus and channel your energy into this task right now. Additionally, your finances might require some care, along with a bit of paperwork, but rest assured, this is just standard maintenance.",
      "horoscope_ja": "最近立てた目標は、少し大変に感じられ、達成できるかどうか自信が持てないかもしれません。気が散ってしまう誘惑に駆られるかもしれませんが、今は集中力を高め、この目標にエネルギーを注ぐことが重要です。また、お金の管理や書類手続きにも多少の手間がかかるかもしれませんが、ご安心ください。これらは通常のメンテナンスに過ぎません。"
    },
    "virgo": {
      "date": "2025-12-13",
      "sign": "Virgo",
      "horoscope": "Today, a wave of optimism and enthusiasm will wash over you, filling you with exciting ideas for how to spend your day. However, you might find that other obligations hold you back from bringing these plans to life. This could leave you feeling restless throughout the day, but don’t worry! Come evening, you’ll have the freedom to pursue whatever your heart desires!",
      "horoscope_ja": "今日は、楽観と熱意の波があなたを包み込み、一日をどう過ごすかというワクワクするアイデアが次々と湧き上がってくるでしょう。しかし、他の用事でなかなか計画を実行に移せないこともあるかもしれません。そのため、一日中落ち着かない気分になるかもしれませんが、ご心配なく！夕方になれば、心が望むことを何でも自由に追求できるようになります！"
    },
    "libra": {
      "date": "2025-12-13",
      "sign": "Libra",
      "horoscope": "You may find yourself engaging in conversations about spirituality today. Recent bursts of insight might inspire you to share your views, but be cautious—this could lead to misunderstandings. It's not the ideal time to persuade others to see things your way. Additionally, while the thought of a getaway might be tempting, it's best to brainstorm ideas for now and save the concrete plans for another day.",
      "horoscope_ja": "今日はスピリチュアリティについて会話する機会が増えるかもしれません。最近ひらめいたひらめきに触発されて、自分の意見を共有したくなるかもしれませんが、誤解を招く可能性があるため、注意が必要です。自分の考えを他人に押し付けるのは良いタイミングではありません。また、旅行に行きたい気持ちはありますが、今はアイデアを出し合い、具体的な計画は別の日に残しておくのが賢明です。"
    },
    "scorpio": {
      "date": "2025-12-13",
      "sign": "Scorpio",
      "horoscope": "You may find that friends or a group you belong to are facing some financial challenges and may seek your guidance. However, it might be wise to hold off on offering advice today, as your clarity of thought isn't at its peak. Instead, trust your intuition to steer you in the right direction. Your knack for perceiving deeper truths is particularly strong at this time.",
      "horoscope_ja": "友人やあなたが所属するグループが経済的な問題に直面し、あなたの助言を求めるかもしれません。しかし、あなたの思考力はまだピークに達していないため、アドバイスをするのは控えた方が良いかもしれません。代わりに、直感を信じて正しい方向へ導いてください。この時期は、より深い真実を見抜く才能が特に優れています。"
    },
    "sagittarius": {
      "date": "2025-12-13",
      "sign": "Sagittarius",
      "horoscope": "Today, you might find conversations with family and your significant other to be a bit challenging. It seems like you're not quite on the same wavelength, or perhaps your messages are getting lost in translation. Don't let this get you down; it's just the influence of the planets creating some temporary misunderstandings. By tomorrow, this energy will shift, and you'll be back to harmonizing with one another.",
      "horoscope_ja": "今日は、家族やパートナーとの会話が少し難しく感じるかもしれません。少し波長が合わなかったり、伝えたいことが伝わらなかったりするかもしれません。落ち込まないでください。これは惑星の影響で一時的に誤解が生じているだけです。明日にはエネルギーが変わり、再び調和が取れるようになるでしょう。"
    },
    "capricorn": {
      "date": "2025-12-13",
      "sign": "Capricorn",
      "horoscope": "You may find yourself daydreaming about travel or pursuing further education today. While your enthusiasm could make it hard to concentrate on your current responsibilities, there's no need to fret. Your determination will help you push through and finish your tasks, regardless of distractions. Alternatively, those around you might step in to gently nudge you back to your duties!",
      "horoscope_ja": "今日は旅行や進学について空想にふけっているかもしれません。熱意のあまり、今の仕事に集中するのが難しくなるかもしれませんが、心配する必要はありません。あなたの強い意志があれば、どんなに邪魔が入ろうとも、最後までやり遂げ、やり遂げることができるでしょう。あるいは、周りの人が優しくあなたを促し、本来の仕事に戻してくれるかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-13",
      "sign": "Aquarius",
      "horoscope": "While your heart may be yearning for romance and visions of a delightful evening with that special person, pressing work demands your immediate attention. This could relate to financial matters or require you to ponder topics that don't particularly excite you. Don't let this dampen your spirits. Tackle your responsibilities first, and then you can set your sights on enjoying the evening. There's still plenty of time to have a good time!",
      "horoscope_ja": "心はロマンスに憧れ、特別な人と過ごす素敵な夜を思い描いているかもしれませんが、差し迫った仕事がすぐに対応を迫ってくるかもしれません。金銭的な問題だったり、あまり興味のない話題に頭を悩ませなければならないかもしれません。そんな時でも、気持ちを落ち込ませてはいけません。まずは責任を果たし、それから夜を楽しむことに意識を集中しましょう。楽しい時間を過ごす時間はまだたっぷりあります！"
    },
    "pisces": {
      "date": "2025-12-13",
      "sign": "Pisces",
      "horoscope": "Today, you may have your sights set on a social gathering that you're excited about. However, you might find that paperwork is consuming more of your time than anticipated, leading you to question if you'll be able to attend. Remember, the paperwork isn't as pressing as it seems. Tackle what you can, and then don’t hesitate to head out and enjoy the festivities. You’ve earned this break!",
      "horoscope_ja": "今日は、楽しみにしている社交の集まりに予定を組んでいるかもしれません。しかし、書類手続きに予想以上に時間がかかり、出席できるかどうか不安になるかもしれません。でも、書類手続きは見た目ほど急ぎではありません。できることから片付けて、あとは遠慮なくお出かけして、楽しいひとときを過ごしましょう。せっかくの休暇ですから！"
    }
  }
}