{
  "updated_at": "2025-11-13T16:29:50.586Z",
  "jst_date": "2025-11-14",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-14",
      "sign": "Aries",
      "horoscope": "Today, your feelings could be quite intense, leading you to make impulsive decisions. Keep in mind that not everyone will understand or accept this reaction. Instead of allowing your emotions to take control, harness them to ignite your passions. Practice self-control to balance your responses, and you'll navigate the day successfully.",
      "horoscope_ja": "今日は感情が激しくなり、衝動的な決断を下してしまうかもしれません。誰もがこの反応を理解したり受け入れたりするわけではないことを心に留めておきましょう。感情に支配されるのではなく、感情をうまくコントロールして情熱を燃やしましょう。自制心を鍛えて反応のバランスを取れば、一日をうまく乗り切ることができるでしょう。"
    },
    "taurus": {
      "date": "2025-11-14",
      "sign": "Taurus",
      "horoscope": "Today, you might sense that you're in over your head. However, the silver lining is your ability to adjust and blend in, which means you can make any situation your own if you're willing to engage with those around you. Embrace patience and an open mind as you navigate this new environment and familiarize yourself with the unique dynamics and quirks of the people you encounter.",
      "horoscope_ja": "今日は、自分の手に負えない状況に陥っているように感じるかもしれません。しかし、明るい兆しは、あなたの適応力と溶け込みやすさです。周りの人々と積極的に関われば、どんな状況でも自分のものにすることができます。この新しい環境を乗り越え、出会う人々の独特な力学や癖に慣れていくには、忍耐とオープンマインドを大切にしてください。"
    },
    "gemini": {
      "date": "2025-11-14",
      "sign": "Gemini",
      "horoscope": "You might find yourself hit by an unexpected wave of emotional intensity that disrupts your current plans. It’s not unusual to find yourself tearing up over something that usually wouldn’t bother you. Remember, it’s perfectly okay to let those feelings surface. Embrace the opportunity to express what’s on your mind—don’t hold back.",
      "horoscope_ja": "予期せぬ感情の波に襲われ、現在の計画が狂ってしまうこともあるでしょう。普段なら気にしないようなことで涙が溢れてくるのは、よくあることです。でも、そういう感情を表に出すのは全く問題ないということを覚えておいてください。心にあることを表現する機会を大切にしましょう。ためらわずに。"
    },
    "cancer": {
      "date": "2025-11-14",
      "sign": "Cancer",
      "horoscope": "Take a moment to relax and allow things to unfold naturally, rather than forcing your desires into reality. You often find yourself in action mode, channeling your energy outward. Consider shifting your focus inward and observe how this magnetic energy attracts others to you. At the very least, you'll gain valuable insights about yourself by paying closer attention to your inner thoughts and feelings.",
      "horoscope_ja": "無理やり願望を現実に押し付けるのではなく、少し時間を取ってリラックスし、物事が自然に展開していくのを待ちましょう。あなたはついつい行動モードに入り込み、エネルギーを外に向けてしまうことがよくあります。意識を内側に向け、この磁力のようなエネルギーがどのように周りの人を惹きつけるのかを観察してみましょう。少なくとも、自分の内なる思考や感情に意識を向けることで、自分自身について貴重な洞察が得られるでしょう。"
    },
    "leo": {
      "date": "2025-11-14",
      "sign": "Leo",
      "horoscope": "A special blend of energies surrounds you today, encouraging you to merge your intuitive insights with your organizational skills. Your business acumen is sharp, and you have a natural understanding of people's behaviors and motivations. Trust your instincts to discern the reasons behind actions, and leverage this knowledge to enhance your effectiveness in achieving your goals.",
      "horoscope_ja": "今日、特別なエネルギーがあなたを取り囲み、直感と組織力の融合を促しています。鋭いビジネス感覚を持ち、人々の行動や動機を自然に理解することができます。直感を信じて行動の背後にある理由を見極め、その知識を活用して目標達成の効率を高めましょう。"
    },
    "virgo": {
      "date": "2025-11-14",
      "sign": "Virgo",
      "horoscope": "As you observe those around you diving into new ventures, you might feel a strong urge to jump in as well. However, it's wise to pause before you leap just because others are doing so. You often rush into things to demonstrate your control over the situation. Remember, life isn't about competing for attention or rushing to achieve goals. Allow yourself the space to think things through.",
      "horoscope_ja": "周りの人たちが新しいことに飛び込んでいるのを見ると、自分も飛び込みたくなる衝動に駆られるかもしれません。しかし、他の人がそうしているからといって、飛び込む前に少し立ち止まるのが賢明です。あなたは往々にして、状況をコントロールしていることを示すために、物事に突き進んでしまいます。人生とは、注目を集めようと競い合ったり、目標達成を急いだりすることではないことを忘れないでください。じっくり考える時間を持つようにしましょう。"
    },
    "libra": {
      "date": "2025-11-14",
      "sign": "Libra",
      "horoscope": "Today, your inner masculine and feminine energies might be sending you in opposing directions, but don't view this as a negative. There's valuable wisdom to be gained from both aspects of yourself. Embrace the strengths of each and channel them into your pursuits. Strive for a harmonious balance between giving and receiving.",
      "horoscope_ja": "今日、あなたの内なる男性性と女性性のエネルギーは、あなたを正反対の方向に導いているかもしれません。しかし、これをネガティブに捉えないでください。あなた自身のどちらの側面からも、貴重な知恵が得られるはずです。それぞれの長所を受け入れ、自分の追求に活かしてください。与えることと受け取ることの調和のとれたバランスを目指しましょう。"
    },
    "scorpio": {
      "date": "2025-11-14",
      "sign": "Scorpio",
      "horoscope": "Consider entrusting a segment of your project to someone who possesses the expertise to manage it more effectively. There's no need to shoulder every responsibility when you recognize that another person is better equipped for the job. Today is a day for calm and thoughtful decision-making. If you feel your abilities are lacking, it's okay to acknowledge that. You'll earn greater respect by delegating tasks than by struggling to handle everything on your own.",
      "horoscope_ja": "プロジェクトの一部を、より効果的に管理できる専門知識を持つ人に任せることを検討してください。他の人の方がその仕事に適任だと判断した場合、すべての責任を負う必要はありません。今日は冷静に、そして思慮深く決断すべき日です。自分の能力が不足していると感じたら、それを認めて構いません。一人で全てをこなそうとするよりも、仕事を委任する方が、より大きな尊敬を得られるでしょう。"
    },
    "sagittarius": {
      "date": "2025-11-14",
      "sign": "Sagittarius",
      "horoscope": "You might find yourself in a positive emotional space, yet the more you share your feelings, the more others may scrutinize your sensitivity. This could lead you to withdraw and keep your thoughts to yourself. Remember, you possess valuable insights to offer, but not everyone is prepared to receive them. Don't let their reactions get to you.",
      "horoscope_ja": "感情的にポジティブな状態にあるかもしれませんが、自分の気持ちを共有すればするほど、周りの人はあなたの繊細さを詮索するかもしれません。その結果、あなたは引きこもり、自分の考えを内に秘めてしまうかもしれません。あなたは貴重な洞察力を持っているかもしれませんが、誰もがそれを受け入れる準備ができているわけではないことを忘れないでください。相手の反応に動揺しないでください。"
    },
    "capricorn": {
      "date": "2025-11-14",
      "sign": "Capricorn",
      "horoscope": "Connect with your inner strength. Pay attention to your most profound emotions and embrace a slower pace. Strategize your next moves while being mindful of how others might feel before diving in. Make the most of the quiet moments throughout your day. Relish the downtime and use it to map out your future steps, rather than rushing headlong into the next obligation.",
      "horoscope_ja": "内なる強さと繋がりましょう。自分の最も深い感情に意識を向け、ゆっくりとしたペースを受け入れましょう。飛び込む前に、周りの人の気持ちに配慮しながら、次の行動を戦略的に考えましょう。一日を通して静かな時間を最大限に活用しましょう。次の義務に突き進むのではなく、その休息時間を大切にし、今後の計画を立てましょう。"
    },
    "aquarius": {
      "date": "2025-11-14",
      "sign": "Aquarius",
      "horoscope": "As long as you've laid the groundwork, everything is poised to fall into place beautifully. The heat is on, and now is the moment to mix in your efforts. If you've taken care of the initial steps, moving forward will be a breeze. However, if you've overlooked these important details, you may find yourself juggling multiple tasks at once.",
      "horoscope_ja": "土台さえ築いておけば、すべてがうまくいくはずです。いよいよ準備が整い、今こそ努力を注ぎ込む時です。最初のステップをきちんと踏んでいれば、あとはスムーズに進むでしょう。しかし、これらの重要な点を見落としてしまうと、複数のタスクを同時にこなさなければならない状況に陥ってしまうかもしれません。"
    },
    "pisces": {
      "date": "2025-11-14",
      "sign": "Pisces",
      "horoscope": "Today, your playful and sociable nature might not resonate well with the more serious and emotional atmosphere around you. Just as you choose your attire based on the weather, think about how your presence can align with the vibe of the room. If you opt for something delicate like silk, be prepared for the possibility of rain without an umbrella. As you enter a gathering, take a moment to gauge the mood. How can you adapt and elevate the energy of those around you?",
      "horoscope_ja": "今日は、あなたの遊び心と社交性は、周囲のよりシリアスで感情的な雰囲気とはあまり調和しないかもしれません。天気に合わせて服装を選ぶように、あなたの存在が部屋の雰囲気とどのように調和するかを考えてみましょう。シルクのような繊細な素材を選ぶ場合は、傘がないと雨が降る可能性も考慮してください。集まりに入るときは、少し時間を取って雰囲気を察知しましょう。周りの人々のエネルギーにどのように適応し、高めることができるでしょうか？"
    }
  }
}