{
  "updated_at": "2026-01-20T16:41:00.429Z",
  "jst_date": "2026-01-21",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-21",
      "sign": "Aries",
      "horoscope": "Today, Aries, you and your loved ones or a close-knit group of friends are likely to be on the go, making the most of the day together. Whether you're soaking up the sun outdoors or enjoying the vibrant atmosphere of a concert or festival, expect a joyful experience. You'll feel a strong bond with those around you, and your connections seem solid. Additionally, your career and finances are looking stable. Embrace the happiness of the day!",
      "horoscope_ja": "牡羊座のあなたは、今日、愛する人や親しい友人グループと、一日を最大限楽しむために、活動的に過ごすでしょう。屋外で日光浴をしたり、コンサートやフェスティバルの活気あふれる雰囲気を楽しんだり、楽しい体験が期待できます。周りの人々との強い絆を感じ、人間関係も強固になりそうです。さらに、仕事と経済状況も安定しそうです。この幸せな一日を心から楽しみましょう！"
    },
    "taurus": {
      "date": "2026-01-21",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you might find yourself captivated by a class, lecture, or workshop that sparks your interest. Exciting travel plans to a far-off state or even a foreign destination could be solidified, especially if you're sharing the experience with friends or family, bringing you a sense of joy! Your connections feel nurturing and steady, even with those who are miles away. Enjoy the day!",
      "horoscope_ja": "おうし座のあなたは今日、興味をそそられる授業や講義、ワークショップに夢中になるかもしれません。遠く離れた州や海外へのワクワクする旅行計画が具体化するかもしれません。特に友人や家族と旅行を分かち合えば、喜びが倍増するでしょう。遠く離れた人との繋がりも、温かく安定したものを感じられます。素敵な一日をお過ごしください！"
    },
    "gemini": {
      "date": "2026-01-21",
      "sign": "Gemini",
      "horoscope": "Gemini, if you've had your eye on a new home or are considering a real estate purchase, today is the perfect opportunity to take action or seal the deal, depending on where you stand. Any property investments made now are likely to appreciate over time. Just be sure to evaluate whether this is the right choice for you before making a commitment; otherwise, you could find yourself tied to a decision you regret for quite a while.",
      "horoscope_ja": "ふたご座さん、もしあなたが新しい家を探している、あるいは不動産の購入を検討しているなら、今日はあなたの状況次第で行動を起こす、あるいは契約を締結する絶好の機会です。今不動産投資をすれば、時間の経過とともに価値が上がる可能性が高いでしょう。ただし、決断する前に、本当に自分にとって正しい選択かどうかを見極めることが重要です。さもないと、後々後悔することになるかもしれません。"
    },
    "cancer": {
      "date": "2026-01-21",
      "sign": "Cancer",
      "horoscope": "A lively gathering might spark or strengthen a romantic connection that has the potential to endure. Expect to meet intriguing new individuals, Cancer, who will engage you in thought-provoking discussions and share valuable insights. Additionally, an old acquaintance may re-enter your life, leading to a delightful reunion. You might also find that a project you've been dedicated to, whether professional or personal, reaches its conclusion. Make the most of your day!",
      "horoscope_ja": "活気のある集まりは、長続きする可能性のあるロマンチックなつながりを刺激したり、強化したりするかもしれません。蟹座のあなたは、興味深い新しい人々との出会いに期待しましょう。彼らはあなたを刺激的な議論に巻き込み、貴重な洞察を共有してくれるでしょう。また、旧友があなたの人生に再び現れ、楽しい再会につながるかもしれません。また、仕事でもプライベートでも、あなたが熱心に取り組んできたプロジェクトが完了するかもしれません。今日という日を最大限に活用しましょう！"
    },
    "leo": {
      "date": "2026-01-21",
      "sign": "Leo",
      "horoscope": "Today, Leo, you are likely to feel a deep sense of fulfillment and happiness in your life. Your professional and financial situations are thriving, and your domestic environment feels particularly safe and steady. You may find yourself contemplating putting some of your resources into your home. If you're starting a new romantic relationship now, it has the potential to be long-lasting, so take your time to ensure you truly connect with the person before making any commitments!",
      "horoscope_ja": "獅子座さん、今日は人生において深い充実感と幸福感を感じられるでしょう。仕事面でも経済面でも順調で、家庭環境は特に安全で安定しています。家計にいくらか投資しようかと考えるかもしれません。もし今、新しい恋愛関係を始めようとしているなら、それは長続きする可能性を秘めています。ですから、何か約束をする前に、時間をかけて相手と本当に心を通わせられるか確認しましょう！"
    },
    "virgo": {
      "date": "2026-01-21",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, you can expect local business dealings to be both wise and rewarding. Your financial situation feels solid, as your career and financial affairs are on an upswing. Interactions with friends, neighbors, and family are likely to be warm, friendly, and sincere. Overall, your relationships are in a good place. In the evening, consider taking a refreshing walk in your neighborhood.",
      "horoscope_ja": "乙女座のあなたは、今日、地元でのビジネス取引が賢明かつ実りあるものになるでしょう。キャリアと経済状況が好転し、経済状況も安定しています。友人、隣人、家族との交流は、温かく、友好的で、誠実なものになるでしょう。全体的に、人間関係は良好です。夕方には、近所を散歩してリフレッシュしてみてはいかがでしょうか。"
    },
    "libra": {
      "date": "2026-01-21",
      "sign": "Libra",
      "horoscope": "Today, Libra, if you have a passion for gardening or any form of land cultivation, you may find yourself deeply immersed in it. A friend or family member could lend a hand, making the experience even more enjoyable. Any seeds you plant today are poised to flourish, so don’t fret over those that don’t take root. Just be mindful not to overdo it; work until you feel pleasantly fatigued, then call it a day to avoid exhausting yourself.",
      "horoscope_ja": "天秤座さん、もし今日、ガーデニングや土地耕作に情熱を持っているなら、その世界にどっぷりと浸かることができるかもしれません。友人や家族が手伝ってくれれば、さらに楽しい体験になるでしょう。今日蒔いた種はどれも大きく育ちます。根付かなくても心配する必要はありません。ただし、やり過ぎには注意しましょう。心地よい疲労感を感じるまで作業し、疲れ果てないように一日を終えましょう。"
    },
    "scorpio": {
      "date": "2026-01-21",
      "sign": "Scorpio",
      "horoscope": "Today, you may receive a heartfelt message from a dear friend or a significant other, Scorpio, which could turn out to be the highlight of your day. Although you might still be waiting for a letter or package that hasn't arrived yet, this connection will uplift your spirits. An older family member or neighbor may seek your guidance on a matter, and you'll find that children are especially motivating right now, as you have a unique sensitivity to their energy. Embrace these moments!",
      "horoscope_ja": "蠍座のあなたは、今日、親しい友人や恋人から心のこもったメッセージを受け取るかもしれません。それが今日のハイライトとなるかもしれません。まだ届いていない手紙や荷物を待っているかもしれませんが、この繋がりはあなたの気分を高揚させてくれるでしょう。年配の家族や近所の人が、あることであなたのアドバイスを求めるかもしれません。特に今は、子供たちのエネルギーに敏感なあなたは、子供たちから刺激を受けるでしょう。こうした瞬間を大切にしましょう！"
    },
    "sagittarius": {
      "date": "2026-01-21",
      "sign": "Sagittarius",
      "horoscope": "Today is an excellent opportunity to kick off that gardening project you've been contemplating, as any ventures related to the earth you initiate now are likely to flourish. You may find yourself preoccupied with concerns about your financial stability, Sagittarius. Rest assured, these worries are likely unfounded, as you are on a path to continued success. Nevertheless, these uncertainties can motivate you to take proactive measures to safeguard your financial future. So, take action!",
      "horoscope_ja": "今日は、ずっと考えていたガーデニングプロジェクトを始める絶好の機会です。今始める土に関するあらゆる取り組みは、きっと実を結ぶでしょう。射手座のあなたは、経済的な安定について不安に悩まされているかもしれません。しかし、ご安心ください。あなたは成功への道を歩み続けているので、その不安は杞憂に終わる可能性が高いのです。とはいえ、こうした不確実性は、将来の経済的な安全を守るために積極的に行動を起こすきっかけとなるかもしれません。さあ、行動を起こしましょう！"
    },
    "capricorn": {
      "date": "2026-01-21",
      "sign": "Capricorn",
      "horoscope": "You might find yourself hosting a cozy gathering with family and friends, either at your place or a neighbor's. Keep an ear out for an exhilarating phone call that could come your way. Your sense of security in all your relationships—whether they be in business, friendship, or romance—is likely to be strong today, Capricorn. Additionally, insights from someone close could inspire you with fresh ideas for sprucing up your home in unique ways.",
      "horoscope_ja": "自宅や近所の家で、家族や友人とアットホームな集まりを開くかもしれません。ワクワクするような電話がかかってくるかもしれません。山羊座のあなたは、ビジネス、友情、恋愛など、あらゆる人間関係において今日は強い安心感を得られるでしょう。さらに、身近な人からのアドバイスが、ユニークな方法で家を飾るための斬新なアイデアを思いつくかもしれません。"
    },
    "aquarius": {
      "date": "2026-01-21",
      "sign": "Aquarius",
      "horoscope": "Today, a dear friend or partner may confide in you, Aquarius. You might also hear about an esteemed figure, like an author or politician, who has caught your admiration. This could spark a wave of creativity within you, prompting you to dive into a project. However, be cautious not to overextend yourself; it's easy to lose track of time and wear yourself out. Don't forget to pause and recharge—make sure to take breaks and nourish yourself.",
      "horoscope_ja": "水瓶座のあなた、今日は大切な友人やパートナーがあなたのことを打ち明けてくれるかもしれません。また、作家や政治家など、あなたが尊敬する人物の話を聞くかもしれません。これがあなたの中に創造性の波を巻き起こし、プロジェクトに没頭するきっかけとなるかもしれません。ただし、無理をしないように注意してください。時間を忘れて疲れ果ててしまう可能性も高いです。休憩を取り、エネルギーを充電することを忘れないでください。"
    },
    "pisces": {
      "date": "2026-01-21",
      "sign": "Pisces",
      "horoscope": "A familiar face from your past may reappear unexpectedly, Pisces. This person might show up at a social gathering or even pay a visit to your family. Your connections with friends and community groups are likely to be uplifting and fulfilling at this time, providing you with a sense of stability. It's an excellent opportunity to enroll in classes, especially those related to the arts.",
      "horoscope_ja": "魚座のあなた、過去の馴染みの顔が突然現れるかもしれません。社交の場に現れたり、家族を訪ねてきたりするかもしれません。友人や地域社会との繋がりは、この時期、心を高揚させ、充実したものとなり、安定感をもたらしてくれるでしょう。特に芸術関連の講座に通うには絶好の機会です。"
    }
  }
}