{
  "updated_at": "2025-12-11T16:37:08.925Z",
  "jst_date": "2025-12-12",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-12",
      "sign": "Aries",
      "horoscope": "Recently, you may have sensed that your career ambitions were more aligned with your parents' desires, especially those of your mother, rather than your own. This has led you to reflect deeply on your professional path and what you genuinely aspire to achieve. Today, clarity will begin to emerge, allowing you to gain a better understanding of your true aspirations.",
      "horoscope_ja": "最近、キャリアにおける自分の野望が、自分自身の願望よりも、両親、特に母親の願望に寄りすぎていると感じたかもしれません。この経験から、あなたは自分のキャリアパスと、本当に達成したいことについて深く考えるようになりました。今日、あなたは自分の真の願望をより深く理解し、より明確に理解できるようになるでしょう。"
    },
    "taurus": {
      "date": "2025-12-12",
      "sign": "Taurus",
      "horoscope": "Lately, it appears that your social aspirations have faced some challenges. However, the current planetary influences are set to spark fresh desires within you. While these new ambitions may be more grounded, they hold significant value. Your professional motivations are shifting towards a healthier, less self-centered approach, leading to a rewarding and fulfilling transformation.",
      "horoscope_ja": "最近、あなたの社会的な願望はいくつかの困難に直面しているようです。しかし、現在の惑星の影響は、あなたの中に新たな欲求を刺激するでしょう。これらの新たな野心は、より現実的なものかもしれませんが、大きな価値を持っています。あなたの職業上のモチベーションは、より健全で自己中心的でないアプローチへと変化し、やりがいのある充実した変革へとつながっています。"
    },
    "gemini": {
      "date": "2025-12-12",
      "sign": "Gemini",
      "horoscope": "Today marks a turning point where you might recognize your tendency to take on a parental role in your romantic connections. You often find yourself establishing boundaries, managing situations, and shouldering responsibilities. It would be beneficial for your partner to encourage you to embrace your more vulnerable and tender emotions.",
      "horoscope_ja": "今日は、恋愛関係において親のような役割を担う傾向に気づく転換点となるかもしれません。境界線を定めたり、状況をコントロールしたり、責任を担ったりすることが多くなります。パートナーは、あなたがより傷つきやすく繊細な感情を受け入れるよう促すと良いでしょう。"
    },
    "cancer": {
      "date": "2025-12-12",
      "sign": "Cancer",
      "horoscope": "Do you find yourself worried that others may not grasp your evolving self? Have you transformed in ways that make you feel distant from some? It's natural to feel this way, but remember, not everyone evolves at the same speed as you do. Your friends likely appreciate the growth you've experienced. Keep this perspective in mind!",
      "horoscope_ja": "周りの人が自分の成長を理解してくれないのではないかと不安になったことはありませんか？ 変化のせいで、周りの人から距離を感じてしまうことはありませんか？ そう感じるのはとても自然なことですが、誰もがあなたと同じスピードで成長するわけではないことを忘れないでください。 きっと周りの人たちは、あなたの成長を喜んでくれるでしょう。この視点を忘れないようにしましょう！"
    },
    "leo": {
      "date": "2025-12-12",
      "sign": "Leo",
      "horoscope": "Your views are increasingly diverging from those around you, and while everyone has their unique perspectives, yours are standing out more than ever. You might find yourself contemplating the idea of creating your own role, where the only person you answer to is yourself! While this path may come with its share of challenges, the potential benefits could be significant.",
      "horoscope_ja": "あなたの視点は周囲の人々からますます離れつつあります。誰もが独自の視点を持っている中で、あなたの視点はこれまで以上に際立っています。自分自身に責任を持つ、自分だけの役割を築くことを考えているかもしれません。この道には多くの困難が伴うかもしれませんが、その潜在的なメリットは計り知れないでしょう。"
    },
    "virgo": {
      "date": "2025-12-12",
      "sign": "Virgo",
      "horoscope": "You might have been contemplating a change in dynamics with your partner, or perhaps a new opportunity has already come your way. This moment of reflection in your relationship is an essential step towards deepening your connection. Starting today, expect your relationship to regain its momentum and move forward harmoniously. Take the time to notice the shifts that have occurred.",
      "horoscope_ja": "パートナーとの関係に変化を感じているかもしれませんし、あるいはすでに新たなチャンスが訪れているかもしれません。関係を振り返るこの瞬間は、二人の絆を深めるための重要なステップです。今日から、二人の関係は再び勢いを取り戻し、調和のとれた前進を遂げるでしょう。起こった変化に気づく時間を取りましょう。"
    },
    "libra": {
      "date": "2025-12-12",
      "sign": "Libra",
      "horoscope": "Over the past six weeks, you may have noticed a shift in your feelings. Your interests in certain individuals have waned, and you might be feeling a bit uncertain about your professional life, questioning your own appeal. However, starting today, those uncertainties will begin to fade away. Stay positive!",
      "horoscope_ja": "過去6週間、あなたは自分の気持ちの変化に気づいているかもしれません。特定の人への興味が薄れ、仕事に少し不安を感じ、自分の魅力に疑問を感じているかもしれません。しかし、今日から、それらの不安は徐々に消えていくでしょう。前向きな気持ちでいましょう！"
    },
    "scorpio": {
      "date": "2025-12-12",
      "sign": "Scorpio",
      "horoscope": "Your emotional landscape is starting to flourish once again! After a period of indecision and self-doubt that lasted about six weeks, you're beginning to regain your footing. It’s been a challenging time, but today marks a turning point. While it's wise to remain cautious, expect a boost in your self-assurance to emerge.",
      "horoscope_ja": "あなたの感情が再び花開き始めています！約6週間続いた優柔不断と自信喪失の時期を経て、あなたは再び自分の足場を取り戻し始めています。困難な時期でしたが、今日が転換点となります。慎重な姿勢を保つことは賢明ですが、自信が深まることを期待してください。"
    },
    "sagittarius": {
      "date": "2025-12-12",
      "sign": "Sagittarius",
      "horoscope": "Over the past month, you may have found yourself feeling uncertain about your commitments, almost as if you were in a state of limbo. This period of reflection might have brought to light some past mistakes, leaving you apprehensive about making the same missteps again. However, with this newfound awareness of your history, you're now ready to embrace the future with renewed confidence.",
      "horoscope_ja": "この1ヶ月間、あなたは自分の約束について不安を感じ、まるで宙ぶらりんの状態にいるように感じていたかもしれません。この反省の期間に過去の過ちが明るみに出てきて、また同じ過ちを繰り返すのではないかと不安になったかもしれません。しかし、この新たな認識によって、あなたは新たな自信を持って未来を迎える準備ができています。"
    },
    "capricorn": {
      "date": "2025-12-12",
      "sign": "Capricorn",
      "horoscope": "What a breath of fresh air! Your vitality is making a comeback, particularly in matters of love. Today, you'll find yourself liberated from the shackles of uncertainty regarding your decisions. Self-doubt has always been a sensitive topic for you, and it can leave you feeling quite unhappy when your confidence wavers. The positive energy is starting to flow again, though it might take a few days for you to completely bounce back from the challenges of the past weeks.",
      "horoscope_ja": "なんとも新鮮な空気ですね！特に恋愛面で、活力が戻ってきています。今日は、決断に関する不安の束縛から解放されるでしょう。自己不信はあなたにとって常にデリケートな問題であり、自信が揺らぐと、ひどく落ち込んだ気分にさせられることがあります。ポジティブなエネルギーが再び流れ始めていますが、ここ数週間の試練から完全に立ち直るには数日かかるかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-12",
      "sign": "Aquarius",
      "horoscope": "Today holds great potential for you! The cosmic alignments are set to enhance your emotional well-being, helping you break free from the recent cloud of uncertainty that has been hanging over you. You may have struggled to trust your instincts during this time. While this was challenging, the doubt you experienced likely had its reasons. Now, with a clearer perspective, consider using this insight to reflect on and make sense of your past experiences.",
      "horoscope_ja": "今日はあなたにとって大きな可能性を秘めています！宇宙の配置は、あなたの感情的な幸福を高め、最近あなたを覆っていた不確実性の雲から抜け出すのに役立ちます。この時期、自分の直感を信じることができずに苦労したかもしれません。確かにそれは困難でしたが、あなたが抱いた疑念にはきっと理由があったはずです。今、より明確な視点を持って、この洞察に基づいて過去の経験を振り返り、理解を深めてみましょう。"
    },
    "pisces": {
      "date": "2025-12-12",
      "sign": "Pisces",
      "horoscope": "Today, you may feel a newfound clarity that has been elusive in recent times. The cosmic forces are aligning to dispel the mental haze that has clouded your thoughts. The reflections of the past few days have provided you with valuable insights, and these lessons should be apparent now. It's time for you to take those insights and weave them into the fabric of your daily life.",
      "horoscope_ja": "今日は、最近なかなか掴めなかった新たな明晰さを感じるかもしれません。宇宙の力が、あなたの思考を曇らせていた心のもやを払いのけようとしています。ここ数日の反省は貴重な洞察をもたらし、その教訓は今、はっきりと理解できるはずです。今こそ、それらの洞察を日々の生活に織り込む時です。"
    }
  }
}