{
  "updated_at": "2025-11-21T16:29:29.593Z",
  "jst_date": "2025-11-22",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-22",
      "sign": "Aries",
      "horoscope": "Collaborating with a partner may open the door to innovative and artistic possibilities. You’re brimming with energy and prepared to tackle nearly any challenge. Any initiatives you embark on today, particularly those of a creative nature, are likely to flourish despite any hurdles you might encounter. The day's events should also invigorate your connections with partners and others.",
      "horoscope_ja": "パートナーとのコラボレーションは、革新的で芸術的な可能性への扉を開くかもしれません。あなたはエネルギーに満ち溢れ、どんな困難にも立ち向かう準備ができています。今日始めるあらゆる取り組み、特に創造的なものは、どんな困難に直面しても、必ず成功へと導くでしょう。今日の出来事は、パートナーや他の人々との繋がりを活性化させるでしょう。"
    },
    "taurus": {
      "date": "2025-11-22",
      "sign": "Taurus",
      "horoscope": "Today, you may feel a strong urge to spruce up your living space. Whether it's a deep clean, a touch of decoration, or tackling some small repairs, your home is calling for your attention. A new piece of art, like a sculpture or painting, could spark this motivation. By the time you're finished, your home will look stunning. Embrace this creative energy!",
      "horoscope_ja": "今日は、住空間をすっきりさせたい衝動に駆られているかもしれません。大掃除でも、ちょっとしたデコレーションでも、ちょっとした修理でも、あなたの家はあなたの注意を呼んでいます。彫刻や絵画などの新しい芸術作品が、このモチベーションを刺激するかもしれません。完成する頃には、家はきっと素晴らしいものになるでしょう。この創造的なエネルギーをぜひ受け入れてください！"
    },
    "gemini": {
      "date": "2025-11-22",
      "sign": "Gemini",
      "horoscope": "You might find yourself busy today with a particular task or objective that requires you to make numerous phone calls, send out several messages, or drive around quite a bit. Your determination is at an all-time high, and you're likely to achieve success in this endeavor or any other pursuits you take on. Expect your discussions to be fruitful, potentially inspiring you to embark on exciting new projects.",
      "horoscope_ja": "今日は、特定のタスクや目標のために、何度も電話をかけたり、メッセージを送ったり、車を頻繁に走らせたりと、忙しく過ごすことになるかもしれません。あなたの決意はかつてないほど高まっており、この仕事だけでなく、あなたが取り組む他のどんなことでも、成功を収める可能性が高くなります。話し合いは実りあるものになり、刺激的な新しいプロジェクトに乗り出すきっかけとなるかもしれません。"
    },
    "cancer": {
      "date": "2025-11-22",
      "sign": "Cancer",
      "horoscope": "Now is the perfect moment to turn your thoughts of working from home into reality. Opportunities related to finances or your living space are ripe for success at this time. The stars suggest that your dedication and effort will yield the outcomes you desire. Additionally, an older acquaintance may pay you a visit, bringing along valuable insights or suggestions worth pondering.",
      "horoscope_ja": "今こそ、在宅勤務の夢を現実に変える絶好の機会です。お金や住居に関するチャンスが、この時期には成功への道が開けています。星占いは、あなたの献身と努力が望む結果をもたらすことを示唆しています。さらに、年上の知人が訪ねてきて、貴重な洞察や、じっくり考える価値のある提案を持ってきてくれるかもしれません。"
    },
    "leo": {
      "date": "2025-11-22",
      "sign": "Leo",
      "horoscope": "While you may feel the urge to retreat into solitude today, it's not the ideal moment for that. You have a list of important objectives to tackle, particularly those related to communication or creativity. Procrastination is not an option! Now is an excellent opportunity to kick off nearly any venture. The celestial alignments suggest that success is on the horizon for your efforts.",
      "horoscope_ja": "今日は一人で過ごしたい衝動に駆られるかもしれませんが、今はそうするのに理想的な時期ではありません。特にコミュニケーションや創造性に関わる重要な目標に取り組まなければなりません。先延ばしは許されません！今こそ、あらゆる事業を始める絶好の機会です。天体の配置は、あなたの努力が成功へと近づいていることを示唆しています。"
    },
    "virgo": {
      "date": "2025-11-22",
      "sign": "Virgo",
      "horoscope": "You may discover hidden abilities or talents that could pave the way for greater financial rewards, provided you're ready to put in the effort. This newfound recognition will likely boost your self-esteem and confidence, creating a positive ripple effect that enhances your future prospects. Embrace whatever unfolds today, no matter how unusual it may appear, and let things unfold naturally!",
      "horoscope_ja": "努力する覚悟さえあれば、より大きな経済的報酬への道を開く、隠れた能力や才能を発見できるかもしれません。この新たな発見は、あなたの自尊心と自信を高め、将来の見通しを明るくするポジティブな波及効果を生み出すでしょう。今日起こる出来事を、たとえどんなに奇妙に思えても、受け入れ、物事が自然に展開していくのを待ちましょう！"
    },
    "libra": {
      "date": "2025-11-22",
      "sign": "Libra",
      "horoscope": "A casual remark from a friend might unexpectedly steer you toward a transformative journey. This could lead to exciting business prospects or unveil a newfound passion or community that resonates with you. Whatever the case, it’s likely to engage your interest and channel your energy for an extended period. Embrace this as a beneficial turn of events.",
      "horoscope_ja": "友人の何気ない一言が、思いがけずあなたを変革の道へと導くかもしれません。刺激的なビジネスの見通しが開けたり、新たな情熱や共感できるコミュニティとの出会いが生まれるかもしれません。いずれにせよ、それはあなたの興味を惹きつけ、長期間にわたってエネルギーを注ぎ込むことになるでしょう。これを有益な出来事として受け止めましょう。"
    },
    "scorpio": {
      "date": "2025-11-22",
      "sign": "Scorpio",
      "horoscope": "No matter the challenges you've faced recently, you possess the resilience to conquer them, emerge stronger, and forge ahead. Your vitality is robust, ensuring you won't feel drained. You'll likely tackle each task as it arises with determination. If you've been contemplating launching a new venture, today is the perfect opportunity to dive in. Nothing will stand in your way.",
      "horoscope_ja": "最近どんな困難に直面したとしても、あなたはそれを克服し、より強くなって立ち上がり、前進する回復力を持っています。活力は旺盛で、決して疲れを感じることはないでしょう。きっと、あらゆる課題に毅然とした決意で取り組むでしょう。もし新しい事業の立ち上げを考えているなら、今日こそ飛び込む絶好の機会です。あなたの前に立ちはだかるものは何もありません。"
    },
    "sagittarius": {
      "date": "2025-11-22",
      "sign": "Sagittarius",
      "horoscope": "Today, your connections with a community may serve as a catalyst for your spiritual growth. You might find yourself revisiting old emotional wounds, but there's no need to feel disheartened. Instead, view this as a chance to let go of past traumas that have held you back. Embracing the process of overcoming any limitations—be they emotional, spiritual, or physical—will prove to be particularly fruitful. You'll shed a significant burden and emerge from this experience with renewed clarity and purpose.",
      "horoscope_ja": "今日、コミュニティとのつながりが、あなたの精神的な成長のきっかけとなるかもしれません。過去の心の傷を再び抱えてしまうこともあるかもしれませんが、落ち込む必要はありません。むしろ、これを、あなたを阻んできた過去のトラウマを手放すチャンスと捉えましょう。感情的、精神的、肉体的など、あらゆる限界を乗り越えるプロセスを受け入れることは、特に大きな成果をもたらすでしょう。あなたは大きな重荷を捨て、この経験から新たな明晰さと目的意識を持って立ち直ることができるでしょう。"
    },
    "capricorn": {
      "date": "2025-11-22",
      "sign": "Capricorn",
      "horoscope": "Today, you may discover new financial opportunities or resources that can enhance your career path or help you progress in your job. This will likely inspire you, fueling your enthusiasm and drive. Embrace this moment to be ambitious; you possess the determination and capability to pursue any goal you set your sights on.",
      "horoscope_ja": "今日、あなたはキャリアパスを向上させたり、仕事で昇進したりするのに役立つ新たな経済的機会やリソースを見つけるかもしれません。これはきっとあなたを刺激し、情熱と意欲を掻き立てるでしょう。この瞬間を捉えて野心的な行動を起こしましょう。あなたは、目指すどんな目標でも追求する強い意志と能力を持っています。"
    },
    "aquarius": {
      "date": "2025-11-22",
      "sign": "Aquarius",
      "horoscope": "Today, any uncertainties regarding a romantic or business relationship may serve as a catalyst for positive change. You're motivated to tackle and mend any issues or conflicts with your partner. The stars suggest that your perseverance and effort will lead to success. Additionally, you might encounter a new friend who could prove to be quite beneficial.",
      "horoscope_ja": "今日、恋愛関係やビジネス関係における不確実性は、前向きな変化のきっかけとなるかもしれません。パートナーとの問題や対立に取り組み、修復する意欲が湧いています。星は、あなたの粘り強さと努力が成功につながることを示唆しています。さらに、非常に有益な新しい友人との出会いもあるかもしれません。"
    },
    "pisces": {
      "date": "2025-11-22",
      "sign": "Pisces",
      "horoscope": "You may be feeling a bit anxious about your financial prospects, prompting you to create a savings or investment strategy for added peace of mind. Fortunately, the celestial alignments today suggest that you are likely to find the support you need, and any endeavors you undertake should lead to success. If you're experiencing a touch of discomfort, consider exploring vitamins, herbal remedies, yoga, or other holistic approaches to restore your well-being.",
      "horoscope_ja": "経済的な見通しに少し不安を感じていて、心の平穏のために貯蓄や投資戦略を立てたくなるかもしれません。幸いなことに、今日の天体の配置は、必要なサポートが得られそうなことを示唆しており、どんな取り組みも成功につながるはずです。少しでも体調に不安を感じている場合は、ビタミン剤、ハーブ療法、ヨガ、その他のホリスティックなアプローチを試して、健康を取り戻してみてはいかがでしょうか。"
    }
  }
}