{
  "updated_at": "2026-01-04T16:29:57.122Z",
  "jst_date": "2026-01-05",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-05",
      "sign": "Aries",
      "horoscope": "A journey with a dear friend could be on the near horizon for you, Aries. The prospect of departure is likely stirring up excitement within you. Expect some unexpected twists and turns during this adventure, which may transform it into something far beyond just a getaway. Remember to put your best foot forward, embrace your desires, and enjoy every moment!",
      "horoscope_ja": "牡羊座のあなたにとって、大切な友人との旅が間近に迫っているかもしれません。出発への期待が、きっとあなたの心を躍らせるでしょう。この冒険には予期せぬ展開が待ち受けており、単なる旅行をはるかに超える特別な体験となるかもしれません。全力を尽くし、自分の欲望を受け入れ、一瞬一瞬を楽しんでください！"
    },
    "taurus": {
      "date": "2026-01-05",
      "sign": "Taurus",
      "horoscope": "Today, Taurus, you might stumble upon an unforeseen stroke of luck—something that would have seemed unimaginable just a moment ago. It may feel like a wish granted, but be aware that it could also shake things up in your life. You may find yourself at a crossroads: seize this chance and transform your lifestyle, or pass it up, risking that another golden opportunity may not come your way again. Life isn’t always straightforward, so take a moment to reflect on your options!",
      "horoscope_ja": "おうし座のあなたは今日、思いがけない幸運に遭遇するかもしれません。ほんの少し前には想像もできなかったような幸運です。まるで願いが叶ったかのように感じるかもしれませんが、同時にあなたの人生を大きく変える可能性もあることを覚えておいてください。あなたは岐路に立たされているかもしれません。このチャンスを掴んでライフスタイルを変えるか、それとも諦めて、二度と巡ってこないかもしれない絶好の機会を逃すか。人生は常に一筋縄ではいかないものです。だからこそ、少し時間を取って、自分の選択肢についてじっくり考えてみましょう！"
    },
    "gemini": {
      "date": "2026-01-05",
      "sign": "Gemini",
      "horoscope": "Gemini, if you're not in a relationship at the moment, today could bring a delightful encounter with someone who has great potential. This meeting may be linked to your work, and there's a chance this intriguing person has been a familiar face in your area for quite some time. A mutual friend might play matchmaker and introduce you both. Expect to engage in a conversation that lasts at least an hour, and it's likely you'll set up another meeting soon.",
      "horoscope_ja": "ふたご座のあなた、もし今恋人がいないなら、今日は素晴らしい可能性を秘めた人との素敵な出会いがあるかもしれません。この出会いは仕事に関係しているかもしれませんし、その魅力的な人はあなたの地域で長年知り合いだった可能性もあります。共通の友人が仲人になって、二人を紹介してくれるかもしれません。少なくとも1時間は会話が続き、すぐに次の約束をすることになるかもしれません。"
    },
    "cancer": {
      "date": "2026-01-05",
      "sign": "Cancer",
      "horoscope": "Today, Cancer, you may experience an unforeseen twist that brings new financial opportunities or added responsibilities your way. This could be the chance you've been hoping for, but it might catch you off guard, leading you to request some time to consider your options. Just be cautious not to deliberate for too long, as someone else might seize this opportunity if you hesitate!",
      "horoscope_ja": "蟹座のあなたは今日、予期せぬ展開に見舞われ、新たな経済的なチャンスや新たな責任がもたらされるかもしれません。これはあなたが待ち望んでいたチャンスかもしれませんが、予期せぬ出来事に見舞われ、選択肢を検討する時間を求めることになるかもしれません。ただし、あまり長く考えすぎないように注意してください。ためらっていると、他の誰かがこのチャンスを掴んでしまうかもしれません！"
    },
    "leo": {
      "date": "2026-01-05",
      "sign": "Leo",
      "horoscope": "Today, Leo, you may find yourself at a lively social gathering where you'll encounter some fascinating individuals from unique fields like film or television. Be prepared for a mix of strange tales—some rooted in reality, while others are likely to be embellished. Amidst the lighthearted exchanges and storytelling, you might stumble upon valuable insights. Be sure to jot them down so you can recall them later!",
      "horoscope_ja": "レオさん、今日は活気のある社交の場に身を置くかもしれません。映画やテレビといったユニークな分野で活躍する魅力的な人々と出会うかもしれません。現実に根ざしたものもあれば、脚色されたものもある、奇妙な話が飛び交うでしょう。軽快なやり取りや語り合いの中で、貴重な洞察に出会うかもしれません。後で思い出せるように、メモしておきましょう！"
    },
    "virgo": {
      "date": "2026-01-05",
      "sign": "Virgo",
      "horoscope": "Virgo, you're likely to be radiating with vitality and good health today, making you shine brighter than usual. This newfound energy may draw more attention from those around you, who will be more inclined to listen to your words. Your mental clarity is at its peak, allowing you to grasp information swiftly and effectively. As a result, you'll find yourself soaking up knowledge and insights more than you typically would. Be sure to take note of these moments!",
      "horoscope_ja": "おとめ座のあなたは、今日は活力と健康に満ち溢れ、いつも以上に輝きを放つでしょう。この新たなエネルギーは周囲の人々の注目を集め、あなたの言葉に耳を傾けるようになるかもしれません。頭脳明晰さは最高潮に達し、情報を素早く効果的に理解することができます。その結果、普段以上に多くの知識や洞察を吸収できるでしょう。こうした瞬間をぜひ意識してみてください！"
    },
    "libra": {
      "date": "2026-01-05",
      "sign": "Libra",
      "horoscope": "Today, Libra, your adventurous spirit is likely to be ignited! The familiar sights of your town may start to feel a bit stifling, prompting a desire for a change of scenery. Consider inviting a close friend or your partner to join you on a spontaneous road trip to the mountains or the beach. A little escape could be just what you need to recharge. You've been putting in a lot of effort lately, and some time in nature could do wonders for your well-being. So, why not seize the day?",
      "horoscope_ja": "天秤座さん、今日は冒険心が燃え上がるかもしれません！ 見慣れた街の景色が少し息苦しく感じられ、気分転換がしたくなるかもしれません。親しい友人やパートナーを誘って、思い立ったら山や海へドライブに出かけてみてはいかがでしょうか。ちょっとした逃避は、まさにエネルギーチャージに必要なものかもしれません。最近は努力を重ねているあなただからこそ、自然の中で過ごす時間は心身ともに素晴らしい効果をもたらすでしょう。さあ、この日を思いっきり楽しんでみませんか？"
    },
    "scorpio": {
      "date": "2026-01-05",
      "sign": "Scorpio",
      "horoscope": "A powerful dream or vision may lead to a significant spiritual awakening for you today, Scorpio. You might find yourself wandering through the day in a contemplative haze, attempting to unravel its meaning. Consider diving into some literature on the topic, as the stars indicate that reading could provide you with valuable insights. Additionally, jotting down your experience could be beneficial.",
      "horoscope_ja": "蠍座のあなたにとって、今日は強烈な夢やビジョンが、大きな精神的な目覚めをもたらすかもしれません。その意味を解き明かそうと、瞑想に耽りながら一日を過ごすかもしれません。星占いによると、読書は貴重な洞察をもたらす可能性があるので、そのテーマに関する文献を読んでみるのも良いでしょう。また、自分の経験を書き留めておくのも効果的かもしれません。"
    },
    "sagittarius": {
      "date": "2026-01-05",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you're likely to radiate happiness, and your cheerful demeanor will be hard to miss. Those around you will certainly take notice! This could be a perfect opportunity to forge new friendships, and if you're single, you might just encounter someone intriguing who could spark a romantic interest. Expect this individual to be charming, well-mannered, and intellectually stimulating! So, be friendly, spread kindness, and savor every moment of your day.",
      "horoscope_ja": "射手座のあなたは今日、幸せを振りまくでしょう。あなたの明るい態度は、周りの人にもきっと気づかれるでしょう。新しい友情を築く絶好の機会となるかもしれません。独身の方は、恋愛のきっかけとなるような魅力的な人に出会うかもしれません。その人は魅力的で、礼儀正しく、知的に刺激的な人でしょう！ですから、親しみやすく、親切に接し、一日の一瞬一瞬を大切に過ごしましょう。"
    },
    "capricorn": {
      "date": "2026-01-05",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today could see you welcoming a group of individuals drawn to the realms of the psychic and metaphysical. A particularly intriguing guest may take the floor to share insights or facilitate a discussion, captivating everyone in attendance. You'll earn accolades as a fantastic host, even if your main contributions are serving cookies and brewing coffee. Most importantly, relish the moments spent with your friends and enjoy the lively conversations. Have a blast!",
      "horoscope_ja": "山羊座のあなたは、今日、超自然的・形而上学的な世界に惹かれる人たちのグループを迎えるかもしれません。特に興味深いゲストが発言し、洞察を共有したり、議論を促したりして、出席者全員を魅了するかもしれません。たとえあなたの主な役割がクッキーの配りやコーヒーの淹れ方であったとしても、素晴らしいホストとして称賛されるでしょう。何よりも大切なのは、友人と過ごすひとときを味わい、活発な会話を楽しむことです。最高のひとときをお過ごしください！"
    },
    "aquarius": {
      "date": "2026-01-05",
      "sign": "Aquarius",
      "horoscope": "Today, Aquarius, your attention is likely to be drawn towards writing. You possess a wealth of insights that are just waiting to be shared with those who are eager to listen. Whether you decide to craft a magazine piece, delve into fiction, or explore poetry, your words will shine with brilliance and intrigue. Even if you simply pen a letter to a relative, rest assured that your message will be captivating and full of life. So, get started!",
      "horoscope_ja": "水瓶座のあなたは、今日、書くことに意識が向くでしょう。あなたは豊かな洞察力を持っており、それを熱心に聞きたいと思っている人たちと共有するのを待っています。雑誌の記事を書くにしても、フィクションに没頭するにしても、詩を探求するにしても、あなたの言葉は輝きと興味をそそる輝きを放つでしょう。たとえ親戚に手紙を書くだけでも、そのメッセージは魅力的で生き生きとしたものになるでしょう。さあ、始めましょう！"
    },
    "pisces": {
      "date": "2026-01-05",
      "sign": "Pisces",
      "horoscope": "Your professional horizons are broadening, Pisces, and you're finding yourself quite occupied. Your earnings are on the upswing, and you may be gaining recognition in your industry. However, you might be contemplating new avenues. The current path may not be one you envision for the long haul. Today is an excellent time to explore new possibilities and gauge the landscape. You could uncover some unexpected opportunities waiting for you.",
      "horoscope_ja": "魚座のあなたは、仕事の視野が広がり、忙しくなりつつあります。収入も上昇傾向にあり、業界での評価も高まっているかもしれません。しかし、新たな道を模索しているかもしれません。今の道は、必ずしも長期的に見通せるものではないかもしれません。今日は、新たな可能性を探り、状況を把握する絶好の機会です。思いがけないチャンスがあなたを待っているかもしれません。"
    }
  }
}