{
  "updated_at": "2026-01-27T16:36:07.218Z",
  "jst_date": "2026-01-28",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-28",
      "sign": "Aries",
      "horoscope": "Today invites you to recline on the grass and gaze at the sky, Aries. Your creative imagination will have no trouble identifying clouds that resemble a dragon, a chair, or even your mother. Invite a friend to join you on the ground and share your discoveries. There's a purpose behind the shapes your mind highlights—uncover valuable insights in this experience.",
      "horoscope_ja": "牡羊座さん、今日は草の上に横になって空を眺めてみましょう。想像力豊かなあなたは、ドラゴンや椅子、あるいはお母さんに似た雲を見つけるのに苦労しないでしょう。友達を誘って一緒に地面に横になり、発見したことを共有してみましょう。あなたの心に浮かぶ形には意味があります。この経験を通して、貴重な洞察を発見してください。"
    },
    "taurus": {
      "date": "2026-01-28",
      "sign": "Taurus",
      "horoscope": "Taurus, you may find yourself irresistibly attracted to what’s just out of reach. Rather than allowing frustration to take hold over your desires, take a moment to reflect on the lessons this situation offers. Consider why these things may not be essential for your happiness. While items with deep sentimental value might feel crucial at the moment, there could be a significant reason for you to release them and embrace new beginnings.",
      "horoscope_ja": "おうし座のあなたは、手の届かないものに抗えないほど惹かれてしまうかもしれません。欲求不満に囚われてしまわないように、この状況から得られる教訓についてじっくり考えてみましょう。なぜそれらのものがあなたの幸せに必ずしも必要ではないのか、考えてみましょう。深い思い入れのあるものは、今は必要不可欠に思えるかもしれませんが、それらを手放して新たな始まりを迎えるための、大きな理由があるかもしれません。"
    },
    "gemini": {
      "date": "2026-01-28",
      "sign": "Gemini",
      "horoscope": "Today, Gemini, you might feel like you're stuck in front of a blank page, struggling to articulate your thoughts. It’s possible that your drive is waning, as your imagination drifts off into the clouds, making it tough to focus. Yet, once you take that first step to write or tackle your tasks, you'll likely find that the words and ideas begin to pour out effortlessly.",
      "horoscope_ja": "ふたご座のあなたは今日、真っ白なページを前にして、自分の考えをうまく表現できないように感じるかもしれません。想像力が雲間から漂い、集中力が低下しているのかもしれません。しかし、一度書き出したり、課題に取り組んだりする最初の一歩を踏み出せば、言葉やアイデアが自然と湧き出てくることに気づくでしょう。"
    },
    "cancer": {
      "date": "2026-01-28",
      "sign": "Cancer",
      "horoscope": "Cancer, if you're feeling the urge to break away from your daily routine, it might be a sign to take a closer look at your life. Rather than seeking ways to escape, focus on how you can enhance your enjoyment of life. Ensure that you are content with who you are and the activities you engage in. If you're not feeling fulfilled, it may be time to consider making some changes.",
      "horoscope_ja": "蟹座のあなた、もし日々のルーティンから抜け出したい衝動に駆られているなら、それは自分の人生をじっくり見つめ直すサインかもしれません。逃げ道を探すのではなく、どうすれば人生をより楽しく過ごせるかを考えてみましょう。自分自身と、自分が取り組んでいる活動に満足していることを確認しましょう。もし充実感を感じていないなら、何かを変えることを検討する時期かもしれません。"
    },
    "leo": {
      "date": "2026-01-28",
      "sign": "Leo",
      "horoscope": "Embrace your joyful nature, Leo, but tread lightly. Ensure that your playful banter and clever jokes don’t come at the cost of someone else's feelings. Such actions could return to bite you down the line. Maintain a positive vibe, particularly when the urge arises to share less-than-kind words about someone. Today is a day where it’s all too easy to say something you might regret later.",
      "horoscope_ja": "レオさん、あなたの明るい性格は大切にしましょう。ただし、慎重に行動しましょう。冗談や気の利いたジョークで、相手の気持ちを害さないようにしましょう。そうした行動は、後々あなた自身に跳ね返ってくる可能性があります。特に、誰かについてあまり親切とは言えない言葉を口にしたくなる衝動に駆られた時は、ポジティブな雰囲気を保ちましょう。今日は、後で後悔するようなことを言ってしまいやすい日です。"
    },
    "virgo": {
      "date": "2026-01-28",
      "sign": "Virgo",
      "horoscope": "Today, Virgo, your feelings might lead you astray, so tread carefully before forming any conclusions. It's wise to pause and collect all the relevant information; otherwise, you risk making a hasty choice that you could come to regret. The circumstances and individuals you meet may exhibit stubbornness, heightened emotions, or unpredictability. If you find this to be the case, it's best to step back and revisit these matters later.",
      "horoscope_ja": "乙女座のあなたは、今日、感情に振り回されてしまうかもしれません。結論を出す前に慎重に行動しましょう。一度立ち止まり、関連する情報をすべて収集するのが賢明です。そうしないと、性急な選択をして後悔するリスクがあります。状況や出会う人によっては、頑固さ、高ぶった感情、予測不可能な行動が見られるかもしれません。もしそう感じたら、少し立ち止まって、後でじっくり考え直すのが賢明です。"
    },
    "libra": {
      "date": "2026-01-28",
      "sign": "Libra",
      "horoscope": "Enhance your interactions with others by balancing them with moments of solitude, Libra. You'll discover that dedicating time to reflect on your own thoughts and feelings will recharge your emotional reserves, allowing you to engage more fully when you're with others. Prioritize your own needs and ensure that your inner peace is nurtured regularly.",
      "horoscope_ja": "天秤座さん、人との交流を深めるには、一人になる時間もバランスよく取り入れましょう。自分の考えや感情をじっくりと見つめ直す時間を持つことで、感情の蓄えが充実し、他の人といる時により深く関わることができるようになります。自分のニーズを優先し、心の平穏を定期的に育むようにしましょう。"
    },
    "scorpio": {
      "date": "2026-01-28",
      "sign": "Scorpio",
      "horoscope": "Dive into a lecture or an engaging discussion today, Scorpio, where individuals are fervently sharing their thoughts and opinions. It's essential for you to connect with the enthusiasm of someone who is deeply committed to their aspirations. Let the passion of others ignite your own inspiration, even if their views differ from yours. And if you feel compelled, don’t hesitate to share your own passionate perspective in return.",
      "horoscope_ja": "蠍座のあなた、今日は講演会や興味深い議論に飛び込んでみましょう。そこでは、人々が熱心に考えや意見を共有しています。自分の夢に深くコミットしている人の熱意に触れることは、あなたにとって不可欠です。たとえ意見が違っていても、他人の情熱があなた自身のインスピレーションを刺激するようにしましょう。そして、もしどうしてもそうしたいと感じたら、あなた自身の情熱的な視点を躊躇せずに共有しましょう。"
    },
    "sagittarius": {
      "date": "2026-01-28",
      "sign": "Sagittarius",
      "horoscope": "Sagittarius, your mind is likely wandering to distant realms today, and you might catch yourself lost in daydreams more often than not. While these flights of fancy may occasionally disrupt your typical logical approach to daily tasks, it's important to recognize that these visions hold significance. Embrace them and strive to understand their insights, weaving their wisdom into your everyday reality.",
      "horoscope_ja": "射手座のあなた、今日は心が遥かな世界へとさまよい、白昼夢に浸っていることに気づくことが多いかもしれません。こうした空想は、時折、日常の課題に対する論理的なアプローチを乱すかもしれませんが、これらのビジョンには重要な意味があることを認識することが重要です。それらを受け入れ、その洞察を理解しようと努め、その知恵を日々の生活に織り込んでいきましょう。"
    },
    "capricorn": {
      "date": "2026-01-28",
      "sign": "Capricorn",
      "horoscope": "Capricorn, keep in mind that every element in your surroundings holds a spirit. The absence of sensory perception doesn't negate the existence of these energies. Acknowledge the vibrant force that envelops us, along with the living and non-living entities that populate your daily experience. Today, you may find yourself viewing life through a lens of reverence, as if each moment is a sacred prayer.",
      "horoscope_ja": "山羊座のあなた、あなたの周りのあらゆる要素に魂が宿っていることを心に留めておいてください。感覚がなくても、これらのエネルギーの存在が否定されるわけではありません。私たちを包み込む活気に満ちた力、そして日々の生活に溢れる生物や無生物の存在に気づきましょう。今日は、まるで一瞬一瞬が神聖な祈りであるかのように、畏敬の念を込めたレンズを通して人生を見つめている自分に気づくかもしれません。"
    },
    "aquarius": {
      "date": "2026-01-28",
      "sign": "Aquarius",
      "horoscope": "Aquarius, it's time to spread your joy, love, and enthusiasm with those in your circle. Channel your energy into a collaborative project, where together you can craft something truly special and significant—far beyond what you could achieve solo. Remember, you are not isolated in this journey; engaging closely with others who share your values will reveal valuable lessons and insights.",
      "horoscope_ja": "水瓶座のあなた、喜び、愛、そして情熱を周りの人たちに広げる時です。あなたのエネルギーを共同プロジェクトに注ぎ込み、一人では成し遂げられない、真に特別で意義深い何かを共に作り上げましょう。この旅路において、あなたは孤独ではありません。価値観を共有する人々と密接に交流することで、貴重な教訓や洞察が得られるでしょう。"
    },
    "pisces": {
      "date": "2026-01-28",
      "sign": "Pisces",
      "horoscope": "Pisces, you may find your emotions swinging wildly today, leading you to question some of your instincts or feelings. Rather than letting frustration take over as you struggle to make sense of these emotional waves, embrace the journey they bring. The ability to feel deeply and express those feelings is a wonderful blessing. Avoid the temptation to bottle up or ignore what you're experiencing. If today feels like a thrilling roller coaster, resist the urge to jump off midway; it's wiser to stay seated and ride it out until the very end.",
      "horoscope_ja": "魚座のあなたは、今日は感情が激しく揺れ動き、自分の本能や感覚に疑問を抱くかもしれません。こうした感情の波を理解しようともがき、フラストレーションに支配されるのではなく、感情がもたらす旅路を受け入れましょう。深く感じ、それを表現できる能力は、素晴らしい恵みです。今の経験を抑え込んだり、無視したりしようとする誘惑に負けないでください。もし今日がスリリングなジェットコースターのように感じたら、途中で飛び降りたい衝動を抑え、最後まで席に座ったまま乗り切る方が賢明です。"
    }
  }
}