{
  "updated_at": "2026-01-25T16:31:32.813Z",
  "jst_date": "2026-01-26",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2026-01-26",
      "sign": "Aries",
      "horoscope": "Aries, your polite demeanor and community-focused perspective often hold you back from expressing bold ideas or sporting a unique look. However, today is the perfect opportunity to embrace your individuality in every sense. Show the world your true self by doing something surprising that captures attention. Find a way to shine that feels right for you and let your uniqueness take center stage.",
      "horoscope_ja": "牡羊座さん、あなたは礼儀正しい態度とコミュニティ重視の視点から、大胆なアイデアを表現したり、個性的なスタイルに挑戦したりすることをためらってしまうことがよくあります。しかし、今日はあらゆる意味で個性を受け入れる絶好の機会です。注目を集めるような驚きの行動で、本当の自分を世界に示しましょう。自分らしく輝く方法を見つけ、個性を際立たせましょう。"
    },
    "taurus": {
      "date": "2026-01-26",
      "sign": "Taurus",
      "horoscope": "Taurus, you might find yourself facing criticism from those who are unhappy with how you're managing certain aspects of your life. It's important to remember that the individuals who are most vocal about their discontent often lack a true understanding of your perspective. They may be operating on a different frequency altogether. Don't feel obligated to alter your approach to appease them, nor should you take their opinions to heart.",
      "horoscope_ja": "おうし座のあなたは、人生の特定の側面の扱い方に不満を持つ人々から批判を受けるかもしれません。不満を声高に訴える人は、往々にしてあなたの視点を真に理解していないことを覚えておくことが重要です。彼らは全く異なる周波数で動いているのかもしれません。彼らをなだめるために自分のアプローチを変える必要はありませんし、彼らの意見を鵜呑みにする必要もありません。"
    },
    "gemini": {
      "date": "2026-01-26",
      "sign": "Gemini",
      "horoscope": "Gemini, you might be feeling an unexpected surge of joy today. If that’s not the case, take a moment to reflect on your feelings. It’s likely that any unease you’re experiencing stems from a sense of confinement in your life. You could be feeling emotionally shackled or mentally stifled. It might be time to consider a change in your circumstances. Use today to explore avenues that can help you reclaim your sense of freedom.",
      "horoscope_ja": "ふたご座のあなたは、今日は思いがけない喜びの波を感じているかもしれません。もしそうでないなら、少し時間を取って自分の気持ちを振り返ってみてください。あなたが感じている不安は、人生における閉塞感から生じている可能性が高いです。感情的に束縛されている、あるいは精神的に息苦しいと感じているのかもしれません。状況を変えることを考える時期かもしれません。今日という日を、自由を取り戻すための道を探る機会として活用してください。"
    },
    "cancer": {
      "date": "2026-01-26",
      "sign": "Cancer",
      "horoscope": "Now is an excellent opportunity for you to sign up for a magazine or newsletter that aligns with your interests, Cancer. The key theme for today is \"new.\" Stay engaged with fresh updates that ignite your curiosity and provide the motivation you need to pursue your aspirations.",
      "horoscope_ja": "蟹座さん、今こそあなたの興味に合った雑誌やニュースレターを購読する絶好の機会です。今日のキーワードは「新しいこと」です。好奇心を刺激し、夢を追求するためのモチベーションを与えてくれるような、新鮮な情報に常に目を向けてください。"
    },
    "leo": {
      "date": "2026-01-26",
      "sign": "Leo",
      "horoscope": "Leo, you likely feel a strong urge to lead, and you definitely have what it takes to do so. So why hesitate? It's time to stop waiting for others to make up their minds. While they are busy debating and second-guessing, you could be forging ahead and making significant progress. Trust your instincts and embrace your independent spirit!",
      "horoscope_ja": "しし座さん、あなたはきっとリーダーシップを発揮したいという強い衝動に駆られているでしょう。そして、その資質も間違いなく備えています。だから、ためらう必要はありません。周りの人が決断を下すのを待つのはもうやめましょう。彼らが議論に明け暮れ、ためらっている間に、あなたは前に進み、大きな進歩を遂げているかもしれません。自分の直感を信じ、自立心を大切にしましょう！"
    },
    "virgo": {
      "date": "2026-01-26",
      "sign": "Virgo",
      "horoscope": "Virgo, keep in mind that your self-worth is in your hands. Today, it may feel like others are attempting to overshadow you with their insights on life and leadership. Resist the urge to doubt your own thoughts and perspectives; they are just as valuable. However, remember to remain receptive and considerate of the viewpoints of those around you.",
      "horoscope_ja": "おとめ座のあなた、あなたの自尊心はあなた自身の手の中にあることを忘れないでください。今日は、人生やリーダーシップに関する洞察力で他人があなたを圧倒しようとしているように感じるかもしれません。自分の考えや視点を疑う衝動を抑えてください。それらも同様に価値のあるものです。しかし、周囲の人々の視点には常に耳を傾け、思いやりを持つことを忘れないでください。"
    },
    "libra": {
      "date": "2026-01-26",
      "sign": "Libra",
      "horoscope": "Libra, if you're still relying on outdated tools for your tasks, it's time for an upgrade. Consider investing in that powerful machinery that can handle your workload swiftly and effectively. In essence, focus on enhancing your efficiency. Don't hesitate to spend on items that will simplify your life and bring you comfort. The day's natural rhythm is likely to guide you precisely where you need to be.",
      "horoscope_ja": "天秤座さん、もしあなたがまだ時代遅れのツールに頼っているなら、アップグレードの時期です。仕事量を迅速かつ効率的に処理できる強力な機器への投資を検討してみてください。つまり、効率性を高めることに焦点を当てましょう。生活をシンプルにし、快適さをもたらすアイテムには、ためらわずにお金を使いましょう。一日の自然なリズムが、あなたを必要な場所に導いてくれるはずです。"
    },
    "scorpio": {
      "date": "2026-01-26",
      "sign": "Scorpio",
      "horoscope": "Scorpio, make sure to stay well-hydrated by drinking plenty of water today. It's essential for your well-being, and you may not be consuming enough. Your sensitivity is heightened, so prioritizing self-care is crucial. If you neglect this, you might find yourself feeling overly emotional and susceptible to others' influences. Keep your distance from those who drain your energy.",
      "horoscope_ja": "蠍座のあなた、今日は水分をしっかり摂りましょう。水は健康に欠かせないものですが、もしかしたら十分に摂れていないかもしれません。感受性が高まっているので、セルフケアを最優先にすることが重要です。これを怠ると、感情的になりすぎて、他人の影響を受けやすくなってしまうかもしれません。あなたのエネルギーを奪うような人とは距離を置きましょう。"
    },
    "sagittarius": {
      "date": "2026-01-26",
      "sign": "Sagittarius",
      "horoscope": "Today, Sagittarius, you might find yourself in a remarkable connection with someone, where it feels like you can almost anticipate their thoughts. You may have a knack for predicting their words before they even speak. Your mind is likely racing ahead, allowing you to grasp concepts and ideas far beyond the current conversation. Make sure to channel this mental agility into something productive!",
      "horoscope_ja": "射手座のあなたは今日、誰かと素晴らしい関係を築くかもしれません。まるで相手の考えを予測できるような感覚です。相手が口を開く前に、言葉を予測する才能があるかもしれません。あなたの思考は先を見通し、会話の内容をはるかに超えた概念やアイデアを捉えることができるでしょう。この機敏な思考力を、何か生産的なことに活かしましょう！"
    },
    "capricorn": {
      "date": "2026-01-26",
      "sign": "Capricorn",
      "horoscope": "Capricorn, today is the perfect moment to set aside those nostalgic emotions and embrace fresh beginnings. Resist the urge to dig through old photo albums and dwell on the past, as it may lead you to a sea of tears that’s hard to escape. Instead, focus on what lies ahead and start crafting plans for new adventures with your loved ones that will bring joy and fulfillment.",
      "horoscope_ja": "山羊座のあなた、今日はノスタルジックな感情を脇に置き、新たな始まりを迎えるのに最適な時です。古い写真アルバムを漁ったり、過去にこだわったりする衝動を抑えましょう。それは、抜け出せない涙の海へとあなたを導くかもしれません。代わりに、未来に目を向け、愛する人たちと喜びと充実感をもたらす新しい冒険の計画を立て始めましょう。"
    },
    "aquarius": {
      "date": "2026-01-26",
      "sign": "Aquarius",
      "horoscope": "Unleash your inner innovator today, Aquarius! You might find yourself brimming with inventive thoughts that have the potential to change the world. Don’t hesitate to share these groundbreaking ideas with those around you and gauge their reactions. You’ll likely be drawn to the most avant-garde concepts, so focus your energy on pursuing and developing these exciting possibilities.",
      "horoscope_ja": "水瓶座のあなた、今日はあなたの内なるイノベーター精神を解き放ちましょう！世界を変えるほどの独創的なアイデアが溢れているかもしれません。その革新的なアイデアをためらわずに周りの人たちと共有し、彼らの反応を確かめてみてください。あなたはおそらく最も先進的なコンセプトに惹かれるでしょう。ですから、これらの刺激的な可能性を追求し、発展させることにエネルギーを集中させましょう。"
    },
    "pisces": {
      "date": "2026-01-26",
      "sign": "Pisces",
      "horoscope": "Today, Pisces, you might find yourself feeling a bit overwhelmed as your to-do list seems to grow rather than shrink. This is likely a result of unexpected events and interruptions that are beyond your control. Remember, it's important not to be hard on yourself for things you can't influence. To navigate the day more smoothly, try to carve out some extra time for the activities you enjoy, as these interruptions are likely to persist.",
      "horoscope_ja": "魚座のあなたは今日、ToDoリストが減るどころか増えていくように感じ、少し圧倒されていると感じるかもしれません。これは、予期せぬ出来事や、自分ではコントロールできない中断の結果である可能性が高いです。自分の力ではどうにもならないことで自分を責めないことが大切です。一日をよりスムーズに過ごすために、これらの中断は今後も続く可能性が高いので、好きな活動に少し余裕を持って時間を割くようにしましょう。"
    }
  }
}