{
  "updated_at": "2025-12-03T16:35:28.679Z",
  "jst_date": "2025-12-04",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-04",
      "sign": "Aries",
      "horoscope": "This evening, you might find yourself hosting a gathering that delves into spiritual or metaphysical themes. The collective energy of the group is likely to help you achieve your shared goals. With intuition, vibrant energy, and creativity in the air, you'll forge deeper connections with those you choose to be with today, whether they are friends, partners, or coworkers. Be sure to jot down your reflections and revelations tonight to capture these valuable insights.",
      "horoscope_ja": "今晩、あなたはスピリチュアルや形而上学的なテーマを掘り下げる集まりを主催するかもしれません。グループの集合的なエネルギーは、共通の目標達成を後押ししてくれるでしょう。直感、活力、そして創造性が溢れる中で、友人、パートナー、同僚など、今日一緒に過ごすことを選んだ人々とのより深い絆が築かれるでしょう。貴重な洞察を捉えるために、今夜の反省や気づきを必ず書き留めてください。"
    },
    "taurus": {
      "date": "2025-12-04",
      "sign": "Taurus",
      "horoscope": "Today, you may find yourself drawn to group events focused on spiritual, metaphysical, or humanitarian themes in your vicinity. This is a wonderful opportunity to connect with new people, and if you're single, you might just encounter someone who piques your interest. Make sure to present your best self! As the day progresses, your mind will be abuzz with thoughts, so consider a brief workout before bedtime to help you unwind and drift off to sleep.",
      "horoscope_ja": "今日は、近所で開催されるスピリチュアル、形而上学、あるいは人道的なテーマのグループイベントに惹かれるかもしれません。これは新しい人と出会う絶好の機会であり、独身の方なら、興味をそそられる人に出会えるかもしれません。最高の自分を見せることが大切です！一日が進むにつれて、頭の中は様々な考えでいっぱいになるでしょう。寝る前に軽く運動してリラックスし、眠りに落ちましょう。"
    },
    "gemini": {
      "date": "2025-12-04",
      "sign": "Gemini",
      "horoscope": "Today, you may encounter new professional connections that open doors to a career in the realms of psychic, spiritual, or healing practices, or even in creative fields like painting, writing, or other fine arts. Take some time to reflect on these opportunities. Your innate abilities are particularly sharp right now, and you might be considering further training to enhance your skills. Lean on the encouragement of friends and community groups, as their support could be incredibly beneficial.",
      "horoscope_ja": "今日、あなたは新しい仕事上のつながりに出会うかもしれません。それは、心霊術、スピリチュアル、ヒーリングといった分野、あるいは絵画、執筆、その他の美術といったクリエイティブな分野でのキャリアへの扉を開くかもしれません。少し時間を取って、これらの機会についてじっくり考えてみてください。あなたの生まれ持った才能は今、特に鋭敏なので、スキルアップのためにさらなるトレーニングを検討してみてはいかがでしょうか。友人やコミュニティグループの励ましを頼りにしましょう。彼らのサポートは非常に役立つでしょう。"
    },
    "cancer": {
      "date": "2025-12-04",
      "sign": "Cancer",
      "horoscope": "Today, spiritual themes take center stage in your life. You may feel drawn to delve into a spiritual or metaphysical practice that resonates with you. Friends or a community may wish to accompany you on this journey. Collaborating with others could ignite your creativity, intellect, and inner self. As the day winds down, take a moment to jot down your reflections. Consider going for a long walk to clear your mind, ensuring a restful night's sleep.",
      "horoscope_ja": "今日、スピリチュアルなテーマがあなたの人生の中心を占めています。心に響くスピリチュアルな、あるいは形而上学的な実践に深く入り込みたくなるかもしれません。友人やコミュニティが、この旅に同行してくれるかもしれません。他者との協働は、あなたの創造性、知性、そして内なる自己を刺激するかもしれません。一日が終わりに近づいたら、少し時間を取って、自分の考えを書き留めてみましょう。心を落ち着かせ、ぐっすり眠れるように、長い散歩に出かけてみるのも良いでしょう。"
    },
    "leo": {
      "date": "2025-12-04",
      "sign": "Leo",
      "horoscope": "Your spiritual side is strong, but today your thoughts may wander to different realms. Expect a surge of insights and revelations that you may feel compelled to channel into creative expression. Your romantic and personal relationships are infused with a fresh karmic energy. Engaging in meditation could provide clarity, and exploring techniques like past-life regression or rebirthing might also be beneficial. If those options aren't available, consider jotting down your reflections.",
      "horoscope_ja": "精神的な側面は強いですが、今日は思考が様々な領域へとさまようかもしれません。創造的な表現へと導きたくなるような、洞察や啓示が次々と湧き起こるでしょう。恋愛関係や個人的な関係に、新たなカルマのエネルギーが注ぎ込まれます。瞑想に取り組むことで、思考が明晰になるかもしれません。また、前世回帰やリバースといったテクニックを試してみるのも効果的かもしれません。もしこれらの方法が使えない場合は、自分の考えを書き留めてみるのも良いでしょう。"
    },
    "virgo": {
      "date": "2025-12-04",
      "sign": "Virgo",
      "horoscope": "Today, the presence of others holds significant weight in your life. Thoughts of romance are likely to swirl around you, influencing friendships, business collaborations, and various relationships. Your exchanges are filled with warmth, kindness, and encouragement. Expect romantic emotions to reach a near-fairytale level. Take the time to perceive people for who they truly are, rather than through rose-colored glasses.",
      "horoscope_ja": "今日、あなたの人生において、他者の存在は大きな意味を持ちます。恋愛への思いが渦巻き、友情、ビジネスでのコラボレーション、そして様々な人間関係に影響を与えるでしょう。交流は温かさ、優しさ、そして励ましに満ち溢れるでしょう。ロマンチックな感情が、まるでおとぎ話のようなレベルに達するでしょう。バラ色の眼鏡を通してではなく、相手の本当の姿を見る時間を取りましょう。"
    },
    "libra": {
      "date": "2025-12-04",
      "sign": "Libra",
      "horoscope": "Today, you may find yourself on the hunt for that ideal job, particularly in a creative or healing profession. Whether you have a particular role in mind or are exploring multiple options, take the time to thoroughly evaluate each opportunity. Remember, what seems like a dream job at first glance may have unforeseen challenges lurking beneath the surface.",
      "horoscope_ja": "今日、あなたは理想の仕事、特にクリエイティブな仕事やヒーリング系の仕事を探しているかもしれません。特定の役割を念頭に置いている場合でも、複数の選択肢を検討している場合でも、それぞれの機会をじっくりと評価する時間を取りましょう。一見夢のような仕事でも、その裏には予期せぬ課題が潜んでいる可能性があることを忘れないでください。"
    },
    "scorpio": {
      "date": "2025-12-04",
      "sign": "Scorpio",
      "horoscope": "A budding or ongoing relationship may deepen with a spiritual connection, enhancing your bond. The wisdom of renowned figures from distant cultures may ignite your creative passion. You might find that spirituality becomes increasingly significant in your life. Consider dedicating time to meditation or learning. Exploring past-life regression or engaging in guided meditation could offer valuable insights.",
      "horoscope_ja": "芽生えたばかりの関係や現在進行中の関係は、精神的な繋がりによって深まり、絆が強まるかもしれません。遠い文化圏の著名な人物たちの知恵が、あなたの創造的な情熱に火をつけるかもしれません。スピリチュアリティが人生においてますます重要になるかもしれません。瞑想や学習に時間を割いてみてはいかがでしょうか。前世回帰やガイド付き瞑想を体験することで、貴重な洞察が得られるかもしれません。"
    },
    "sagittarius": {
      "date": "2025-12-04",
      "sign": "Sagittarius",
      "horoscope": "Your dreams and moments of reflection might unveil hidden feelings from your past that have unknowingly hindered your progress. The themes of seeking and offering forgiveness could become particularly significant now. Expect your romantic life to be filled with heightened passion. These intense emotions may also spark your creativity, inspiring you to beautify your living space.",
      "horoscope_ja": "夢や内省の瞬間を通して、知らず知らずのうちにあなたの進歩を妨げてきた過去の隠れた感情が明らかになるかもしれません。許しを求め、許すというテーマは、今特に重要になるかもしれません。恋愛生活は情熱に満ち溢れるでしょう。こうした激しい感情は、あなたの創造性を刺激し、生活空間を美しく飾るインスピレーションとなるかもしれません。"
    },
    "capricorn": {
      "date": "2025-12-04",
      "sign": "Capricorn",
      "horoscope": "If you're currently single, keep your eyes peeled for unexpected romantic opportunities today, possibly right in your own neighborhood. Even if you're already in a relationship, you might find yourself forming a new friendship. There's a good chance you'll encounter someone intriguing while out and about, especially in lively, outdoor settings. So, despite any dreary weather, it's not the day to hunker down indoors. Step outside and discover what the Universe has planned for you!",
      "horoscope_ja": "もしあなたが現在独身なら、今日は思いがけないロマンスのチャンスに目を光らせてください。もしかしたら、あなたの近所で起こるかもしれません。既に恋人がいる場合でも、新しい友情が芽生えるかもしれません。外出中、特に賑やかな屋外で、魅力的な人に出会う可能性は十分にあります。ですから、どんなに憂鬱な天気でも、家の中に閉じこもっている日ではありません。外に出て、宇宙があなたに何を計画しているかを発見しましょう！"
    },
    "aquarius": {
      "date": "2025-12-04",
      "sign": "Aquarius",
      "horoscope": "Today, your perspective on values may shift towards more spiritual and idealistic dimensions. Everyday tasks might reveal deeper significance for you, and you may find a sense of spirituality woven into your work. While you might be tempted to set lofty and perhaps impractical health goals, remember to approach any new wellness routine gradually. Focus on taking small, manageable steps rather than overwhelming yourself with too much at once.",
      "horoscope_ja": "今日、あなたの価値観はより精神的で理想主義的な側面へとシフトするかもしれません。日々の作業があなたにとってより深い意味を持つようになり、仕事の中にスピリチュアルな感覚が織り込まれているのを感じるかもしれません。高尚で非現実的な健康目標を立てたくなるかもしれませんが、新しい健康習慣は少しずつ始めることを忘れないでください。一度に多くのことを詰め込みすぎるのではなく、小さくて実行可能なステップを踏むことに集中しましょう。"
    },
    "pisces": {
      "date": "2025-12-04",
      "sign": "Pisces",
      "horoscope": "Today, the people in your life are likely to hold greater importance than ever. You may encounter fascinating individuals, and if you're single, love could be just around the corner. Both old friends and new acquaintances might appear more enchanting and perfect than usual. Your romantic connections could take on a dreamy, storybook vibe. Remember to make a conscious effort to appreciate others for who they truly are.",
      "horoscope_ja": "今日、あなたの人生における人々は、これまで以上に大切な存在になるでしょう。魅力的な人に出会うかもしれませんし、独身なら愛がすぐそこまで来ているかもしれません。古い友人も新しい知り合いも、いつも以上に魅力的で完璧に見えるかもしれません。恋愛関係は、夢のような、おとぎ話のような雰囲気を帯びるかもしれません。相手のありのままの姿を認めるよう、意識的に努力することを忘れないでください。"
    }
  }
}