{
  "updated_at": "2025-11-25T16:33:26.987Z",
  "jst_date": "2025-11-26",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-26",
      "sign": "Aries",
      "horoscope": "Today's celestial influences could stir up intense feelings. You might notice your friends clashing and engaging in disputes. It's wise to keep your distance! Focus on resolving the underlying issues that are causing the friction instead of attempting to manage the chaos. Stay strong!",
      "horoscope_ja": "今日の天体の影響で、激しい感情がかき立てられるかもしれません。友人同士が衝突したり、言い争いになったりするかもしれません。距離を置くのが賢明です！混乱をコントロールしようとせず、摩擦の原因となっている根本的な問題を解決することに集中しましょう。強い気持ちで！"
    },
    "taurus": {
      "date": "2025-11-26",
      "sign": "Taurus",
      "horoscope": "You may find yourself in the midst of a discussion with those close to you about spiritual or metaphysical ideas, which could lead to some tension. This isn't the ideal moment for you to step in as a peacemaker, as both sides are quite entrenched in their beliefs. Instead, it would be wise to gently steer the conversation away from this topic and suggest a different subject altogether.",
      "horoscope_ja": "身近な人とスピリチュアルな、あるいは形而上学的な考えについて議論している最中、緊張が生じる可能性があります。どちらの側も自分の信念に固執しているため、あなたが仲裁役として介入するのは理想的なタイミングではありません。むしろ、この話題から優しく逸らし、全く別の話題を提案するのが賢明でしょう。"
    },
    "gemini": {
      "date": "2025-11-26",
      "sign": "Gemini",
      "horoscope": "Tensions and differing opinions might obstruct the progress of a significant project today. There could be a specific aspect of the plan that is causing friction among team members. Rather than trying to convince everyone to adopt the same perspective, consider revising the plan to accommodate different viewpoints. With emotions running high, it’s crucial to listen to others and respond thoughtfully. Keep a level head and stay impartial!",
      "horoscope_ja": "緊張や意見の相違が、今日、重要なプロジェクトの進捗を阻害する可能性があります。計画の特定の側面がチームメンバー間の摩擦を引き起こしている可能性があります。全員に同じ視点を取り入れようとするのではなく、異なる視点を取り入れるよう計画を見直すことを検討してください。感情が高ぶっている時は、他の人の意見に耳を傾け、思慮深く対応することが重要です。冷静さを保ち、公平な立場を保ちましょう。"
    },
    "cancer": {
      "date": "2025-11-26",
      "sign": "Cancer",
      "horoscope": "Last night may have kept you out later than ideal, leaving you feeling a bit worn out today. Remember to nourish your body with vitamins and resist the urge to rely on coffee for a boost. Instead, consider taking a brisk walk to refresh your mind and release some endorphins—it’s a great way to elevate your mood. This will help you regain your usual sharpness. Just be cautious that these late nights don’t turn into a regular occurrence!",
      "horoscope_ja": "昨晩は理想よりも遅くまで起きていて、今日は少し疲れているかもしれません。ビタミンで体をしっかり養い、コーヒーに頼りたいという衝動を抑えましょう。代わりに、軽く散歩して頭をリフレッシュし、エンドルフィンを分泌させましょう。気分を高めるのに最適な方法です。いつもの明晰な感覚を取り戻すのに役立ちます。ただし、夜更かしが習慣にならないように注意してください。"
    },
    "leo": {
      "date": "2025-11-26",
      "sign": "Leo",
      "horoscope": "Today, your feelings might obscure your instincts. You may find it challenging to sense the emotions and thoughts of those around you as you usually do, which could leave you feeling a bit off balance. Remember, this is just a fleeting phase. For now, lean on your reasoning skills. This approach could prove beneficial in the long run, as the best insights often arise when intuition is paired with rational thought.",
      "horoscope_ja": "今日は、感情が本能を鈍らせてしまうかもしれません。普段のように周囲の人の感情や考えを察知することが難しく、少しバランスを崩してしまうかもしれません。しかし、これは一時的なものだということを忘れないでください。今は、論理的な思考に頼りましょう。このアプローチは長期的に見て有益となるでしょう。なぜなら、直感と理性的な思考が組み合わさった時に、最高の洞察が生まれることが多いからです。"
    },
    "virgo": {
      "date": "2025-11-26",
      "sign": "Virgo",
      "horoscope": "You may find yourself brimming with passion today, yearning for some quality time with your loved one. However, your partner could be preoccupied with other commitments or simply not in the right frame of mind. While this might lead to some frustration, try not to take it personally. It’s not a rejection, even if it feels like it. Consider planning a date for tomorrow instead—better late than never!",
      "horoscope_ja": "今日は情熱が溢れ、愛する人と充実した時間を過ごしたいと思っているかもしれません。しかし、パートナーは他の予定で忙しくしていたり、単に気分が乗らなかったりするかもしれません。少しイライラするかもしれませんが、個人的な問題として捉えないようにしましょう。たとえそう感じたとしても、それは拒絶ではありません。代わりに明日のデートの計画を立ててみてはいかがでしょうか。遅くても、やらないよりはましですから！"
    },
    "libra": {
      "date": "2025-11-26",
      "sign": "Libra",
      "horoscope": "It seems your partner was supposed to visit you this evening, but they might not arrive or even reach out. This could understandably lead to some concern on your part. Try not to let your imagination run wild; all indications suggest that your loved one is safe. The most probable reason for the delay is traffic. Additionally, a friend of yours may also arrive much later than anticipated.",
      "horoscope_ja": "パートナーは今晩あなたに会いに来るはずだったようですが、来ない、あるいは連絡すら来ないかもしれません。当然ながら、あなたは少し心配になるかもしれません。しかし、想像を膨らませすぎないようにしてください。あらゆる兆候から、あなたのパートナーは無事のようです。遅れた理由は交通渋滞である可能性が最も高いです。また、あなたの友人が予定よりかなり遅れて到着する可能性もあります。"
    },
    "scorpio": {
      "date": "2025-11-26",
      "sign": "Scorpio",
      "horoscope": "You may find that a key person you need to reach out to for information is currently out of reach. This could lead you to seek answers elsewhere, which might prove to be a challenge. You may end up in a loop, being directed back to the very person you can't connect with. It might be wise to set this issue aside for now and focus your energy on other tasks.",
      "horoscope_ja": "情報を得るために連絡を取るべき重要な人物が、現在連絡が取れない状況にあるかもしれません。そのため、他の場所で答えを探すことになり、それが困難になる可能性があります。結局、連絡が取れない人物に再び連絡が回ってくるという悪循環に陥ってしまうかもしれません。今はこの問題を脇に置いて、他のタスクにエネルギーを集中するのが賢明かもしれません。"
    },
    "sagittarius": {
      "date": "2025-11-26",
      "sign": "Sagittarius",
      "horoscope": "Your financial situation is likely looking brighter than it has in quite some time, yet you may still find yourself falling short of certain financial aspirations you've established. This could weigh heavily on your thoughts today. Be cautious not to let this pressure overwhelm you. Instead, consider taking a more composed approach to accelerate your progress. You have the ability to achieve your goals.",
      "horoscope_ja": "あなたの経済状況は、ここしばらくで最も明るくなっているように見えるかもしれませんが、それでも、あなたが立てた経済的な目標のいくつかには、まだ届いていないかもしれません。今日は、それがあなたの心に重くのしかかるかもしれません。このプレッシャーに押しつぶされないように注意してください。むしろ、より冷静なアプローチで、前進を加速させることを検討してください。あなたには目標を達成する力があります。"
    },
    "capricorn": {
      "date": "2025-11-26",
      "sign": "Capricorn",
      "horoscope": "You might find yourself caught in the middle of a dispute involving your parents or a couple you’re close to, and there may be pressure for you to choose a side. Resist that urge! It’s wiser to remain neutral and allow them to resolve their differences on their own, while gently expressing your affection for both parties. In this situation, your role could be to facilitate a compromise, but achieving a solution that satisfies everyone may prove challenging.",
      "horoscope_ja": "両親や親しいカップルとの争いに巻き込まれ、どちらかの側につくようプレッシャーをかけられることもあるでしょう。そんな衝動を抑えましょう！どちら側も中立を保ち、お互いが意見の相違を解決できるように見守るのが賢明です。そして、どちらに対しても優しく愛情を伝えましょう。このような状況では、あなたの役割は妥協点を導くことかもしれませんが、全員が納得できる解決策を見つけるのは難しいかもしれません。"
    },
    "aquarius": {
      "date": "2025-11-26",
      "sign": "Aquarius",
      "horoscope": "A familiar face in your life may be expressing one sentiment, but your gut feeling suggests otherwise. It’s likely that your friend is grappling with an uncomfortable issue. Avoid probing for details; the truth will reveal itself when the time is right. If you wish to lend a hand, consider treating your friend to dinner or a movie. This could provide a welcome distraction and lighten the mood for both of you.",
      "horoscope_ja": "身近な人が、ある感情を表に出しているのに、あなたの直感は違うかもしれません。もしかしたら、その友人は何か気まずい問題を抱えているのかもしれません。詳細を探るのは避けましょう。真実は時が来れば明らかになるでしょう。もしあなたが手を貸したいのであれば、友人を夕食や映画に誘ってみてはいかがでしょうか。気分転換になり、お互いの気分が明るくなるかもしれません。"
    },
    "pisces": {
      "date": "2025-11-26",
      "sign": "Pisces",
      "horoscope": "A woman in your circle may appear to be harboring some discontent, though she might not openly acknowledge it. If you inquire about her feelings, she’s likely to respond with a casual \"Nothing.\" Trust your instincts to uncover what’s troubling her, and consider ways to mend the situation. It could also be a good time to reflect on the nature of your friendship; her lack of communication might suggest that she fits the role of an acquaintance more than that of a true friend.",
      "horoscope_ja": "あなたの周りの女性は、何か不満を抱えているように見えるかもしれませんが、それを公言していないかもしれません。彼女の気持ちを尋ねると、「何もない」とさりげなく答えるでしょう。直感を信じて、彼女の何が問題なのかを突き止め、状況を改善する方法を考えてみましょう。また、友情の本質を振り返るのも良いかもしれません。彼女のコミュニケーション不足は、真の友人というよりは、単なる知り合いの役割に過ぎないのかもしれません。"
    }
  }
}