{
  "updated_at": "2025-11-10T02:04:45.959Z",
  "jst_date": "2025-11-10",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-10",
      "sign": "Aries",
      "horoscope": "You could find yourself organizing a gathering or social event today. Expect your attendees to have a flair for the arts or a deep spiritual side. The night promises to be both enjoyable and uplifting. To ensure everything goes smoothly, double-check that all your essentials are ready, from light fixtures to kitchen tools. You wouldn't want any small hiccups to spoil the fun.",
      "horoscope_ja": "今日は、集まりや社交イベントを企画することになるかもしれません。参加者には芸術的な才能や深いスピリチュアルな側面を持つ人が期待できます。楽しい夜になり、気分も高揚することでしょう。すべてがスムーズに進むように、照明器具からキッチンツールまで、必要なものがすべて揃っているか、もう一度確認してください。ちょっとしたトラブルで楽しい時間を台無しにしたくないですよね。"
    },
    "taurus": {
      "date": "2025-11-10",
      "sign": "Taurus",
      "horoscope": "Today is the perfect opportunity to dive into your writing endeavors. Your intellect is keen, and your creativity is flowing. You may notice some unexpected yet mostly favorable happenings in your local area. However, be cautious, as the details might be unclear and rumors could be flying around. Hold off on forming any judgments until you have a clearer picture of the situation.",
      "horoscope_ja": "今日は執筆活動に没頭する絶好の機会です。知性が鋭敏になり、創造力が湧き出てきます。地元で予期せぬ出来事がいくつか起こるかもしれません。しかし、詳細は不明瞭で、噂が飛び交っている可能性もあるので、注意が必要です。状況がより明確になるまでは、判断を控えましょう。"
    },
    "gemini": {
      "date": "2025-11-10",
      "sign": "Gemini",
      "horoscope": "Financial affairs are on a positive trajectory, yet you may not feel as confident about them as you ought to. An overlooked skill of yours—possibly in the realms of creativity, healing, technology, or a combination of these—might emerge. Consider seeking opportunities to develop this talent further. Exploring various paths could lead to unexpected choices that may pleasantly surprise you.",
      "horoscope_ja": "経済状況は好調ですが、本来あるべき自信が持てないかもしれません。創造性、ヒーリング、テクノロジー、あるいはこれらの組み合わせなど、これまで見過ごされてきた才能が開花するかもしれません。この才能をさらに伸ばす機会を探ってみてはいかがでしょうか。様々な道を模索することで、思いがけない選択に繋がり、嬉しい驚きを感じるかもしれません。"
    },
    "cancer": {
      "date": "2025-11-10",
      "sign": "Cancer",
      "horoscope": "Today, you may find yourself brimming with idealism, creativity, and a heightened sense of intuition. Your presence radiates a captivating energy that draws in admiration and attention, more than you might typically experience. In matters of the heart, things are looking bright, as a magical vibe envelops your life. Savor this enchanting moment while it lasts, as the everyday grind will return soon enough!",
      "horoscope_ja": "今日は、理想主義、創造性、そして鋭敏な直感に溢れているかもしれません。あなたの存在は、普段では考えられないほどの、人々の称賛と注目を集める、魅惑的なエネルギーを放っています。恋愛面では、魔法のような雰囲気があなたの人生を包み込み、物事は明るい兆しを見せています。この魅惑的な瞬間を今のうちから味わい尽くしてください。すぐに日常が戻ってきますから！"
    },
    "leo": {
      "date": "2025-11-10",
      "sign": "Leo",
      "horoscope": "Today, you may find yourself drifting in a dreamy, romantic haze, as if you're floating among the clouds. Everything around you might appear idyllic and enchanting—almost too good to be real. Engaging with technology, like computers or other electronic devices, could ground you and keep you connected to reality. This could also be a great time to explore training in fields like computer graphics or sound engineering.",
      "horoscope_ja": "今日は、まるで雲間を漂っているかのように、夢のようなロマンチックな霞の中を漂っているかもしれません。周りのすべてが牧歌的で魅惑的に見え、現実とは思えないほど素晴らしいかもしれません。コンピューターやその他の電子機器などのテクノロジーに触れることで、落ち着きを取り戻し、現実との繋がりを保つことができます。また、コンピューターグラフィックスやサウンドエンジニアリングなどの分野でのトレーニングを検討するのにも最適な時期かもしれません。"
    },
    "virgo": {
      "date": "2025-11-10",
      "sign": "Virgo",
      "horoscope": "Today, your thoughts are likely to be colored by romantic feelings towards your friends. You may find yourself viewing a long-time companion in a fresh, romantic way. The idea of a supportive group might appear to hold the key to resolving your challenges. You could feel an overwhelming appreciation for your friends, believing them to be the best in the world. While this positive perspective is uplifting, just be cautious not to idealize everyone as flawless!",
      "horoscope_ja": "今日は、友人への恋愛感情に心が支配されやすい日です。長年のパートナーを、新鮮でロマンチックな目で見るようになるかもしれません。支え合える仲間の存在が、あなたの課題解決の鍵となるかもしれません。友人たちへの感謝の気持ちが溢れ、彼らが世界で一番素晴らしいと感じられるかもしれません。こうした前向きな考え方は心を明るくしますが、誰もが完璧だと理想化しないように注意しましょう。"
    },
    "libra": {
      "date": "2025-11-10",
      "sign": "Libra",
      "horoscope": "With your professional life thriving, you may find yourself lost in fantasies of success and even fame! While it's great to envision your future achievements, remember that this is just the beginning of your journey. Channel your practicality to create a solid plan for moving forward. Remember, dreams require effort and strategy to become reality.",
      "horoscope_ja": "仕事が順調に進み、成功や名声といった夢に囚われてしまうこともあるかもしれません。将来の成功を思い描くのは素晴らしいことですが、これはまだ旅の始まりに過ぎないことを忘れないでください。現実的な視点で、着実に前進するための計画を立てましょう。夢を実現するには、努力と戦略が必要です。"
    },
    "scorpio": {
      "date": "2025-11-10",
      "sign": "Scorpio",
      "horoscope": "Today, your thoughts are likely to drift towards spiritual or philosophical themes, sparking your curiosity about intriguing new concepts. Some of these ideas may originate from distant places, igniting a desire for travel. Friends or social circles might introduce these notions to you, or you might find yourself sharing your insights with them. To quiet your busy mind before sleep, consider taking a stroll; otherwise, those thoughts may keep you awake!",
      "horoscope_ja": "今日は、スピリチュアルや哲学的なテーマに思考が傾き、興味深い新しい概念への好奇心が刺激されるかもしれません。こうしたアイデアの中には、遠く離れた場所からやってきたものもあり、旅への憧れを掻き立てるかもしれません。友人や交友関係の人たちからこうした考えを紹介されたり、自分の洞察を彼らと共有したりすることもあるでしょう。寝る前に忙しい心を静めるには、散歩に出かけてみるのも良いでしょう。そうしないと、考え事で眠れなくなってしまうかもしれません。"
    },
    "sagittarius": {
      "date": "2025-11-10",
      "sign": "Sagittarius",
      "horoscope": "Today, love is likely to dominate your mind. Expect some intriguing dreams tonight that could be filled with romance or spark your creativity—or perhaps a mix of both! Be sure to jot them down, as they may uncover insights about yourself that could be significant. When it comes to finances, your feelings may fluctuate between assurance and anxiety. Remember to stay grounded in reality!",
      "horoscope_ja": "今日は、愛があなたの心を支配しそうです。今夜は、ロマンスに満ちた、あるいは創造性を刺激するような、興味深い夢を見るかもしれません。あるいは、その両方かもしれません。夢は必ず書き留めてください。自分自身について、重要な洞察が得られるかもしれません。お金のこととなると、安心感と不安の間で揺れ動くかもしれません。現実にしっかりと目を向けることを忘れないでください！"
    },
    "capricorn": {
      "date": "2025-11-10",
      "sign": "Capricorn",
      "horoscope": "Your thoughts are likely to drift towards love today. For those in a marriage, expect to deepen your bond with your spouse. If you're single but dating, your connection might evolve into something more serious. And if you're not currently seeing anyone, be prepared to encounter someone intriguing. A sense of closeness and affection may envelop you. Embrace your partner for who they truly are.",
      "horoscope_ja": "今日は、あなたの思考が愛へと向かう可能性が高くなります。既婚の方は、配偶者との絆が深まるでしょう。独身で交際中の方は、二人の関係がより真剣なものへと発展するかもしれません。そして、現在交際相手がいない方は、魅力的な人に出会う準備をしておきましょう。親密さと愛情があなたを包み込むかもしれません。パートナーのありのままの姿を受け入れてあげてください。"
    },
    "aquarius": {
      "date": "2025-11-10",
      "sign": "Aquarius",
      "horoscope": "You're radiating positivity and your appearance is on point, so get ready for some compliments! However, be cautious, as your confidence might lead you to overestimate your energy levels. If you push yourself too hard today, you could end up feeling drained tomorrow. Focus on nourishing your body, ensuring you get plenty of rest, and take things at a steady pace. You'll still manage to check off all your tasks!",
      "horoscope_ja": "ポジティブな雰囲気が溢れ、見た目も完璧。褒め言葉も期待できそうです！でも、自信過剰になりすぎると、自分のエネルギーレベルを過大評価してしまうこともあるので注意が必要です。今日頑張りすぎると、明日は疲れ切ってしまうかもしれません。体に栄養を与え、十分な休息を取り、物事を着実に進めていきましょう。そうすれば、きっとすべてのタスクをこなせるはずです！"
    },
    "pisces": {
      "date": "2025-11-10",
      "sign": "Pisces",
      "horoscope": "Love is wrapped in a dreamy atmosphere today, making your partner seem like they’ve walked straight out of a storybook. Remember, even the most enchanting characters have their imperfections, and those quirks can be quite charming! Your creative spirit is soaring, and any artistic endeavors you embark on may carry a magical essence that enhances their beauty and significance. Embrace this inspiration!",
      "horoscope_ja": "今日、愛は夢のような雰囲気に包まれ、あなたのパートナーはまるで絵本から飛び出してきたかのようです。どんなに魅力的な人物にも欠点はあるものです。そして、その欠点こそが、時にとても魅力的になることもあるのです！あなたの創造力は高揚し、どんな芸術的な試みにも、その美しさと意義を高める魔法のエッセンスが宿るかもしれません。このインスピレーションを、ぜひ受け入れてください！"
    }
  }
}