{
  "updated_at": "2025-11-20T16:31:54.822Z",
  "jst_date": "2025-11-21",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-21",
      "sign": "Aries",
      "horoscope": "Gaining new knowledge and enhancing your interactions with loved ones significantly boosts your self-worth. A project you've dedicated time and energy to in recent weeks has reached a successful conclusion, allowing you to revel in the appreciation of those around you. You might also find yourself with a little extra cash to enjoy. You've earned this reward through your hard work!",
      "horoscope_ja": "新しい知識を得て、大切な人との交流を深めることで、あなたの自尊心は大きく高まります。ここ数週間、時間とエネルギーを費やしてきたプロジェクトが成功し、周囲の人々から感謝の気持ちを伝えられ、喜びに浸っています。また、ちょっとしたお小遣いが手に入るかもしれません。これは、あなたの努力がもたらしたご褒美です！"
    },
    "taurus": {
      "date": "2025-11-21",
      "sign": "Taurus",
      "horoscope": "A positive shift in your connection with a romantic partner or a dear friend is filling you with hope for both the present and the future. Your self-esteem is robust, and you're crafting uplifting visions for the upcoming months. However, it's wise to hold off on making any firm commitments at this time. Jot down your thoughts and revisit them later when the initial excitement has settled.",
      "horoscope_ja": "恋人や親しい友人との関係に良い変化が訪れ、現在と未来の両方に希望が湧いています。自尊心は高く、これからの数ヶ月に向けて明るいビジョンを描いています。しかし、今は何かを確約するのは控えた方が賢明です。考えを書き留めておき、最初の興奮が落ち着いた後に改めて考えてみましょう。"
    },
    "gemini": {
      "date": "2025-11-21",
      "sign": "Gemini",
      "horoscope": "A surprise increase in your income might inspire a wave of generosity towards your loved ones. While your thoughtful gestures will be well-received, be mindful not to deplete your newfound resources. Your mind may be filled with romantic fantasies, leading you to envision a thrilling experience with your partner. Embrace it! Cherish the memories that will linger in your heart in the days and weeks ahead.",
      "horoscope_ja": "収入が思いがけず増えたことで、愛する人たちへの寛大な気持ちが湧いてくるかもしれません。あなたの思いやりある行動はきっと喜ばれるでしょうが、新たに得た資源を枯渇させないよう気をつけてください。ロマンチックな空想で心が満たされ、パートナーとのスリリングな体験を思い描くかもしれません。その気持ちを受け止めてください！これから数日、数週間、心の中に残るであろう思い出を大切にしてください。"
    },
    "cancer": {
      "date": "2025-11-21",
      "sign": "Cancer",
      "horoscope": "You might experience a surprising spark of attraction today, something you never anticipated. Whether or not this leads to a romantic connection, the thrill of encountering someone new will uplift your spirits and enhance your outlook on life. Additionally, a yearning for adventure could inspire thoughts of traveling to far-off places. If a getaway has been on your mind, seize the day and start planning your escape!",
      "horoscope_ja": "今日は、思いもよらなかったような、意外な魅力のひらめきを感じるかもしれません。それが恋愛関係に発展するかどうかはさておき、新しい人との出会いのワクワク感は、あなたの気分を高揚させ、人生観を豊かにしてくれるでしょう。また、冒険への憧れが、遠く離れた場所への旅への思いを掻き立てるかもしれません。もし旅行を考えているなら、この日を逃さず、計画を立て始めましょう！"
    },
    "leo": {
      "date": "2025-11-21",
      "sign": "Leo",
      "horoscope": "You may find yourself drawn to films rich in special effects at this time. This could spark an interest in understanding the techniques behind these visual wonders. Consider exploring computer graphics as a creative outlet; your imagination could take you to unexpected places. Embrace this playful journey, as it may open doors for you down the line.",
      "horoscope_ja": "この時期は、特殊効果をふんだんに使った映画に惹かれるかもしれません。こうした視覚的な驚異の背後にある技術への興味が湧くかもしれません。コンピューターグラフィックスを創造的な表現手段として探求してみてはいかがでしょうか。想像力が思いもよらぬ場所へと導いてくれるかもしれません。この遊び心のある旅をぜひ楽しんでください。きっと、将来、新たな扉が開かれるかもしれません。"
    },
    "virgo": {
      "date": "2025-11-21",
      "sign": "Virgo",
      "horoscope": "Today, you embrace life as a thrilling journey. With the glow of previous achievements and the warmth of your friends' support, your confidence and enthusiasm are at an all-time high. You're open to exploring every potential path for your future, even if it means venturing to a far-off, exotic destination! This adventure promises opportunities for learning and connecting with like-minded individuals.",
      "horoscope_ja": "今日、あなたは人生をスリリングな旅として受け止めています。これまでの功績の輝きと友人たちの温かい支えに支えられ、自信と情熱はかつてないほど高まっています。たとえ遠く離れた異国への冒険を強いられることになっても、未来へのあらゆる可能性を探求する意欲に満ち溢れています。この冒険は、学びの機会と、志を同じくする人々との繋がりを約束してくれるでしょう。"
    },
    "libra": {
      "date": "2025-11-21",
      "sign": "Libra",
      "horoscope": "A fresh sense of unity and direction may foster a more uplifting vibe in your professional life. Expect to see acknowledgment for your efforts and a boost in your earnings soon. Be prepared for potential shifts ahead; you might find yourself exploring a completely new career path! Lean on the love and support of your friends to help navigate this exciting change.",
      "horoscope_ja": "新たな一体感と方向性が、仕事に活力をもたらすかもしれません。あなたの努力が認められ、収入もすぐに増えるでしょう。今後の変化に備えましょう。全く新しいキャリアパスを模索することになるかもしれません。この刺激的な変化を乗り越えるために、友人たちの愛とサポートを頼りにしてください。"
    },
    "scorpio": {
      "date": "2025-11-21",
      "sign": "Scorpio",
      "horoscope": "Today, your gatherings are infused with a sense of optimism and enthusiasm. You and your companions are likely to focus on the bright side, envisioning a future filled with success and minimal challenges. It's important to maintain this positive outlook, as hurdles can arise unexpectedly. You may find yourself forming a new support network with these encouraging individuals. Embrace this opportunity!",
      "horoscope_ja": "今日、あなたの集まりは楽観的な雰囲気と熱意に満ち溢れています。あなたと仲間たちは、成功に満ち、困難は最小限に抑えられた未来を思い描き、明るい面に目を向けるでしょう。予期せぬ困難に見舞われることもあるので、この前向きな姿勢を維持することが重要です。こうした励ましを与えてくれる人たちと、新たなサポートネットワークを築くことになるかもしれません。この機会をぜひ活かしてください！"
    },
    "sagittarius": {
      "date": "2025-11-21",
      "sign": "Sagittarius",
      "horoscope": "Today is a great day for getting organized! Consider leveraging technology to assist you, and don’t hesitate to enlist the support of friends. With a positive and energetic mindset, you’ll breeze through your tasks. By the time the day wraps up, you’ll feel proud of what you’ve achieved. So go ahead, indulge yourself and celebrate – you’ve earned it!",
      "horoscope_ja": "今日は整理整頓にぴったりの日です！テクノロジーを活用して、友達のサポートもぜひ活用してみてください。前向きでエネルギッシュな気持ちで、タスクをスムーズにこなせるはずです。一日が終わる頃には、達成感に胸を膨らませているはずです。さあ、思いっきり自分を甘やかして、お祝いしましょう。あなたはそれを成し遂げたのですから！"
    },
    "capricorn": {
      "date": "2025-11-21",
      "sign": "Capricorn",
      "horoscope": "Today, your romantic side may be in full bloom. If you're in a relationship, you might find yourself longing for a cozy, candlelit dinner with your partner. For those who are single, get ready for a shift in your love life; someone intriguing could enter your world and captivate you. Alternatively, an old acquaintance might suddenly catch your eye in a fresh way. Stay open to the unexpected!",
      "horoscope_ja": "今日は、あなたのロマンチックな一面が開花するかもしれません。もしあなたが恋人がいるなら、パートナーとキャンドルライトの灯りの下でゆったりとディナーを楽しみたい気持ちになるかもしれません。独身の方は、恋愛に変化が訪れるかもしれません。魅力的な人があなたの世界に現れ、あなたを虜にするかもしれません。あるいは、昔の知り合いが、突然、新鮮な形であなたの心を掴むかもしれません。予期せぬ出来事に心を開いてください！"
    },
    "aquarius": {
      "date": "2025-11-21",
      "sign": "Aquarius",
      "horoscope": "Taking care of essential cleaning or repairs around your home might spark a desire to refresh your space with some redecorating. Consider parting ways with outdated furniture or items you no longer need to create space for new decor that enhances your living area. Your friends and significant other may offer to lend a hand, so why not turn it into a fun gathering? It’s a great opportunity for everyone to enjoy themselves!",
      "horoscope_ja": "家の掃除や修理を済ませると、模様替えをして気分転換したいという気持ちが湧いてくるかもしれません。古くなった家具や不要になったものを処分して、リビングを素敵に彩る新しいインテリアのためのスペースを作ってみてはいかがでしょうか。友人やパートナーが手伝ってくれるかもしれませんので、楽しい集まりにしてみてはいかがでしょうか。みんなが楽しめる絶好の機会です！"
    },
    "pisces": {
      "date": "2025-11-21",
      "sign": "Pisces",
      "horoscope": "You may receive significant insights today, possibly through educational pursuits, reading materials, or discussions with friends. This could pave the way for exciting opportunities in both your personal and professional life. Whether you decide to delve into tech skills or explore your creative side, today is perfect for honing your abilities. As you embark on this journey, you might also cultivate some meaningful new connections.",
      "horoscope_ja": "今日は、教育的な探求、読書、友人との議論などを通して、重要な洞察を得るかもしれません。これは、プライベートでも仕事でも、刺激的な機会への道を開くかもしれません。テクノロジーのスキルを磨くにしても、クリエイティブな側面を探求するにしても、今日は自分の能力を磨く絶好の機会です。この旅に乗り出すことで、有意義な新しいつながりを育むこともできるかもしれません。"
    }
  }
}