{
  "updated_at": "2025-11-30T16:28:32.040Z",
  "jst_date": "2025-12-01",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-01",
      "sign": "Aries",
      "horoscope": "Avoid the trap of self-blame for situations that aren't your fault. It's possible that your guidance may have swayed someone, but their choices are ultimately theirs to bear. Keep in mind that everyone is accountable for their own actions. No matter the advice you offered, you cannot carry the weight of another's decisions.",
      "horoscope_ja": "自分のせいではない状況で自分を責めるという罠にはまらないようにしましょう。あなたのアドバイスが誰かに影響を与えた可能性はありますが、最終的にはその人の選択に責任を持つのはその人自身です。誰もが自分の行動に責任を持つことを忘れないでください。どんなにアドバイスをしても、他人の決断の重荷を背負うことはできません。"
    },
    "taurus": {
      "date": "2025-12-01",
      "sign": "Taurus",
      "horoscope": "You're experiencing a peak in your emotions, and they may feel unpredictable and overwhelming. Resist the urge to force logic into the chaos. Instead, focus on taking a deep breath and finding your calm. Life is a thrilling journey filled with unexpected moments, and these wild emotional swings are simply part of that adventure. Embrace the experience and enjoy the ride!",
      "horoscope_ja": "感情がピークに達し、予測不能で圧倒されているように感じるかもしれません。混沌とした状況に無理やり理屈を詰め込もうとする衝動を抑えましょう。代わりに、深呼吸をして心を落ち着かせることに集中しましょう。人生は予期せぬ瞬間に満ちたスリリングな旅であり、こうした激しい感情の揺れ動きも冒険の一部に過ぎません。この経験を受け入れ、旅を楽しんでください！"
    },
    "gemini": {
      "date": "2025-12-01",
      "sign": "Gemini",
      "horoscope": "Avoid confining yourself and shutting out the world beyond your immediate worries. The more you withdraw and deny the need for support from others, the deeper your feelings of frustration and sadness may grow. If you're feeling lonely, fearful, or upset, it's important to acknowledge these emotions both to yourself and to those around you. Reach out and connect with others instead of retreating further into solitude.",
      "horoscope_ja": "目の前の心配事以外、自分を閉じ込めて世界から遮断するのは避けましょう。引きこもり、他者からのサポートの必要性を否定すればするほど、フラストレーションや悲しみは深まるばかりです。孤独、恐怖、動揺を感じているなら、自分自身と周囲の人々の両方に、これらの感情を認めることが大切です。孤独に閉じこもるのではなく、他者と繋がり、手を差し伸べましょう。"
    },
    "cancer": {
      "date": "2025-12-01",
      "sign": "Cancer",
      "horoscope": "Today, you may find yourself feeling more sensitive than normal. The shifts happening around you, both in your surroundings and your mindset, will keep you alert and engaged. The silver lining is that this heightened awareness will lead to valuable insights into the emotions and viewpoints of those around you. This newfound understanding will empower you to make more informed choices in your interactions and decisions.",
      "horoscope_ja": "今日は、普段よりも敏感になっているかもしれません。周囲で起こっている変化、つまり環境と心境の変化が、あなたを常に注意深く、積極的に活動させてくれるでしょう。明るい兆しは、この意識の高まりが、周囲の人々の感情や視点への貴重な洞察につながることです。この新たな理解は、人との交流や意思決定において、より情報に基づいた選択をするための力を与えてくれるでしょう。"
    },
    "leo": {
      "date": "2025-12-01",
      "sign": "Leo",
      "horoscope": "You might find yourself taken aback by the surprising insights of unexpected individuals, particularly women, today. A conversation with your mother could unveil a topic you hadn't thought about before. Additionally, memories of impactful words from a significant woman in your life may stir your emotions. Your feelings may oscillate between your heart and mind, creating a whirlwind of thoughts. While it's important to acknowledge these emotions, strive to ensure they don't overshadow your decision-making process.",
      "horoscope_ja": "今日は、思いもよらぬ人、特に女性の驚くべき洞察に、思わず驚かされるかもしれません。お母様との会話で、これまで考えもしなかった話題が明らかになるかもしれません。また、人生で大切な女性からかけられた、心に響く言葉の記憶が、あなたの感情を揺さぶるかもしれません。心と頭の間で感情が揺れ動き、思考が渦巻くこともあるでしょう。こうした感情を認めることは大切ですが、意思決定のプロセスに影を落とさないように注意しましょう。"
    },
    "virgo": {
      "date": "2025-12-01",
      "sign": "Virgo",
      "horoscope": "Today, you're feeling particularly set in your ways, and it's clear that you want things to unfold according to your vision. Your determination is strong, and anyone who thinks they can sway your opinion might be in for a surprise. However, it's worth noting that your perspective could shift multiple times throughout the day, and that's perfectly okay. Just remember, it might be a challenge for others to keep pace with your changing thoughts!",
      "horoscope_ja": "今日は、特に自分の考えに固執しているように感じます。物事が自分のビジョン通りに展開することを望んでいるのは明らかです。あなたの決意は強く、あなたの意見を変えようと考えている人は、驚くことになるかもしれません。しかし、あなたの視点は一日を通して何度も変化する可能性があり、それは全く問題ありません。ただ、他の人にとっては、あなたの変化する考えについていくのが難しいかもしれないということを覚えておいてください。"
    },
    "libra": {
      "date": "2025-12-01",
      "sign": "Libra",
      "horoscope": "This morning, you might find yourself facing an obstacle that feels insurmountable. However, as the day progresses into the evening, you should notice a shift. Keep in mind that the more you try to force your way through this barrier, the more frustration you'll feel, and the more energy you'll waste. If you take a moment to pause and reassess, you'll discover that navigating around the obstacle is far simpler than you imagined.",
      "horoscope_ja": "今朝は、乗り越えられないと思える障害に直面しているかもしれません。しかし、日が暮れていくにつれて、変化に気づくはずです。この障壁を無理やり乗り越えようとすればするほど、フラストレーションが増し、エネルギーを無駄にしてしまうことを覚えておいてください。少し立ち止まって状況を見直せば、障害を乗り越えることは想像以上に簡単だと気づくでしょう。"
    },
    "scorpio": {
      "date": "2025-12-01",
      "sign": "Scorpio",
      "horoscope": "You might find yourself feeling like a racehorse trapped in the starting gate, eager to burst forth but confined in a tight space. The anticipation is building, and it can be frustrating to feel like you have no say in when the gate will swing open. Remember to exercise patience during this waiting period. Instead of letting your energy dissipate through restlessness, conserve it. The moment to take off will arrive before you know it, and you'll be ready to sprint ahead.",
      "horoscope_ja": "スタートゲートに閉じ込められた競走馬のように、勢いよく飛び出したいのに狭い空間に閉じ込められているような気分になるかもしれません。期待が高まる一方で、ゲートがいつ開くのか自分では判断できないようなもどかしさを感じるかもしれません。この待ち時間には、忍耐強く待つことを忘れないでください。焦燥感でエネルギーを消耗させるのではなく、温存しましょう。あっという間にスタートの瞬間が訪れ、あなたは全力疾走する準備が整っているはずです。"
    },
    "sagittarius": {
      "date": "2025-12-01",
      "sign": "Sagittarius",
      "horoscope": "Today, your emotions may take you on a rollercoaster ride. After the uplifting vibes of the past few days, you’re feeling a deeper connection with those around you. There’s a comforting love from someone that brings joy to your heart and peace to your mind. However, as the day winds down, you might sense that some individuals aren’t as genuine as they initially appeared. Keep your wits about you.",
      "horoscope_ja": "今日は感情がジェットコースターのように激しく揺れ動くかもしれません。ここ数日の高揚感を経て、周りの人々との繋がりがより深くなっているのを感じています。誰かからの温かい愛情が、あなたの心に喜びと平安をもたらしてくれます。しかし、一日が終わりに近づくにつれ、一部の人が当初ほど誠実ではないと感じるかもしれません。冷静さを保ちましょう。"
    },
    "capricorn": {
      "date": "2025-12-01",
      "sign": "Capricorn",
      "horoscope": "Exercise caution before speaking in moments where it may not be suitable. When discussions slow down, you might feel compelled to fill the void. However, this could lead to veering into a topic that isn't fitting. You might be tempted to interject simply to redirect attention towards yourself. Instead, consider embracing the quiet and letting it linger comfortably.",
      "horoscope_ja": "適切ではないと思われる瞬間に発言する前に、注意を払いましょう。議論が停滞すると、その場の空気を埋めたくなるかもしれません。しかし、そうすると、場にふさわしくない話題に逸れてしまう可能性があります。自分の話題に視線を向けさせるために、つい口を挟みたくなるかもしれません。そうではなく、静寂を受け入れ、心地よくその静寂が続くようにしてみましょう。"
    },
    "aquarius": {
      "date": "2025-12-01",
      "sign": "Aquarius",
      "horoscope": "Kick off your morning by getting your affairs in order, as the afternoon may bring a sense of chaos. By establishing a clear strategy for the day’s responsibilities, you’ll enhance your chances of checking everything off your list. Stay focused and assertive; otherwise, your kind-heartedness might lead others to lean on you too much, resulting in you taking on more favors than actual work.",
      "horoscope_ja": "午後は混乱しがちなので、午前中はまず身の回りのことを整理しましょう。その日の責任について明確な戦略を立てることで、リストにあることをすべてこなせる可能性が高まります。集中力と積極性を保ちましょう。そうでないと、あなたの親切心が他人に頼りすぎてしまい、仕事よりも頼みごとばかり引き受けてしまうかもしれません。"
    },
    "pisces": {
      "date": "2025-12-01",
      "sign": "Pisces",
      "horoscope": "Amidst the whirlwind of activity surrounding you, you'll find yourself more than capable of managing it all. Your natural charisma will open doors and create opportunities. You'll adeptly balance multiple tasks, with others seeking your guidance and reassurance. With a composed mindset and a diplomatic approach, you'll navigate challenges with integrity. As the day progresses, expect the pace to intensify, but rest assured, you’ll remain unfazed.",
      "horoscope_ja": "周囲を取り巻く慌ただしい活動の渦の中でも、あなたはすべてをこなすだけの力があることに気づくでしょう。持ち前のカリスマ性で、様々な扉を開き、チャンスを創り出すでしょう。複数のタスクを巧みにバランスよくこなし、周囲の人々はあなたの指導と安心を求めています。冷静な姿勢と外交的なアプローチで、誠実さをもって困難を乗り越えていくでしょう。一日が進むにつれて、ペースが速まっていくことが予想されますが、ご安心ください。あなたは動揺することはありません。"
    }
  }
}