{
  "updated_at": "2025-11-04T11:00:23.594Z",
  "jst_date": "2025-11-04",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-11-04",
      "sign": "Aries",
      "horoscope": "Today is a day to focus on your finances. It's time to settle bills, deposit checks, or finalize contracts. Taking care of these tasks will bring you a sense of relief and boost your mood significantly. Make sure to step outside for some fresh air; a walk will help you release some pent-up energy and get those endorphins flowing. Reach out to a friend and enjoy a fun evening out. You've put in the effort, and you’ve earned this time to unwind.",
      "horoscope_ja": "今日は家計に気を配る日です。請求書の支払い、小切手の入金、契約の締結など、やるべきことはたくさんあります。これらのタスクをこなすことで、心が安らぎ、気分も格段に良くなります。外に出て新鮮な空気を吸いましょう。散歩は溜まったエネルギーを発散させ、エンドルフィンを分泌させるのに役立ちます。友人と連絡を取り、楽しい夜を過ごしましょう。せっかく頑張ってきたのですから、このリラックスする時間も十分に得られるはずです。"
    },
    "taurus": {
      "date": "2025-11-04",
      "sign": "Taurus",
      "horoscope": "You're feeling fantastic and ready to tackle just about anything that comes your way. With your energy levels soaring, it's a perfect time to engage in some physical activity, perhaps through sports. Consider taking a quick getaway or diving into a new learning experience, or even exploring your writing skills. Your excitement and positive outlook are at an all-time high, so don't hold back—limitless possibilities await you!",
      "horoscope_ja": "気分は最高潮で、どんなことにも挑戦する準備ができています。エネルギーレベルが急上昇しているので、スポーツなど、身体を動かすのに最適な時期です。ちょっとした小旅行に出かけたり、新しい学習体験に飛び込んだり、ライティングスキルを磨いたりするのも良いでしょう。あなたのワクワク感と前向きな見通しは最高潮に達しています。ためらわずに、無限の可能性があなたを待っています！"
    },
    "gemini": {
      "date": "2025-11-04",
      "sign": "Gemini",
      "horoscope": "You may experience a deep intuitive connection with a distant friend you haven't connected with in ages. Thoughts of them might cross your mind, possibly causing you some concern. Don't hesitate to reach out! A simple call could bridge the gap and bring clarity. Your friend might just be going through a tough time, and your support could mean the world to them.",
      "horoscope_ja": "長い間連絡を取っていなかった遠く離れた友人と、直感的に深い繋がりを感じるかもしれません。その友人のことが頭をよぎり、不安に駆られることもあるかもしれません。でも、ためらわずに連絡してみてください！ちょっとした電話で、溝を埋め、気持ちを整理できるかもしれません。もしかしたら、友人はただ辛い時期を過ごしているだけかもしれません。あなたのサポートは、彼らにとってかけがえのない存在となるかもしれません。"
    },
    "cancer": {
      "date": "2025-11-04",
      "sign": "Cancer",
      "horoscope": "Today, you might find that group gatherings or meetings are charged with tension, as differing opinions spark passionate debates among those present. It's best to steer clear of any contentious conversations, even if you feel drawn to engage. Instead, seek out a like-minded individual who is also avoiding the fray and share your thoughts with them.",
      "horoscope_ja": "今日は、グループでの集まりや会議で、意見の相違が参加者の間で白熱した議論を巻き起こし、緊張感が高まるかもしれません。たとえ参加したくても、議論を呼ぶような会話には近づかないのが賢明です。代わりに、同じように議論を避けている、同じような考えを持つ人を探し、自分の考えを共有しましょう。"
    },
    "leo": {
      "date": "2025-11-04",
      "sign": "Leo",
      "horoscope": "You might find yourself feeling anxious about potential shifts in your personal or work life. However, there's no need to fret! These changes are likely to bring you positive outcomes. While the atmosphere may feel charged with tension and stress, it's important to not let it overwhelm you. Take a deep breath and allow yourself to go with the flow.",
      "horoscope_ja": "プライベートや仕事で何か変化が起こるかもしれないと不安に感じるかもしれません。でも、心配する必要はありません！これらの変化は、きっと良い結果をもたらすでしょう。緊張感やストレスが漂う雰囲気を感じるかもしれませんが、それに圧倒されないようにすることが大切です。深呼吸をして、流れに身を任せましょう。"
    },
    "virgo": {
      "date": "2025-11-04",
      "sign": "Virgo",
      "horoscope": "You've likely been contemplating a significant journey or pursuing further education, but have hesitated until now. The moment has arrived, and you've crossed that threshold into action! Nothing can hold you back now! Expect to dedicate a good amount of time on the phone, collecting details and laying the groundwork for your exciting new adventure.",
      "horoscope_ja": "きっと、これまで大きな旅やさらなる教育への挑戦を思い描いていたものの、ためらっていたことでしょう。ついにその時が来ました。行動に移すための一歩を踏み出したのです！もう、あなたを阻むものは何もありません！電話で詳細を聞き出し、このエキサイティングな新しい冒険に向けて準備を整えるのに、かなりの時間を費やすことになるでしょう。"
    },
    "libra": {
      "date": "2025-11-04",
      "sign": "Libra",
      "horoscope": "Today marks the completion of those financial legal documents you've been diligently handling. This accomplishment is sure to boost your mood, simply by clearing that task off your plate! You'll find yourself brimming with energy, eager to chat, and filled with passion. Consider planning a special date night with your significant other. Enjoy the moment!",
      "horoscope_ja": "今日は、これまで懸命に取り組んできた金融関連の法的書類の整理が完了した日です。この成果は、そのタスクを片付けるだけで、きっと気分を高揚させてくれるでしょう！エネルギーが溢れ、おしゃべりに夢中になり、情熱が溢れてくるでしょう。大切な人と特別なデートの夜を計画してみてはいかがでしょうか。この瞬間を心ゆくまでお楽しみください！"
    },
    "scorpio": {
      "date": "2025-11-04",
      "sign": "Scorpio",
      "horoscope": "Today, a friend, coworker, or romantic partner may be feeling particularly volatile due to some recent negative experiences related to their career, family, travel, or education. Their mood could swing dramatically, shifting from joy to despair in an instant. It's best to refrain from offering advice or attempting to lift their spirits, as this may only provoke frustration. Instead, give them the space they need to navigate their feelings.",
      "horoscope_ja": "今日、友人、同僚、あるいは恋人が、仕事、家族、旅行、あるいは教育に関する最近のネガティブな経験のために、特に不安定な気持ちになっているかもしれません。喜びから絶望へと、感情が劇的に揺れ動く可能性があります。アドバイスをしたり、元気づけようとしたりするのは控えた方が良いでしょう。かえってフラストレーションを募らせるだけかもしれません。むしろ、彼らが自分の感情を整理するために必要な空間を与えてあげましょう。"
    },
    "sagittarius": {
      "date": "2025-11-04",
      "sign": "Sagittarius",
      "horoscope": "You may be feeling the weight of work-related stress today. Staying hydrated is essential, so make sure to drink plenty of water. It's also wise to balance your day with some light exercise and adequate rest. Try to avoid overly spicy meals. This is an excellent time to dive into reading, studying, or conducting research. While your body might not feel its best, your mind is definitely on point.",
      "horoscope_ja": "今日は仕事のストレスを感じているかもしれません。水分補給は不可欠ですので、たっぷりと水を飲んでください。また、軽い運動と十分な休息でバランスの取れた一日を過ごすのも賢明です。辛い食事は避けましょう。読書、勉強、研究に没頭するのに最適な時間です。体調は万全ではないかもしれませんが、心は間違いなく万全です。"
    },
    "capricorn": {
      "date": "2025-11-04",
      "sign": "Capricorn",
      "horoscope": "Today, your heart is likely to be filled with romance and passion, sparking a desire to connect with your significant other. While plans may come together at the last moment, don’t fret if you can’t get in touch with your partner early on. Keep the faith! A wonderful evening awaits you.",
      "horoscope_ja": "今日は、あなたの心はロマンスと情熱で満たされ、大切な人と繋がりたいという気持ちが湧き上がるでしょう。予定がギリギリになってからうまくいくこともあるかもしれませんが、たとえ早い段階でパートナーと連絡が取れなくても、焦らないでください。信念を持ち続けてください！素晴らしい夜があなたを待っています。"
    },
    "aquarius": {
      "date": "2025-11-04",
      "sign": "Aquarius",
      "horoscope": "Today, you might encounter a sharp-minded woman, possibly a coworker, who can be both insightful and a bit irritating. If you're not cautious, she may provoke you into a spirited debate or trigger some insecurities. It's wise to keep your distance. Remember, she has her own challenges to face that don't concern you. Approach her with kindness and empathy, but don't hesitate to set boundaries and gently guide her away when the time is right!",
      "horoscope_ja": "今日、あなたは、洞察力に富みながらも少しイライラさせられる、鋭い洞察力を持つ女性、もしかしたら同僚に出会うかもしれません。注意を怠ると、激しい議論を巻き起こしたり、不安をかき立てたりするかもしれません。彼女とは距離を置くのが賢明です。彼女には、あなたには関係のない、彼女自身の課題があることを忘れないでください。優しさと共感を持って接しましょう。しかし、躊躇せずに境界線を設け、適切なタイミングで優しく彼女を遠ざけましょう。"
    },
    "pisces": {
      "date": "2025-11-04",
      "sign": "Pisces",
      "horoscope": "Today, you may find yourself receiving a flurry of phone calls. Some will be from distant acquaintances, while others may come from friends grappling with emotional challenges. One call, in particular, could be from a romantic partner, stirring up excitement and anticipation for a reunion. You might feel inspired to take a drive to a beloved spot in your area to meet them. Just remember to save your voice and not overdo it on the phone!",
      "horoscope_ja": "今日は、電話が立て続けにかかってくるかもしれません。遠方の知り合いからのものもあれば、感情的な問題を抱えている友人からのものもあるでしょう。特に、恋人からの電話は、再会への期待と興奮を掻き立てるかもしれません。近所のお気に入りの場所へドライブに出かけて、その人に会いたくなるかもしれません。ただし、声を無駄にせず、電話に出すぎないようにご注意ください。"
    }
  }
}