{
  "updated_at": "2025-12-09T16:32:59.490Z",
  "jst_date": "2025-12-10",
  "timezone": "Asia/Tokyo",
  "horoscopes": {
    "aries": {
      "date": "2025-12-10",
      "sign": "Aries",
      "horoscope": "Today, your charisma will shine brightly! Your allure will reach new heights, especially in your career. If you have aspirations, dreams, or are seeking a salary increase, now is the perfect moment to voice those ambitions. Simply articulate your desires and allow your charm to work its magic.",
      "horoscope_ja": "今日、あなたのカリスマ性は輝きを放ちます！特に仕事において、あなたの魅力は新たな高みへと到達するでしょう。もしあなたが大きな野望や夢を抱いているなら、あるいは昇給を望んでいるなら、今こそそれらを声に出す絶好の機会です。ただ自分の願望を言葉にするだけで、あなたの魅力が魔法のように発揮されるでしょう。"
    },
    "taurus": {
      "date": "2025-12-10",
      "sign": "Taurus",
      "horoscope": "You're embarking on a journey of rediscovering your dreams. The past few months may have felt challenging, as if your options were constrained. However, you've put in significant effort to bridge the gap between your aspirations and the real world. This hard work has sparked a renewed passion for pursuing your dreams! Chase after them, but remember to be kind to yourself in the process.",
      "horoscope_ja": "あなたは今、自分の夢を再発見する旅に出ています。ここ数ヶ月は、選択肢が限られているように感じ、困難を感じたかもしれません。しかし、あなたは自分の夢と現実世界とのギャップを埋めるために、多大な努力を重ねてきました。この努力が、夢を追い求める情熱を新たに呼び起こしました。夢を追いかけましょう。ただし、その過程では、自分自身に優しくすることも忘れないでください。"
    },
    "gemini": {
      "date": "2025-12-10",
      "sign": "Gemini",
      "horoscope": "Expect a delightful surprise in your personal relationships today. Those close to you might express their gratitude in unexpected ways. Regardless, you have a fantastic opportunity to be in the limelight, shining brightly and looking your best. Embrace the admiration that comes your way!",
      "horoscope_ja": "今日は、人間関係において嬉しいサプライズが期待できます。身近な人が思いがけない形で感謝の気持ちを表してくれるかもしれません。いずれにせよ、脚光を浴び、明るく輝き、最高の自分を見せられる絶好の機会です。あなたに向けられる称賛を、心から受け止めてください！"
    },
    "cancer": {
      "date": "2025-12-10",
      "sign": "Cancer",
      "horoscope": "Today is a day brimming with potential for good fortune, particularly in your relationships. You might find a friend connecting you with someone extraordinary who can help you achieve your career dreams. Alternatively, your partner could delight you with a surprise gift that shows how much they care. No matter how your luck unfolds, have faith that today is set to be truly wonderful.",
      "horoscope_ja": "今日は幸運に恵まれる可能性に満ちた日です。特に人間関係において幸運が訪れるでしょう。友人が、あなたのキャリアの夢の実現を助けてくれる素晴らしい人との縁を結んでくれるかもしれません。あるいは、パートナーが、あなたのことをどれだけ大切に思っているかを示すサプライズギフトで、あなたを喜ばせるかもしれません。どんな運勢に転がろうとも、今日が本当に素晴らしい日になると信じてください。"
    },
    "leo": {
      "date": "2025-12-10",
      "sign": "Leo",
      "horoscope": "After a few days of tension, you might find that the mood has lightened considerably today. You could even find yourself sharing friendly conversations with those you’ve previously struggled to connect with. Embrace the tranquility of this day, allowing the soothing cosmic vibes to guide you as you savor the peaceful moments.",
      "horoscope_ja": "数日間の緊張が続いた後、今日は気分がかなり軽くなっていることに気づくかもしれません。これまでなかなか繋がりを持てなかった人たちと、友好的な会話を交わせるようになるかもしれません。この日の静けさを受け入れ、心地よい宇宙の波動に導かれながら、穏やかなひとときを心ゆくまで味わってください。"
    },
    "virgo": {
      "date": "2025-12-10",
      "sign": "Virgo",
      "horoscope": "Are you set on capturing the heart of someone special? Have you poured a lot of effort into this pursuit recently? Perhaps you're looking to breathe new life into your marriage? Today is incredibly favorable for matters of the heart. It's the perfect moment to indulge in playful flirting, pen heartfelt love notes, and stroll hand in hand down romantic paths!",
      "horoscope_ja": "特別な人の心を掴もうと決心していますか？最近、そのことに力を入れましたか？それとも、結婚生活に新たな息吹を吹き込みたいとお考えですか？今日は恋愛に絶好のチャンスです。軽快な戯れに耽ったり、心のこもったラブレターを書いたり、手をつないでロマンチックな散歩道を歩いたりするのに最適な瞬間です！"
    },
    "libra": {
      "date": "2025-12-10",
      "sign": "Libra",
      "horoscope": "Embrace today as a perfect opportunity to enjoy the warmth of your beloved home with your family. It’s a delightful day filled with the comforts of home. A serene and harmonious vibe prevails, easing any household stress. Use this time to rejuvenate your spirit, as you’ll want to be fully energized for what tomorrow brings.",
      "horoscope_ja": "今日は、ご家族と共に愛する我が家の温かさを満喫する絶好の機会です。我が家の心地よさに満ちた、素敵な一日です。穏やかで調和のとれた雰囲気が、家庭のストレスを和らげてくれます。明日への活力を十分に蓄えるためにも、この時間を活用して心をリフレッシュしましょう。"
    },
    "scorpio": {
      "date": "2025-12-10",
      "sign": "Scorpio",
      "horoscope": "Today is a wonderful opportunity for those who possess curiosity and creativity—like yourself! Although you might not be feeling your best emotionally, you'll find yourself appreciating the positive experiences that come your way. If you're looking to connect with others or dive into new adventures with friends, now is the perfect time. The cosmic energy is perfect for enjoyment and fun!",
      "horoscope_ja": "今日は、あなたのように好奇心と創造性に溢れる人にとって、素晴らしいチャンスです！感情面ではベストな状態ではないかもしれませんが、訪れるポジティブな経験に感謝する気持ちが湧いてくるでしょう。他の人と繋がりたい、友達と新しい冒険に飛び込みたいなら、今がまさに絶好のタイミングです。宇宙のエネルギーは、楽しみと喜びに満ち溢れています！"
    },
    "sagittarius": {
      "date": "2025-12-10",
      "sign": "Sagittarius",
      "horoscope": "If you've been feeling downcast recently, today is set to lift your spirits. You can step forward with complete assurance in the cosmic energies at play. Your allure will be heightened, making you even more captivating to those around you. Expect a wealth of fulfilling moments in both your professional and romantic endeavors!",
      "horoscope_ja": "最近、気分が落ち込んでいるなら、今日は気分が晴れやかになるでしょう。宇宙のエネルギーに身を委ね、自信を持って一歩踏み出せるでしょう。あなたの魅力は高まり、周りの人々をさらに魅了するでしょう。仕事でも恋愛でも、充実した瞬間がたくさんあるでしょう！"
    },
    "capricorn": {
      "date": "2025-12-10",
      "sign": "Capricorn",
      "horoscope": "Today, your shine and charisma steal the spotlight, making you the center of attention! You're truly a star! Others may look to you for guidance and inspiration. While you relish this leadership role, don’t overlook the importance of treating yourself. Consider pampering yourself with a small gift, embarking on a fun adventure, or simply enjoying some solitude—these little joys could be just what you need.",
      "horoscope_ja": "今日、あなたの輝きとカリスマ性がスポットライトを浴び、注目を集めるでしょう！あなたはまさにスターです！周りの人々はあなたに導きとインスピレーションを求めるかもしれません。リーダーシップを発揮するこの役割を心から楽しんでいる一方で、自分へのご褒美も忘れてはいけません。ちょっとしたプレゼントで自分を甘やかしたり、楽しい冒険に出かけたり、ただ一人で過ごしたりしてみてはいかがでしょうか。こうした小さな喜びこそが、まさにあなたが必要としているものかもしれません。"
    },
    "aquarius": {
      "date": "2025-12-10",
      "sign": "Aquarius",
      "horoscope": "Today brings a wave of positivity your way. You’re likely to feel a sense of tranquility and equilibrium, making you more patient with the fluctuating emotions and whims of those around you. If possible, carve out a little time from your hectic agenda to focus on yourself. While self-care may not be your usual practice, indulging in it today could be incredibly beneficial.",
      "horoscope_ja": "今日はポジティブな波があなたに訪れます。静けさと平衡感覚を感じ、周りの人の感情の揺れ動きや気まぐれに、より寛容になれるでしょう。可能であれば、慌ただしい日々の合間を縫って、少し時間を作り、自分自身に集中してみましょう。普段はセルフケアを実践していないかもしれませんが、今日はじっくりとセルフケアに取り組んでみることで、大きな効果が得られるかもしれません。"
    },
    "pisces": {
      "date": "2025-12-10",
      "sign": "Pisces",
      "horoscope": "Today, you'll experience a profound sense of connection to your life. The clarity around you will illuminate the strides you've taken toward your aspirations, filling you with a sense of fulfillment. It's a day to bask in your achievements, as you often do when you recognize the significance of your journey. However, remember that there are still tasks awaiting your attention.",
      "horoscope_ja": "今日は、人生との深い繋がりを実感するでしょう。周囲の明晰さが、あなたが夢に向かって歩んできた道のりを照らし出し、充実感に満たされるでしょう。これまでの道のりの意義に気づいた時によくするように、今日は達成感に浸る日です。しかし、まだあなたが取り組むべき課題が残っていることを忘れないでください。"
    }
  }
}